{"rooms":[{"name":"Auditorium","id":"ROOM59"},{"name":"Room 1","id":"ROOM60"},{"name":"Room 2","id":"ROOM61"},{"name":"Room 3","id":"ROOM62"},{"name":"Room 4","id":"ROOM63"}],"sessions":[{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/chet.jpg","speakers":["1004"],"description":"Come find out about the latest developments in Android technologies and APIs.","mainTag":"FLAG_KEYNOTE","id":"1008","isLivestream":false,"title":"What’s New in Android","endTimestamp":"2014-10-31T09:45:00Z","url":"http://uk.droidcon.com/2014/sessions/whats-new-in-android/","startTimestamp":"2014-10-31T09:00:00Z","room":"ROOM59","tags":["FLAG_KEYNOTE"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/35aa753.jpg","color":"#A4C639","speakers":["1022","1023"],"description":"The talk will cover several aspects related to security issues concerning the “Key Management” for Android apps.\r\nIn the first part of the talk, various scenarios will be analyzed where it is necessary to protect the data used by an application, followed by a theoretical introduction of the possible techniques available for protecting data using symmetric and asymmetric key cryptosystems.\r\nThe talk will continue with the description and the implementation of some key management techniques used for storing securely encryption keys for symmetric algorithms, taking into account any interaction with the end user.\r\nThe final part of the talk will deal with the analysis of the tools provided by Android for the management of private keys and their certificates used in asymmetric algorithms, such as the KeyChain and the new “Android Key Store” , which is available from version 4.3.","id":"1026","isLivestream":false,"title":"Android Key Management","endTimestamp":"2014-10-31T10:45:00Z","url":"http://uk.droidcon.com/2014/sessions/android-key-management-2/","startTimestamp":"2014-10-31T10:00:00Z","room":"ROOM62","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/design_JuhaniLehtimaki.jpg","color":"#A4C639","speakers":["1016"],"description":"Android finally has established design guidelines and widely used UI design patterns. Android users understand functionality of components like the navigation drawer, action bar, sharing and many more. However, the guidelines are just that, guidelines, not rules.\r\n\r\nAll Android apps should not look alike but neither should they all reinvent all the controls. In this presentation Juhani will take a deep dive into details of the common design patterns and how they can be customised without compromising usability.\r\n\r\nI want to help developers and designers alike to understand how to correctly use Android UI design patterns.","id":"1017","isLivestream":false,"title":"Dear developers, design details matter","endTimestamp":"2014-10-31T10:45:00Z","url":"http://uk.droidcon.com/2014/sessions/juhani-lehtimaki/","startTimestamp":"2014-10-31T10:00:00Z","room":"ROOM59","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2012/09/markallison.jpg","color":"#A4C639","speakers":["1020"],"description":"The android.graphics APIs contain some useful tools which enable us to perform some tricks more commonly associated with Photoshop or Gimp. It is not always possible to use such tools, particularly when images are being loaded dynamically from external sources.\r\n\r\nMark Allison, author of http://blog.styling android.com , will explore these APIs and shows you get some amazing results by dynamically altering images in your app","id":"1028","isLivestream":false,"title":"Graphical Magic","endTimestamp":"2014-10-31T10:45:00Z","url":"http://uk.droidcon.com/2014/sessions/graphical-magic-2/","startTimestamp":"2014-10-31T10:00:00Z","room":"ROOM60","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/02d9a9c.jpg","color":"#A4C639","speakers":["1021"],"description":"The Android platform consists of a huge amount of code. With so much code, it is not uncommon that bugs and unexpected behaviour occurs. In this session Erik Hellman will explain some of the more interesting bugs and API behaviours that are present and how to deal with them. From subtle UI glitches, concurrency issues, the 64k method limit and more, this session will save you lots of time once you run into these bugs.","id":"1027","isLivestream":false,"title":"It’s not a bug, it’s a feature","endTimestamp":"2014-10-31T10:45:00Z","url":"http://uk.droidcon.com/2014/sessions/android-programming-pushing-the-limits/","startTimestamp":"2014-10-31T10:00:00Z","room":"ROOM61","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/7876966932476ff9bed2e31d12afff6a.jpeg","color":"#A4C639","speakers":["1024"],"description":"An exciting talk from David Gonzalez of Novoda. Stay tuned for more details!","id":"1025","isLivestream":false,"title":"Size does not matter, 2.83 inches is enough","endTimestamp":"2014-10-31T10:45:00Z","url":"http://uk.droidcon.com/2014/sessions/size-does-not-matter-2-83-inches-is-enough/","startTimestamp":"2014-10-31T10:00:00Z","room":"ROOM63","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed-4.png","color":"#A4C639","speakers":["1034"],"description":"Integrating accessibility features into new or existing applications to make it stand out and reachable to more users.\r\n\r\nThe session will cover:\r\n- Importance of accessibility while designing an application.\r\n– Android’s built-in accessibility features and its evolution in different Android versions. This will include Android’s built in – support for touch, speech and many other features that can be incorporated to make an application more accessible.\r\n– Deep dive into few of the available features like sensors, haptics, and gestures that will make the application stand out and – be more accessible.\r\n– Code examples explaining accessibility features.\r\n– Tips to add common useful effects that goes a long way in creating a compelling User Interface.","id":"1035","isLivestream":false,"title":"Designing Accessible Android Applications","endTimestamp":"2014-10-31T11:45:00Z","url":"http://uk.droidcon.com/2014/sessions/designing-accessible-android-applications/","startTimestamp":"2014-10-31T11:00:00Z","room":"ROOM63","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2012/07/chiuki.jpg","color":"#A4C639","speakers":["1033"],"description":"What does it take to make an app from good to great? Attention to detail. In this session we will dive into advanced techniques to customize Paint, the core of Android rendering. With Shaders and Filters, you can fine tune the look-and-feel of your app and delight your user with a polished UI.","id":"1036","isLivestream":false,"title":"Fun with Android Shaders and Filters","endTimestamp":"2014-10-31T11:45:00Z","url":"","startTimestamp":"2014-10-31T11:00:00Z","room":"ROOM62","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/bio_photo.jpg","color":"#A4C639","speakers":["1100"],"description":"This session will walk through the ever accelerating human innovation over the last 8000 years – and from that extrapolate likely scenarios for our near future. Beyond smartphones we find SmartWear and Internet of Things, and an unmatched effort in decentralised creation. We will go into detail on Sony SDKs and technology behind SmartEyeglass, SmartBand, SmartWatch and Wi-Fi controlled cameras.","id":"1101","isLivestream":false,"title":"Going beyond smartphones","endTimestamp":"2014-10-31T11:45:00Z","url":"http://uk.droidcon.com/2014/sessions/going-beyond-smartphones/","startTimestamp":"2014-10-31T11:00:00Z","room":"ROOM61","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/bp_CyrilMottier.jpg","color":"#A4C639","speakers":["1031"],"description":"Harnessing Android To Create Magic in Your Apps – Stay tuned for more details","id":"1038","isLivestream":false,"title":"Introduction to Android Wear – A Glimpse Into the Future","endTimestamp":"2014-10-31T11:45:00Z","url":"http://uk.droidcon.com/2014/sessions/introduction-to-android-wear-a-glimpse-into-the-future/","startTimestamp":"2014-10-31T11:00:00Z","room":"ROOM59","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/2b407d4.jpg","color":"#A4C639","speakers":["1032"],"description":"User Experience has become a major buzzword in the world of smart-phones. This is what everyone asks you to focus on. It’s a very important criterion which decides whether an application will really click or just fade off.\r\n\r\nBut what exactly is usability ? Researchers talk about ‘Basic Human Instincts’, experts talk about the ‘Useful, Usable and Desirable’ paradigm, and designers talk about ‘Themes and Colors’. This leaves the poor developer confused as to where to start, and what to focus on. Usability is not just about look and feel of the app, but also about how you build an app that is smooth, responsive, consistent, optimized in memory and battery usage, and at the same time pleasant on the eyes. By following a few guidelines, which may not be evident to all, we could actually improve usability of applications by leaps and bounds. In this session you’ll learn how to solve this problem by concentrating on the basics. We’ll focus on an app which is functionally complete but lacks good user experience. We’ll identify some of the major bottlenecks with respect to performance and usability, remove them step by step, and by the end of the session come up with a version of the same app which is lighter, faster, more usable and better looking.","id":"1037","isLivestream":false,"title":"The other side to Usability","endTimestamp":"2014-10-31T11:45:00Z","url":"http://uk.droidcon.com/2014/sessions/the-other-side-to-usability/","startTimestamp":"2014-10-31T11:00:00Z","room":"ROOM60","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed-11.jpg","color":"#A4C639","speakers":["1044","1043"],"description":"The SoundCloud app has been installed by tens of millions of users and our Android team has tripled in size over the last year. We want to share the engineering practices that we’ve come to value as our team, user base and codebase has grown. The cornerstone of our Android architecture is RxJava, We’ll talk about how it fits into our codebase and show some examples of the problems we’ve used it to solve.","id":"1050","isLivestream":false,"title":"Engineering for Android scale at SoundCloud","endTimestamp":"2014-10-31T12:45:00Z","url":"http://uk.droidcon.com/2014/sessions/engineering-for-android-scale-at-soundcloud/","startTimestamp":"2014-10-31T12:00:00Z","room":"ROOM63","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/bp_LucasRocha.jpg","color":"#A4C639","speakers":["1039"],"description":"If you ever built an Android app, you have definitely used some of the built-in layouts available in the platform—RelativeLayout, LinearLayout, FrameLayout, etc. They are our bread and butter for building Android UIs. The built-in layouts combined provide a powerful toolbox for implementing complex UIs. But there will still be cases where the design of your app will require you to implement custom layouts.\r\n\r\nIn this talk, Lucas will go through different techniques for implementing custom layouts on Android: from the simple composite views to the most complex flat layout views as well as custom view recycling layouts","id":"1046","isLivestream":false,"title":"Fun with Custom Layouts","endTimestamp":"2014-10-31T12:45:00Z","url":"http://uk.droidcon.com/2014/sessions/fun-with-custom-layouts/","startTimestamp":"2014-10-31T12:00:00Z","room":"ROOM59","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/bp_MarkMurphy.jpg","color":"#A4C639","speakers":["1040"],"description":"We never seem to have enough power. Users wail and gnash their teeth over how frequently they have to charge their devices, or tear out their hair when their device runs out of battery at inopportune moments.\r\n\r\nAnd we’re to blame for some of that. In this presentation, we will look at Project Volta, Google’s initiative to help reduce the power consumption of Android and its apps. We will look at the new battery event history that we have access to in the “L” Developer Preview and will see what coding antipatterns look like in that history. We will also discuss the “L” JobScheduler, a way for you to do recurring work in ways that are more friendly to the user’s battery. Note that this talk is BYOFC (Bring Your Own Flux Capacitor).","id":"1047","isLivestream":false,"title":"Getting By With Less Than 1.21 Gigawatts (“Project Volta”)","endTimestamp":"2014-10-31T12:45:00Z","url":"http://uk.droidcon.com/2014/sessions/getting-by-with-less-than-1-21-gigawatts-project-volta-2/","startTimestamp":"2014-10-31T12:00:00Z","room":"ROOM60","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/09/Etienne-sw1.jpg","color":"#A4C639","speakers":["1102","1103"],"description":"Join Etienne Studer & Marcin Erdmann for an exciting talk on Gradleware","id":"1049","isLivestream":false,"title":"Gradleware","endTimestamp":"2014-10-31T12:45:00Z","url":"http://uk.droidcon.com/2014/sessions/gradleware-2/","startTimestamp":"2014-10-31T12:00:00Z","room":"ROOM62","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/E9xxU-RD_400x400.jpeg","color":"#A4C639","speakers":["1041"],"description":"Although hard to see at a first sight, Android applications are not completely safe – with appropriate techniques they can be reverse engineered, and the insights can be accessible by any person with the right knowledge.\r\n\r\nThrough those techniques all the valuable data from the application can be accessed – not only graphical resources, but also secret tokens, HTTP address used for connecting our own web services, passwords, algorithms, etc. Creating safe applications and knowing which techniques will prevent unauthorized access to the source code and our resources is a must nowadays. This workshop will present three use cases on how applications can be reverse engineered. First, a single application will be decompiled, modifications will be applied on its source code, and we will see how this application can be compiled again. Secondly, we will show how we can extract from a crackme key information, such as the algorithm used to validate a key.\r\n\r\nLast, we will see a real case of reverse engineering of an application: how can we make a real code injection within an existing application. The second part will show which tools and techniques can be used to prevent attacks. ProGuard will be introduced as the main tool to obfuscate our code, but also some general good programming and developing practices will be introduced. The attendee will be familiar after this class also with techniques to protect stored data and to secure server interactions.","id":"1048","isLivestream":false,"title":"Reversing Engineering Android applications (and protecting them)","endTimestamp":"2014-10-31T12:45:00Z","url":"http://uk.droidcon.com/2014/sessions/reversing-engineering-android-applications-and-protecting-them/","startTimestamp":"2014-10-31T12:00:00Z","room":"ROOM61","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/10/Tim.png","color":"#A4C639","speakers":["1064"],"description":"User authentication in mobile apps is a very common and integral use case. Implementing regular passwords is an easy solution but comes with several pitfalls that impair user experience.\r\n\r\nIn this talk the security flaws and UX implications of passwords will be discussed and highlighted which different techniques exist that are able to offer a more mobile friendly flow. Highlighting authorization and authentication techniques like OAuth, OpenID Connect and even hardware features like Bluetooth Low Energy this talk will be interesting for anyone who’s facing a situation where creating and storing user accounts matters.","id":"1070","isLivestream":false,"title":"Death to Passwords","endTimestamp":"2014-10-31T14:30:00Z","url":"http://uk.droidcon.com/2014/sessions/death-to-passwords/","startTimestamp":"2014-10-31T13:45:00Z","room":"ROOM61","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/00cdeb7.jpg","color":"#A4C639","speakers":["1065","1066"],"description":"Shazam is a very popular audio recognition app. It is installed on 100M+ Android devices and it’s growing rapidly. In this talk, we would like to will address how we made the release schedule faster, more predictable and with more features by using BDD and automation testing.\r\n\r\nWe’ll demonstrate how that can be done without slowing down or hindering the development process and why our developers actually find writing tests is fun. Finally, we’ll look at how our testing strategy has translated to our testing framework and hardware infrastructure.","id":"1067","isLivestream":false,"title":"How to build rock-solid apps and keep 100M+ users happy","endTimestamp":"2014-10-31T14:30:00Z","url":"","startTimestamp":"2014-10-31T13:45:00Z","room":"ROOM63","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/profile.png","color":"#A4C639","speakers":["1062"],"description":"You don’t need to be a designer to use Animations to increase your app Experience, with better Feedback, smooth transitions, cal the user attention to important actions.\r\nThis talk shows why you should use Animations, and how to achieve this without too much work.","id":"1068","isLivestream":false,"title":"If I can, you can too – Animations for developers","endTimestamp":"2014-10-31T14:30:00Z","url":"http://uk.droidcon.com/2014/sessions/if-i-can-you-can-too-animations-for-developers-2/","startTimestamp":"2014-10-31T13:45:00Z","room":"ROOM59","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/Xavier.jpg","color":"#A4C639","speakers":["1063"],"description":"The Android NDK is used to integrate C/C++ code into Android applications and libraries.\r\nLearn how you can use the NDK with Eclipse and Android Studio, and how having native libraries impacts the distribution of apps on the Play Store.\r\nDiscover what changes from the new Android Runtime may break your integration, and how you can target new 64-bit architectures and android L-release.","id":"1069","isLivestream":false,"title":"Using the Android NDK","endTimestamp":"2014-10-31T14:30:00Z","url":"http://uk.droidcon.com/2014/sessions/using-the-android-ndk/","startTimestamp":"2014-10-31T13:45:00Z","room":"ROOM60","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed-1.jpg","color":"#A4C639","speakers":["1053"],"description":"Ever had to deal with terribly designed API or spent hours re-factoring your code to deal with an updated API? You’ve heard about RxJava but can’t see how it could benefit your project?\r\n\r\nThis talk will take the practical approach of a complex API to explain how RxJava and Functional Reactive Programming (FRP) can be used on every project to make your life easier.","id":"1058","isLivestream":false,"title":"Rx-Fy all the things!","endTimestamp":"2014-10-31T15:30:00Z","url":"http://uk.droidcon.com/2014/sessions/rx-fy-all-the-things/","startTimestamp":"2014-10-31T14:45:00Z","room":"ROOM60","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/unnamed-1.png","color":"#A4C639","speakers":["1052"],"description":"One of the elements that most of the designers and developers tend to forget is the feedback – and every single feedback crafted in the app plays a important role (or more) in minimizing user frustration and turn that into good user experience, regardless its effect size. Join this session to discover (or re-discover) the importance of feedback in interface design which can definitely help in crafting the next awesome app in the Play Store!","id":"1057","isLivestream":false,"title":"The Importance of Feedback in User Interface Design","endTimestamp":"2014-10-31T15:30:00Z","url":"http://uk.droidcon.com/2014/sessions/the-importance-of-feedback-in-user-interface-design-2/","startTimestamp":"2014-10-31T14:45:00Z","room":"ROOM59","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/1f94f9f.jpg","color":"#A4C639","speakers":["1054","1055"],"description":"Getting a streaming video in your Android smartphone or tablet is no longer enough. In the latest period, Google shows how to push this concept forward to new appliances. Chromecast and Android TV are two of the most promising gadgets for upsetting the way users enjoy video streaming.\r\n\r\nThis talk we’ll give you an overview about the streaming in Android. Starting from video streaming on mobile devices, we will guide you into the evolution of the development through Chromecast up to Android TV. Matteo Bonifazi and Alessandro Martellucci will be illustrating this talk with their experiences developing mobile television applications as SkyGo (http://apps.samsung.com/venus/topApps/topAppsDetail.as?productId=000000149322) and Sky Online (http://apps.samsung.com/venus/topApps/topAppsDetail.as?productId=000000818461) for Reply spa on behalf of Sky Italia.","id":"1059","isLivestream":false,"title":"Video Streaming: from the native Android player to uncoventional devices","endTimestamp":"2014-10-31T15:30:00Z","url":"http://uk.droidcon.com/2014/sessions/video-streaming-from-the-native-android-player-to-uncoventional-devices/","startTimestamp":"2014-10-31T14:45:00Z","room":"ROOM63","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/papayamobile-chris-hanage-r225x.jpg","color":"#A4C639","speakers":["1075"],"description":"With an app market forecast to be worth more than US$1.5 billion in 2015, China is an attractive but elusive market for app developers. Smartphone usage rates are soaring and China sits at number two in the overall app download charts. But it’s a mistake for developers to assume a game that succeeded with a Western audience will become an instant success in China – in fact, it’s often the case that the biggest Western games hardly make a dent in the Chinese market.\r\n\r\nChris Hanage, General Manager of Papaya Mobile and AppFlood for EMEA will analyse 10 successful games in China over the past 6-12 months, explaining why they succeeded and what inspiration they can give to Western developers hoping to increase their chances of successfully marketing their games in China.\r\n\r\nUsing case studies of real games launched in China, Chris’ presentation will give developers important insight into cultural differences relating to gameplay, graphics, content, imagery, in-game milestones, app size and monetisation strategies to be considered when planning and developing their app for a Chinese audience.","id":"1082","isLivestream":false,"title":"Climbing over the Great Wall: Lessons to learn from China’s most successful Android games","endTimestamp":"2014-10-31T16:30:00Z","url":"http://uk.droidcon.com/2014/sessions/climbing-over-the-great-wall-lessons-to-learn-from-chinas-most-successful-android-games/","startTimestamp":"2014-10-31T15:45:00Z","room":"ROOM63","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/bp_EricLafortune.jpg","color":"#A4C639","speakers":["1074"],"description":"Apps are getting larger, pushed by ever increasing user expectations. Social media, maps, advertisements,… As a developer, you may add a few libraries, and before you know it, your app is exceeding the constraints of the Android platform. In this presentation, I will discuss the main problems and some solutions. ProGuard, the bytecode optimizer and obfuscator in the Android SDK, is an obvious first step. I will show some optimized configurations that can help you to reduce the size of common libraries. If ProGuard isn’t sufficient, you may have to resort to more drastic techniques, such as dynamic class loading. I’ll discuss some techniques and their implications. I’ll also introduce the new dex splitting feature of our software DexGuard.","id":"1081","isLivestream":false,"title":"Fighting application size with ProGuard and beyond","endTimestamp":"2014-10-31T16:30:00Z","url":"http://uk.droidcon.com/2014/sessions/fighting-application-size-with-proguard-and-beyond/","startTimestamp":"2014-10-31T15:45:00Z","room":"ROOM62","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/09/sebastian.jpg","color":"#A4C639","speakers":["1071"],"description":"Sebastiano Poggi is an Android Software Craftsman at Novoda in London.\r\nA self-taught and strong OSS believer who loves beautiful and simple UX and UI, where “less is more”, Sebastiano spends a big chunk of his spare time reading and writing about Android development. He also creates and maintains some FOSS apps and libraries, that span from the fun, smaller projects to the more serious (and, perhaps, useful) work.\r\nSebastiano worked for some time in AKQA as a Senior Software Engineer. Before moving to London, he also worked at i’m Spa (an Italian smartwatch startup) for two years, playing with the Android platform and handling their Developer Relations. He’s been toying with the Android SDK since 2010.","id":"1078","isLivestream":false,"title":"Framing the Canvas","endTimestamp":"2014-10-31T16:30:00Z","url":"http://uk.droidcon.com/2014/sessions/framing-the-canvas/","startTimestamp":"2014-10-31T15:45:00Z","room":"ROOM59","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/lisa-neigut.png","color":"#A4C639","speakers":["1073"],"description":"Etsy loves Gradle. On the Android team, we use it for all our builds, and have it integrated with our Jenkins / CI jobs to run all of our tests, lints, builds, update version numbers, and deploy our internal releases. Everyone should love Gradle. This talk will get the audience acquainted with the Groovy/Gradle DSL, and then move into some really sweet ways you can clean up and reuse your build code (for multiproject builds and plugins).\r\n\r\nWhat this talk will cover:\r\nGroovy basics: closures, filtering, variable declaration, classes\r\nGradle primitives: files, tasks, configurations\r\nGradle execution phases: configuration and execution\r\nSetting up a multiproject build\r\nWriting a Gradle plugin to make reusable build logic: I’ll walk through the process we went through to set up a simple Gradle plugin we use at Etsy to keep our tablet layouts synced across multiple screen resolutions.","id":"1080","isLivestream":false,"title":"Gradlin’: Plugging it in for build success","endTimestamp":"2014-10-31T16:30:00Z","url":"http://uk.droidcon.com/2014/sessions/4890/","startTimestamp":"2014-10-31T15:45:00Z","room":"ROOM61","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/games_NicollHunt.jpg","color":"#A4C639","speakers":["1072"],"description":"Releasing and marketing quality games as a solo developer is a challenging undertaking, but as breakout hits like Thomas Was Alone, Retro City Rampage and Minecraft show, entirely achievable. Access to high quality tools, digital distribution and the ability to develop for multiple platforms has made solo game development more accessible than ever before. Using his trademark humour, Nicoll describes the challenges and obstacles facing solo developers and shares his methodologies and top tips for running a successful studio compromised of one single employee.","id":"1079","isLivestream":false,"title":"How to Build a One Man Band","endTimestamp":"2014-10-31T16:30:00Z","url":"http://uk.droidcon.com/2014/sessions/how-to-build-a-one-man-band/","startTimestamp":"2014-10-31T15:45:00Z","room":"ROOM60","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/rnfixa3sva9kvuijox5r.png","color":"#A4C639","speakers":["1089"],"description":"Even with the introduction of the new ART runtime replacing Dalvik VM our android apps are still build in Java.\r\n\r\nWe know one of the main characteristics of Java is portability, and that usually means it is not as efficient as it should be. That might be the reason Java has never been associated with high performance, but nowadays there are a lot of Java powered devices in the world and lots of people are building applications for them.\r\n\r\nCompilers that produce native machine code do a great optimisation job because they know where the code is going to be executed. But because of the portability feature, the Java Compiler could not assume anything about where our program is going to run and leaves all the optimisations to be done by the JVM while loading or, even, running our code (or converting it to native code in the case of ART)\r\n\r\nHaving that in mind, we will explore what can be done to help the compiler produce optimal code which, in fact, will make the life easier of the Dalvik VM or ART.\r\n\r\nIn this session you will not only learn how to make your Android code faster but also what to avoid when looking for critical performance and a bigger understanding of how the Java compiler works, and how these small changes affect to Dalvik VM and the new ART runtime.","id":"1094","isLivestream":false,"title":"How to improve android app performance with the new ART Runtime and Dalvik VM","endTimestamp":"2014-10-31T17:30:00Z","url":"http://uk.droidcon.com/2014/sessions/how-to-improve-android-app-performance-with-the-new-art-runtime-and-dalvik-vm/","startTimestamp":"2014-10-31T16:45:00Z","room":"ROOM61","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed.jpg","color":"#A4C639","speakers":["1085","1086"],"description":"A deep dive into the Material design system for both designers and developers. Covering the design principles, applying them to your app and how to build them using the new Andoid-L APIs.","id":"1096","isLivestream":false,"title":"Papercraft: Material design & implementation","endTimestamp":"2014-10-31T17:30:00Z","url":"http://uk.droidcon.com/2014/sessions/material-design-2/","startTimestamp":"2014-10-31T16:45:00Z","room":"ROOM59","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/10/Abhisek1.jpg","color":"#A4C639","speakers":["1087","1088"],"description":"This talk will explore what developers can get out of using the CyanogenMod platform and why so many users choose to run CyanogenMod over the OS that is shipped on their devices.\r\n\r\nWhether you want to play with private APIs, test against real devices at a fraction of the cost, or make your own developer preview of the latest AOSP code, CyanogenMod provides an open platform for developers to expand and enhance all aspects of their app development workflow on a multitude of devices.","id":"1095","isLivestream":false,"title":"Playing outside the sandbox – Developing on CyanogenMod","endTimestamp":"2014-10-31T17:30:00Z","url":"http://uk.droidcon.com/2014/sessions/playing-outside-the-sandbox-developing-on-cyanogenmod/","startTimestamp":"2014-10-31T16:45:00Z","room":"ROOM60","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/3c447ae.jpg","color":"#A4C639","speakers":["1091"],"description":"How do Facebook engineers ship features to a billion people every two weeks? We will also talk about stress testing and how to continuously measure the impact of code changes on performance. Learn how we test mobile applications at Facebook.","id":"1092","isLivestream":false,"title":"Testing applications at Facebook","endTimestamp":"2014-10-31T17:30:00Z","url":"http://uk.droidcon.com/2014/sessions/testing-applications-at-facebook/","startTimestamp":"2014-10-31T16:45:00Z","room":"ROOM63","tags":["TYPE_SESSION","THEME_1003"]},{"photoUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/photo-1.jpg","color":"#A4C639","speakers":["1090"],"description":"Join Stephan Linzner for an exciting talk – stay tuned for more details!","id":"1093","isLivestream":false,"title":"What’s new in Android Testing","endTimestamp":"2014-10-31T17:30:00Z","url":"http://uk.droidcon.com/2014/sessions/whats-new-in-android-testing/","startTimestamp":"2014-10-31T16:45:00Z","room":"ROOM62","tags":["TYPE_SESSION","THEME_1003"]}],"hashtags":[{"color":"#311b92","name":"#Aandroid","description":"","order":1},{"color":"#01579b","name":"#Aapplication","description":"","order":2},{"color":"#0d5302","name":"#Aapplications","description":"","order":3},{"color":"#e65100","name":"#Bbeyond","description":"","order":4},{"color":"#212121","name":"#Bbuild","description":"","order":5},{"color":"#880e4f","name":"#Ccyanogenmod","description":"","order":6},{"color":"#1a237e","name":"#Ddesign","description":"","order":7},{"color":"#006064","name":"#Ddevelopers","description":"","order":8},{"color":"#33691e","name":"#Ddeveloping","description":"","order":9},{"color":"#bf360c","name":"#Eengineering","description":"","order":10},{"color":"#263238","name":"#Ggradleware","description":"","order":11},{"color":"#4a148c","name":"#Iimplementation","description":"","order":12},{"color":"#2a36b1","name":"#Iimportance","description":"","order":13},{"color":"#004d40","name":"#Iintroduction","description":"","order":14},{"color":"#827717","name":"#Mmatter","description":"","order":15},{"color":"#3e2723","name":"#Pperformance","description":"","order":16},{"color":"#b0120a","name":"#Pprotecting","description":"","order":17},{"color":"#311b92","name":"#Ssmartphones","description":"","order":18},{"color":"#01579b","name":"#Ttesting","description":"","order":19},{"color":"#0d5302","name":"#Uuncoventional","description":"","order":20}],"partners":[],"blocks":[{"start":"2014-10-30T08:30:00.000Z","end":"2014-10-30T09:00:00.000Z","title":"Welcome to Droidcon London 2014","type":"break"},{"start":"2014-10-30T09:00:00.000Z","end":"2014-10-30T10:00:00.000Z","title":"Barcamp Kickoff","type":"break"},{"start":"2014-10-30T16:30:00.000Z","end":"2014-10-30T17:15:00.000Z","title":"Democamp","type":"break"},{"start":"2014-10-31T08:30:00.000Z","end":"2014-10-31T09:00:00.000Z","title":"Registration","type":"break"},{"start":"2014-10-31T09:45:00.000Z","end":"2014-10-31T10:00:00.000Z","title":"Coffee Break","type":"break"},{"start":"2014-10-31T10:00:00.000Z","end":"2014-10-31T10:45:00.000Z","title":"","type":"free"},{"start":"2014-10-31T10:45:00.000Z","end":"2014-10-31T11:00:00.000Z","title":"Coffee Break","type":"break"},{"start":"2014-10-31T11:00:00.000Z","end":"2014-10-31T11:45:00.000Z","title":"","type":"free"},{"start":"2014-10-31T11:45:00.000Z","end":"2014-10-31T12:00:00.000Z","title":"Coffee Break","type":"break"},{"start":"2014-10-31T12:00:00.000Z","end":"2014-10-31T12:45:00.000Z","title":"","type":"free"},{"start":"2014-10-31T12:45:00.000Z","end":"2014-10-31T13:45:00.000Z","title":"Lunch","type":"break"},{"start":"2014-10-31T13:45:00.000Z","end":"2014-10-31T14:30:00.000Z","title":"","type":"free"},{"start":"2014-10-31T14:30:00.000Z","end":"2014-10-31T14:45:00.000Z","title":"Coffee Break","type":"break"},{"start":"2014-10-31T14:45:00.000Z","end":"2014-10-31T15:30:00.000Z","title":"","type":"free"},{"start":"2014-10-31T15:30:00.000Z","end":"2014-10-31T15:45:00.000Z","title":"Coffee Break","type":"break"},{"start":"2014-10-31T15:45:00.000Z","end":"2014-10-31T16:30:00.000Z","title":"","type":"free"},{"start":"2014-10-31T16:30:00.000Z","end":"2014-10-31T16:45:00.000Z","title":"Coffee Break","type":"break"},{"start":"2014-10-31T16:45:00.000Z","end":"2014-10-31T17:30:00.000Z","title":"","type":"free"},{"start":"2014-10-31T17:30:00.000Z","end":"2014-10-31T17:45:00.000Z","title":"Coffee Break","type":"break"},{"start":"2014-10-31T17:45:00.000Z","end":"2014-10-31T18:00:00.000Z","title":"Closing Ceremony","type":"break"}],"speakers":[{"name":"Abhisek Devkota","bio":"Abhisek Devkota is the Community Manager and project manager for Cyanogen Inc., a new company formed by the cofounders of the largest aftermarket Operating System for Android devices CyanogenMod.\r\nThe CyanogenMod Project is an opensource distribution that is community driven and created in collaboration with volunteers around the world, with the goal to allow users to truly own their phone through customization, functionality and enhanced security over their personal data.\r\nAbhisek is a veteran of the consulting industry surrounding Washington, DC. Before joining Cyanogen Inc. he worked on implementation of Software as a Service solutions for various US government agencies and was a volunteer to the CyanogenMod project for 4 years in his spare time. He is an avid fan of technology and opensource communities. He is especially interested in opening the more niche prosumer and enthusiast ideas to the average user, including the benefits of secure services and personal data management.","id":"1087","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/10/Abhisek1.jpg"},{"name":"Alessandro Martellucci","bio":"","id":"1054","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/1f94f9f.jpg"},{"name":"Benjamin Augustin","bio":"Android Software Craftsman at Novoda","id":"1053","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed-1.jpg"},{"name":"Chet Haase","bio":"Chet is the lead of the Android UI Toolkit team. He also writes books, records videos, and presents at developer events. Like this one.","id":"1004","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/chet.jpg"},{"name":"Chiu-Ki Chan","bio":"Chiu-Ki was on the Android server team when the G1 came out. She switched to apps development when she moved to the maps team, building Google Mobile Maps for Android. After a brief stint in Web development at two startups, Chiu-Ki is now back at her Android roots with her own company for mobile development. The first title is “Monkey Write,” an app for learning Chinese writing, which recently won Grand Prize in the Samsung Galaxy Note App Challenge.","id":"1033","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2012/07/chiuki.jpg"},{"name":"Chris Banes","bio":"Chris is an engineer on the Google Developer Relations team, working on the appcompat and Palette libs & his own open source projects","id":"1085","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed.jpg"},{"name":"Chris Hanag","bio":"","id":"1075","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/papayamobile-chris-hanage-r225x.jpg"},{"name":"Cyril Mottier","bio":"Cyril Mottier is a mobile software engineer at Capitaine Train and a Google Developer Expert dedicated to Android. Passionate about technology and design, Cyril is an avid lover of Android and a multi-skilled engineer: he can turn his hand to any problem you might be having! He is actively involved in the Android community and shares his passion writing blog posts, creating open source libraries and giving talks. His motto is “Do less, but do it insanely great” – come and find out how he lives up to it!","id":"1031","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/bp_CyrilMottier.jpg"},{"name":"David Gonzalez","bio":"David is a senior Android Software Craftsman at Novoda.","id":"1024","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/7876966932476ff9bed2e31d12afff6a.jpeg"},{"name":"Enrique López Mañas","bio":"","id":"1041","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/E9xxU-RD_400x400.jpeg"},{"name":" Eric Lafortune","bio":"Eric Lafortune is the creator of ProGuard and DexGuard, two of the most important tools for Android development: ProGuard reduces the size of your app, whilst DexGuard protects it – and your users. With over 15 years of experience, big clients like IBM and Hewlett-Packard, and two technologies that are now industry standard under his belt, Eric is an ideal guide on how to become a success!","id":"1074","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/bp_EricLafortune.jpg"},{"name":"Erik Hellman","bio":"Erik Hellman is currently working as a Senior Android Developer at Spotify. He was previously the lead architect and research engineer at Sony Mobile and has been working with Android since early 2009. Besides his work on the Android platform and various applications, he has also written the book “Android Programming: Pushing the Limits”. Erik is a member of the Google Developer Experts on Android and can often be found speaking at various conferences and events on this topic.","id":"1021","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/02d9a9c.jpg"},{"name":"Etienne Studer","bio":"Etienne has been working as a developer, architect, project manager, and CTO over the past 15 years. He has spent most of his time building software products from the ground up and successfully shipping them to happy customers. He had the privilege to work in different domains like linguistics, banking, insurance, logistics, and process management. Etienne is convinced that key ingredients of delivering software successfully are simplicity, test-driven development, build automation, customer feedback, continuous improvement, and a team of high technical and social skills.\r\nEtienne used to share his passion for high-productivity tools as an evangelist for JetBrains. He was also a founding member of the JetBrains Development Academy and of Hackergarten. Etienne loves to participate in MOOCs to widen his knowledge on different technical topics. When he is not in front of his laptop, Etienne enjoys spending time with his wife, his two sons, and his two dogs.","id":"1102","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/09/Etienne-sw1.jpg"},{"name":"Guillaume Lung","bio":"Guillaume used to work at Michelin as a Mobile Manager and he is now working at SoundCloud as a happy Android Engineer.","id":"1044","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed-11.jpg"},{"name":"Hans Dockter","bio":"Founder of Gradleware and creator of pioneering build system Gradle, Hans Dockter has 13 years of experience Hans in several industry sectors as a software developer, team leader, architect, trainer, and technical mentor. Gradle is the emerging industry standard for Android, as proved by Google recently moving all its developers over to it! The CEO of such a clearly outstanding company is the ideal person to come to if you want to find out how to become successful!","id":"1042","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/Hans-Dockter.png"},{"name":"Jamie McDonald","bio":"Jamie is an Android Engineer and UX enthusiast working on the mobile team at SoundCloud. In the past, he has worked at The Guardian and Novoda, as well as building a successful sudoku game in his spare time.","id":"1043","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed1.jpg"},{"name":"Juhani Lehtimaki","bio":"Author of ‘Smashing Android UI’ and androiduipatterns.com, Juhani Lehtimaki is an Android developer with a real passion for design. Currently working at Snapp TV as the Head of Android Development, building apps for smartphones, tablets, and Google TV, he’s the ideal expert for all your design needs! In his spare time, he’s working on a hybrid Android and table-top game called Lands of Ruin – feel free to ask him about it, and any other issue that comes to mind, at his talk on responsive design!","id":"1016","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/design_JuhaniLehtimaki.jpg"},{"name":"Lisa Neigut","bio":"Android Developer at Etsy. Lisa is an artisanal cereal chef. Her current favorite is coconut orange macadamia granola. She spends most of her working hours playing with Java and Gradle on Android at Etsy.","id":"1073","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/lisa-neigut.png"},{"name":"Lordanis Giannakakis","bio":"Iordanis is a software engineer with 9 years of experience on the full stack. Based in London, he’s currently the Team Lead of the Android team at Shazam, where he’s trying to promote BDD and software craftmanship to developers who share the same passion. Previously, Tech Lead at Yahoo!. Whenever, Iordanis is not building Android apps on weekends, he much prefers visiting random European cities or exploring more about London itself!","id":"1065","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/00cdeb7.jpg"},{"name":"Lucas Rocha","bio":"Currently hacking on Firefox for Android, Lucas Rocha is an experienced UI engineer who has created several successful Android apps and libraries – including Pattrn, Two Way View and Smoothie.  Having worked at Litl and Nokia in the past, he’s going places – you can find out how he got to where he is at his talk!","id":"1039","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/bp_LucasRocha.jpg"},{"name":"Lucio Maciel","bio":"Lucio is a Software Engineer at We Heart It","id":"1062","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/profile.png"},{"name":"Marcin Erdmann","bio":"Marcin loves Open Source Software and has a strong need to give back to the community whenever possible. That’s why he’s proud to be the current project lead of Geb, a Groovy Browser automation library. In the past he contributed to many open source projects in the Groovy ecosystem and he enjoys going to conferences both as an attendee and a speaker. That’s where you will find him with a pint of good beer in hand engaged in lengthy discussions on how to make software development process and quality better. He believes that software should not only work, but it also has to be ‘beautiful under the hood’, maintainable, well-tested and have a clean and consistent codebase. And he can’t imagine coding without doing TDD anymore…","id":"1103","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/09/Marcin-Photo.jpeg"},{"name":"Mark Allison","bio":"Mark Allison is a software engineer with almost 25 years experience. He is passionate about providing the user with the best possible experience. He has developed both server and client side, most commonly Android on the client side, but also for iOS, HTML5, Symbian and J2ME.\r\nMark writes a technical blog which focuses on Android UI/UX topics, but often covers more general Android development techniques. He regularly speaks at Android developer events, most recently at DroidCon London, but previously in such diverse locations as Turkey, Spain, and Brazil.\r\nWhen not being geeky, Mark likes to unwind by hurling abuse at football referees, specifically those who are unkind to his beloved Watford FC with whom he holds a season ticket. He also has a deep love of the chilli pepper and consumes spicy food (his favourite being Indian) at every opportunity!\r\nMark is happily married with a grown up step­daughter, and lives in Hertfordshire, UK.","id":"1020","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2012/09/markallison.jpg"},{"name":"Mark Murphy","bio":"Founder of Commonsware, author of The Busy Coder’s Guide to Android Development, and three-time entrepreneur, Mark Murphy has been developing software for nearly 30 years – his experience ranges from the TRS-80 to the latest mobile devices! He’s answered over 13,000 development questions on Stack Overflow – and he’ll be happy to answer more from you at his talk!","id":"1040","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/bp_MarkMurphy.jpg"},{"name":"Martin Konicek","bio":"","id":"1091","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/3c447ae.jpg"},{"name":"Matteo Bonifazi","bio":"A Mobile Developer at Open Reply greedy for new technologies and software development. Making cutting-edge software and facing new challenges is his goal.","id":"1055","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/Schermata_400x400.png"},{"name":"Nazneen Rupawalla","bio":"","id":"1032","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/2b407d4.jpg"},{"name":"Nick Butcher","bio":"Nick is a developer and designer on the Google Developer Relations team with a passion for building sublime interfaces for mobile devices.","id":"1086","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/photo.jpg"},{"name":"Nicoll Hunt","bio":"Nicoll Hunt has worked on everything from 2 man teams to 250 man teams, from games with zero budget to titles that cost over $110,000,000 (and destroyed a company in the process). A veteran of Codemasters, Visual Science and Realtime Worlds he is now a rising star in the indie scene. Nicoll’s latest game, time-travelling-lumberjack-em-up FIST OF AWESOME, was released last year on mobile and console platforms to widespread critical acclaim and commercial success.","id":"1072","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/games_NicollHunt.jpg"},{"name":"Raimon Rafols","bio":"Mobile Software Engineering Manager at Imagination","id":"1089","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/rnfixa3sva9kvuijox5r.png"},{"name":"Roberto Gassirà","bio":"Senior security analyst and Android mobile developer, Roberto Gassirà specialises in Information Security with an indepth focus on the Mobile World. He is intrigued by embedded systems, the Internet of Things, wearable devices and everything interesting that can be taken apart and explored.\r\nHe has spoken at international security conferences such as Blackhat and DeepSec, and he collaborates with the GDG Rome L-AB, leading several Codelabs on Android Key Management.","id":"1022","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/35aa753.jpg"},{"name":"Roberto Piccirillo","bio":"Roberto Piccirillo is currently working as a Senior Security Researcher for Mobile Security Lab. He graduated in Computer Science and specialises in Information Security. He deals mainly with Mobile Applications, Protocol Security and penetration testing on Web Application but is also interested in binaries reverse engineering and the development of mobile applications. A speaker at BlackHat and DeepSec conferences, he also collaborates with GDG Rome.","id":"1023","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed.png"},{"name":"Savvas Dalkitsis","bio":"Savvas is an Android geek, working as a Senior Software Engineer at Shazam. Loves open source and everything mobile. TDD nut.","id":"1066","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/cc5a02a329fdb4ae61b09d088d1a5be6d537ae18-t640.jpeg"},{"name":"Sebastiano Poggi","bio":"Sebastiano Poggi is an Android Software Craftsman at Novoda in London.\r\nA self-taught and strong OSS believer who loves beautiful and simple UX and UI, where “less is more”, Sebastiano spends a big chunk of his spare time reading and writing about Android development. He also creates and maintains some FOSS apps and libraries, that span from the fun, smaller projects to the more serious (and, perhaps, useful) work.\r\nSebastiano worked for some time in AKQA as a Senior Software Engineer. Before moving to London, he also worked at i’m Spa (an Italian smartwatch startup) for two years, playing with the Android platform and handling their Developer Relations. He’s been toying with the Android SDK since 2010.","id":"1071","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/09/sebastian.jpg"},{"name":"Shane Francis","bio":"","id":"1088","thumbnailUrl":""},{"name":"Sonia Naresh Sharma","bio":"","id":"1034","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed-4.png"},{"name":"Stephan Linzner","bio":"","id":"1090","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/photo-1.jpg"},{"name":"Taylor Ling","bio":"Taylor Ling specialises in User Interface and Interaction Design, and is currently crafting pixels at Snappymob, a passionate mobile app studio in Malaysia.\r\nPreviously he worked on life-changing medical software like SurgiCase Connect with Materialise Malaysia. A Professional Android Designer, his website AndroidUIUX.com regularly publishes tips and tricks, as well as resources for Android designers and developers – and he just recently became one of the Google Developer Experts in UX/Design. If you want to start making waves like Taylor, best make it to his talk!","id":"1052","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/unnamed-1.png"},{"name":"Tim Messerschmidt","bio":"As a long time mobile and web developer, Tim channels his knowledge and experience as PayPal’s Lead Developer Evangelist in EMEA. He is passionate about startups and serves as mentor at multiple incubators and accelerators. Prior joining PayPal Tim used to work with Neofonie Mobile and Samsung focussing on several mobile projects. In his spare time, he leads and creates training classes in all sorts of developer-oriented topics, contributes to Open Source projects and is one of the authors of the Mobile Developer’s Guide to the Galaxy, as well as numerous articles published in print magazines.","id":"1064","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/10/Tim.png"},{"name":"Troed Sångberg","bio":"","id":"1100","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/bio_photo.jpg"},{"name":"Xavier Hallade","bio":"Xavier Hallade is Developer Evangelist in Intel Software and Service Group in Paris, France. He is helping developers to improve their support for new hardware and technologies backed by Intel, with a focus on the Android NDK, 64-bit and dual-displays.","id":"1063","thumbnailUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/Xavier.jpg"}],"videos":[],"experts":[{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/10/Abhisek1.jpg","name":"Abhisek Devkota","bio":"Abhisek Devkota is the Community Manager and project manager for Cyanogen Inc., a new company formed by the cofounders of the largest aftermarket Operating System for Android devices CyanogenMod.\r\nThe CyanogenMod Project is an opensource distribution that is community driven and created in collaboration with volunteers around the world, with the goal to allow users to truly own their phone through customization, functionality and enhanced security over their personal data.\r\nAbhisek is a veteran of the consulting industry surrounding Washington, DC. Before joining Cyanogen Inc. he worked on implementation of Software as a Service solutions for various US government agencies and was a volunteer to the CyanogenMod project for 4 years in his spare time. He is an avid fan of technology and opensource communities. He is especially interested in opening the more niche prosumer and enthusiast ideas to the average user, including the benefits of secure services and personal data management.","id":"1087","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/1f94f9f.jpg","name":"Alessandro Martellucci","bio":"","id":"1054","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed-1.jpg","name":"Benjamin Augustin","bio":"Android Software Craftsman at Novoda","id":"1053","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/chet.jpg","name":"Chet Haase","bio":"Chet is the lead of the Android UI Toolkit team. He also writes books, records videos, and presents at developer events. Like this one.","id":"1004","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2012/07/chiuki.jpg","name":"Chiu-Ki Chan","bio":"Chiu-Ki was on the Android server team when the G1 came out. She switched to apps development when she moved to the maps team, building Google Mobile Maps for Android. After a brief stint in Web development at two startups, Chiu-Ki is now back at her Android roots with her own company for mobile development. The first title is “Monkey Write,” an app for learning Chinese writing, which recently won Grand Prize in the Samsung Galaxy Note App Challenge.","id":"1033","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed.jpg","name":"Chris Banes","bio":"Chris is an engineer on the Google Developer Relations team, working on the appcompat and Palette libs & his own open source projects","id":"1085","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/papayamobile-chris-hanage-r225x.jpg","name":"Chris Hanag","bio":"","id":"1075","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/bp_CyrilMottier.jpg","name":"Cyril Mottier","bio":"Cyril Mottier is a mobile software engineer at Capitaine Train and a Google Developer Expert dedicated to Android. Passionate about technology and design, Cyril is an avid lover of Android and a multi-skilled engineer: he can turn his hand to any problem you might be having! He is actively involved in the Android community and shares his passion writing blog posts, creating open source libraries and giving talks. His motto is “Do less, but do it insanely great” – come and find out how he lives up to it!","id":"1031","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/7876966932476ff9bed2e31d12afff6a.jpeg","name":"David Gonzalez","bio":"David is a senior Android Software Craftsman at Novoda.","id":"1024","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/E9xxU-RD_400x400.jpeg","name":"Enrique López Mañas","bio":"","id":"1041","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/bp_EricLafortune.jpg","name":" Eric Lafortune","bio":"Eric Lafortune is the creator of ProGuard and DexGuard, two of the most important tools for Android development: ProGuard reduces the size of your app, whilst DexGuard protects it – and your users. With over 15 years of experience, big clients like IBM and Hewlett-Packard, and two technologies that are now industry standard under his belt, Eric is an ideal guide on how to become a success!","id":"1074","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/02d9a9c.jpg","name":"Erik Hellman","bio":"Erik Hellman is currently working as a Senior Android Developer at Spotify. He was previously the lead architect and research engineer at Sony Mobile and has been working with Android since early 2009. Besides his work on the Android platform and various applications, he has also written the book “Android Programming: Pushing the Limits”. Erik is a member of the Google Developer Experts on Android and can often be found speaking at various conferences and events on this topic.","id":"1021","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/09/Etienne-sw1.jpg","name":"Etienne Studer","bio":"Etienne has been working as a developer, architect, project manager, and CTO over the past 15 years. He has spent most of his time building software products from the ground up and successfully shipping them to happy customers. He had the privilege to work in different domains like linguistics, banking, insurance, logistics, and process management. Etienne is convinced that key ingredients of delivering software successfully are simplicity, test-driven development, build automation, customer feedback, continuous improvement, and a team of high technical and social skills.\r\nEtienne used to share his passion for high-productivity tools as an evangelist for JetBrains. He was also a founding member of the JetBrains Development Academy and of Hackergarten. Etienne loves to participate in MOOCs to widen his knowledge on different technical topics. When he is not in front of his laptop, Etienne enjoys spending time with his wife, his two sons, and his two dogs.","id":"1102","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed-11.jpg","name":"Guillaume Lung","bio":"Guillaume used to work at Michelin as a Mobile Manager and he is now working at SoundCloud as a happy Android Engineer.","id":"1044","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/Hans-Dockter.png","name":"Hans Dockter","bio":"Founder of Gradleware and creator of pioneering build system Gradle, Hans Dockter has 13 years of experience Hans in several industry sectors as a software developer, team leader, architect, trainer, and technical mentor. Gradle is the emerging industry standard for Android, as proved by Google recently moving all its developers over to it! The CEO of such a clearly outstanding company is the ideal person to come to if you want to find out how to become successful!","id":"1042","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed1.jpg","name":"Jamie McDonald","bio":"Jamie is an Android Engineer and UX enthusiast working on the mobile team at SoundCloud. In the past, he has worked at The Guardian and Novoda, as well as building a successful sudoku game in his spare time.","id":"1043","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/design_JuhaniLehtimaki.jpg","name":"Juhani Lehtimaki","bio":"Author of ‘Smashing Android UI’ and androiduipatterns.com, Juhani Lehtimaki is an Android developer with a real passion for design. Currently working at Snapp TV as the Head of Android Development, building apps for smartphones, tablets, and Google TV, he’s the ideal expert for all your design needs! In his spare time, he’s working on a hybrid Android and table-top game called Lands of Ruin – feel free to ask him about it, and any other issue that comes to mind, at his talk on responsive design!","id":"1016","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/lisa-neigut.png","name":"Lisa Neigut","bio":"Android Developer at Etsy. Lisa is an artisanal cereal chef. Her current favorite is coconut orange macadamia granola. She spends most of her working hours playing with Java and Gradle on Android at Etsy.","id":"1073","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/00cdeb7.jpg","name":"Lordanis Giannakakis","bio":"Iordanis is a software engineer with 9 years of experience on the full stack. Based in London, he’s currently the Team Lead of the Android team at Shazam, where he’s trying to promote BDD and software craftmanship to developers who share the same passion. Previously, Tech Lead at Yahoo!. Whenever, Iordanis is not building Android apps on weekends, he much prefers visiting random European cities or exploring more about London itself!","id":"1065","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/bp_LucasRocha.jpg","name":"Lucas Rocha","bio":"Currently hacking on Firefox for Android, Lucas Rocha is an experienced UI engineer who has created several successful Android apps and libraries – including Pattrn, Two Way View and Smoothie.  Having worked at Litl and Nokia in the past, he’s going places – you can find out how he got to where he is at his talk!","id":"1039","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/profile.png","name":"Lucio Maciel","bio":"Lucio is a Software Engineer at We Heart It","id":"1062","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/09/Marcin-Photo.jpeg","name":"Marcin Erdmann","bio":"Marcin loves Open Source Software and has a strong need to give back to the community whenever possible. That’s why he’s proud to be the current project lead of Geb, a Groovy Browser automation library. In the past he contributed to many open source projects in the Groovy ecosystem and he enjoys going to conferences both as an attendee and a speaker. That’s where you will find him with a pint of good beer in hand engaged in lengthy discussions on how to make software development process and quality better. He believes that software should not only work, but it also has to be ‘beautiful under the hood’, maintainable, well-tested and have a clean and consistent codebase. And he can’t imagine coding without doing TDD anymore…","id":"1103","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2012/09/markallison.jpg","name":"Mark Allison","bio":"Mark Allison is a software engineer with almost 25 years experience. He is passionate about providing the user with the best possible experience. He has developed both server and client side, most commonly Android on the client side, but also for iOS, HTML5, Symbian and J2ME.\r\nMark writes a technical blog which focuses on Android UI/UX topics, but often covers more general Android development techniques. He regularly speaks at Android developer events, most recently at DroidCon London, but previously in such diverse locations as Turkey, Spain, and Brazil.\r\nWhen not being geeky, Mark likes to unwind by hurling abuse at football referees, specifically those who are unkind to his beloved Watford FC with whom he holds a season ticket. He also has a deep love of the chilli pepper and consumes spicy food (his favourite being Indian) at every opportunity!\r\nMark is happily married with a grown up step­daughter, and lives in Hertfordshire, UK.","id":"1020","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/bp_MarkMurphy.jpg","name":"Mark Murphy","bio":"Founder of Commonsware, author of The Busy Coder’s Guide to Android Development, and three-time entrepreneur, Mark Murphy has been developing software for nearly 30 years – his experience ranges from the TRS-80 to the latest mobile devices! He’s answered over 13,000 development questions on Stack Overflow – and he’ll be happy to answer more from you at his talk!","id":"1040","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/3c447ae.jpg","name":"Martin Konicek","bio":"","id":"1091","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/Schermata_400x400.png","name":"Matteo Bonifazi","bio":"A Mobile Developer at Open Reply greedy for new technologies and software development. Making cutting-edge software and facing new challenges is his goal.","id":"1055","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/2b407d4.jpg","name":"Nazneen Rupawalla","bio":"","id":"1032","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/photo.jpg","name":"Nick Butcher","bio":"Nick is a developer and designer on the Google Developer Relations team with a passion for building sublime interfaces for mobile devices.","id":"1086","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/games_NicollHunt.jpg","name":"Nicoll Hunt","bio":"Nicoll Hunt has worked on everything from 2 man teams to 250 man teams, from games with zero budget to titles that cost over $110,000,000 (and destroyed a company in the process). A veteran of Codemasters, Visual Science and Realtime Worlds he is now a rising star in the indie scene. Nicoll’s latest game, time-travelling-lumberjack-em-up FIST OF AWESOME, was released last year on mobile and console platforms to widespread critical acclaim and commercial success.","id":"1072","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/rnfixa3sva9kvuijox5r.png","name":"Raimon Rafols","bio":"Mobile Software Engineering Manager at Imagination","id":"1089","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/35aa753.jpg","name":"Roberto Gassirà","bio":"Senior security analyst and Android mobile developer, Roberto Gassirà specialises in Information Security with an indepth focus on the Mobile World. He is intrigued by embedded systems, the Internet of Things, wearable devices and everything interesting that can be taken apart and explored.\r\nHe has spoken at international security conferences such as Blackhat and DeepSec, and he collaborates with the GDG Rome L-AB, leading several Codelabs on Android Key Management.","id":"1022","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed.png","name":"Roberto Piccirillo","bio":"Roberto Piccirillo is currently working as a Senior Security Researcher for Mobile Security Lab. He graduated in Computer Science and specialises in Information Security. He deals mainly with Mobile Applications, Protocol Security and penetration testing on Web Application but is also interested in binaries reverse engineering and the development of mobile applications. A speaker at BlackHat and DeepSec conferences, he also collaborates with GDG Rome.","id":"1023","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/cc5a02a329fdb4ae61b09d088d1a5be6d537ae18-t640.jpeg","name":"Savvas Dalkitsis","bio":"Savvas is an Android geek, working as a Senior Software Engineer at Shazam. Loves open source and everything mobile. TDD nut.","id":"1066","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/09/sebastian.jpg","name":"Sebastiano Poggi","bio":"Sebastiano Poggi is an Android Software Craftsman at Novoda in London.\r\nA self-taught and strong OSS believer who loves beautiful and simple UX and UI, where “less is more”, Sebastiano spends a big chunk of his spare time reading and writing about Android development. He also creates and maintains some FOSS apps and libraries, that span from the fun, smaller projects to the more serious (and, perhaps, useful) work.\r\nSebastiano worked for some time in AKQA as a Senior Software Engineer. Before moving to London, he also worked at i’m Spa (an Italian smartwatch startup) for two years, playing with the Android platform and handling their Developer Relations. He’s been toying with the Android SDK since 2010.","id":"1071","url":""},{"attending":true,"imageUrl":"","name":"Shane Francis","bio":"","id":"1088","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/unnamed-4.png","name":"Sonia Naresh Sharma","bio":"","id":"1034","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/photo-1.jpg","name":"Stephan Linzner","bio":"","id":"1090","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/08/unnamed-1.png","name":"Taylor Ling","bio":"Taylor Ling specialises in User Interface and Interaction Design, and is currently crafting pixels at Snappymob, a passionate mobile app studio in Malaysia.\r\nPreviously he worked on life-changing medical software like SurgiCase Connect with Materialise Malaysia. A Professional Android Designer, his website AndroidUIUX.com regularly publishes tips and tricks, as well as resources for Android designers and developers – and he just recently became one of the Google Developer Experts in UX/Design. If you want to start making waves like Taylor, best make it to his talk!","id":"1052","url":"https://plus.google.com/+TaylorLing"},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2013/10/Tim.png","name":"Tim Messerschmidt","bio":"As a long time mobile and web developer, Tim channels his knowledge and experience as PayPal’s Lead Developer Evangelist in EMEA. He is passionate about startups and serves as mentor at multiple incubators and accelerators. Prior joining PayPal Tim used to work with Neofonie Mobile and Samsung focussing on several mobile projects. In his spare time, he leads and creates training classes in all sorts of developer-oriented topics, contributes to Open Source projects and is one of the authors of the Mobile Developer’s Guide to the Galaxy, as well as numerous articles published in print magazines.","id":"1064","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/bio_photo.jpg","name":"Troed Sångberg","bio":"","id":"1100","url":""},{"attending":true,"imageUrl":"http://uk.droidcon.com/2014/wp-content/uploads/2014/08/Xavier.jpg","name":"Xavier Hallade","bio":"Xavier Hallade is Developer Evangelist in Intel Software and Service Group in Paris, France. He is helping developers to improve their support for new hardware and technologies backed by Intel, with a focus on the Android NDK, 64-bit and dual-displays.","id":"1063","url":""}],"tags":[{"name":"Android","tag":"THEME_1003","abstract":"All About Android","category":"THEME","order_in_category":1}]}