{"sessions":[{"post_title":"Welcome","url":"http:\/\/it.droidcon.com\/2015\/sessions\/welcome-2\/","time":"09:15","end_time":"09:50","date":"9 April 2015","location":"Sala 500","color":"","track":[],"speakers":[],"content":""},{"post_title":"Keynote","url":"http:\/\/it.droidcon.com\/2015\/sessions\/keynote-2\/","time":"09:50","end_time":"10:30","date":"9 April 2015","location":"Sala 500","color":"","track":[],"speakers":[{"post_title":"Mario Viviani","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/mario-viviani\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/mario-viviani-150x150.jpeg","header":"CEO at Mariux Apps, Google Developer Expert","speaker_id":"791","bio":"<p>Mario Viviani, Android Developer since 2010, has been nominated Google Developer Expert (GDE) for Android by Google in 2013. Mario has published more than 90 apps on Google Play. In 2011 Mario decided to create the startup Mariux Apps, based in Milan, Italy, focused on Mobile Applications Development. He’s member of Talent Garden, a network of co-working spaces focused on digital and innovation. As Mariux Apps his products received 12.000.000+ total downloads and are currently ranked in the Top 100 apps in a lot of Categories in Google Play. At Mariux Apps he’s also working with cutting edge technologies like Google Glass and Leap Motion. Mario is really active in the Android community, attending a lot of events worldwide, helping Android developers build new, compelling and well-received apps.<\/p>"},{"post_title":"Sebastiano Poggi","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/sebastiano-poggi\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Sebastiano-Poggi-150x150.jpeg","header":"Android Software Craftsman at Novoda &#038; GDE ","speaker_id":"797","bio":"<p>A self-taught and strong OSS believer who loves beautiful and simple UX and UI, where “less is more”, Sebastiano spends a big chunk of his spare time reading and writing about Android development. He also creates and maintains some FOSS apps and libraries, that span from the fun, smaller projects to the more serious (and, perhaps, useful) work.<\/p>\n<p>Sebastiano worked some time in AKQA as a Senior Software Engineer. Before moving to London, he also worked at i’m Spa (an Italian smartwatch startup) for two years, playing with the Android platform and handling their Developer Relations. He’s been toying with the Android SDK since 2010.<\/p>"}],"content":""},{"post_title":"Barcamp organization","url":"http:\/\/it.droidcon.com\/2015\/sessions\/barcamp-organization-2\/","time":"10:30","end_time":"10:50","date":"9 April 2015","location":"Sala 500","color":"","track":[],"speakers":[],"content":""},{"post_title":"The user experience of branding","url":"http:\/\/it.droidcon.com\/2015\/sessions\/the-user-experience-of-branding\/","time":"11:00","end_time":"11:40","date":"9 April 2015","location":"Sala Londra","color":"","track":["branding","mobile design","UI","UX"],"speakers":[{"post_title":"Marie Schweiz","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/marie-schweiz\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Marie-Schweiz-150x150.jpeg","header":"Freelance UI and UX for Mobile","speaker_id":"876","bio":"<p>Schweiz is a designer and passionate about user experience. She lives and works in Berlin and Munich, Germany. Before becoming a Freelancer, she was already specialized in user experience, visual design for mobile. As a founder of #drawtogether and Adobe community professional her passion is to develop the local art and design community in Berlin.<\/p>"}],"content":"<p>Brands like to be available on mobile platforms. They try to brand anything, especially on android. So we get very complex ideas, which are sometimes ending up in a mess. We have to deal with this problem. I will ask and answer the question why we brand. I share a better insight and talk about solutions how we can integrate branding into our concept instead of having logo’s and wrong buttons everywhere.<\/p>\n"},{"post_title":"Efficient sync on Android","url":"http:\/\/it.droidcon.com\/2015\/sessions\/efficient-sync-on-android\/","time":"11:00","end_time":"11:40","date":"9 April 2015","location":"Sala Madrid","color":"","track":["Development","Networking","Optimization"],"speakers":[{"post_title":"Mateusz Herych","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/mateusz-herych\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/mateusz-herych-150x150.jpeg","header":"GDE &#038; Android Engineer at Base","speaker_id":"826","bio":"<p>Mateusz is a GDG Kraków organizer and a Google Developer Expert for Android. Works as an Android developer at Base CRM when he uses his Android-abracadabras to make enterprise software users more productive and happy. Mateusz tries his best to travel and speak at as many conferences as he can, which led him to speak at several Droidcons in 2014, including the one in Turin.<\/p>"}],"content":"<p>Your users want their emails, contacts and notes being available all the time, even if they are offline. On the other hand, they want all their data synced across all their devices. Instantly. Obviously &#8211; all of this needs to be battery and network efficient.<br \/>\nWhile developing the Base app, Mateusz and his teammates had to face those problems. During this session he&#8217;ll give you some advices directly from the battlefield.<\/p>\n"},{"post_title":"Boiling out Boilerplate","url":"http:\/\/it.droidcon.com\/2015\/sessions\/boiling-out-boilerplate\/","time":"11:00","end_time":"11:40","date":"9 April 2015","location":"Sala Lisbona","color":"","track":["Best practice","Development"],"speakers":[{"post_title":"Maciej Górski","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/maciej-gorski\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/maciej-gorski-150x150.jpeg","header":"Clean Code Evangelist &#038; Android Developer at EL Passion","speaker_id":"856","bio":"<p>Maciej is a passionate Android developer. He cares about writing cleaner code and less amount of it. He is spending time to automate things to save even more time. He also bikes a lot and would love to be able to code while doing it… using only mind controlled wearables or bikeables.<\/p>"}],"content":"<p>Ever since we started developing for Android platform, we noticed that some tasks are repetitive: from simple things like finding views in our activities, to sending extras or creating fragments with arguments, to creating parcelable classes, to persisting data, to creating web service clients. This not only slows down initial development, but is mostly a problem when reviewing the code and later continuing to develop new features. During the talk I will show you many tools and libraries that are available to make your code base smaller, simpler and easier to maintain. Tell which are still sexy and which you should stop using and why.<\/p>\n"},{"post_title":"Effective Android Testing","url":"http:\/\/it.droidcon.com\/2015\/sessions\/effective-android-testing\/","time":"11:00","end_time":"11:40","date":"9 April 2015","location":"Sala 500","color":"","track":["Development","Testing"],"speakers":[{"post_title":"Stephan Linzner","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/stephan-linzner-2\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/slinzner3-150x150.png","header":"Android Developer Advocate at Google","speaker_id":"799","bio":"<p>Stephan Linzner is Senior Developer Platform Engineer Android at Google. He is an experienced Software Engineer, which has been working on the Android platform for more than 6 years. He is mainly working on the Android Support Test library and his mission is to help Android developers to build better quality apps by driven by tests.<\/p>"}],"content":""},{"post_title":"Diversity Program Press Conference-Intel","url":"http:\/\/it.droidcon.com\/2015\/sessions\/diversity-program-press-conference-intel\/","time":"11:00","end_time":"13:30","date":"9 April 2015","location":"Sala Parigi","color":"","track":[],"speakers":[],"content":""},{"post_title":"Mind the gap!","url":"http:\/\/it.droidcon.com\/2015\/sessions\/mind-the-gap\/","time":"12:00","end_time":"12:40","date":"9 April 2015","location":"Sala Londra","color":"","track":["Crossplatform","Development"],"speakers":[{"post_title":"Alberto López","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/alberto-lopez\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Paypalglobalteam-headshots-IMG_2010-150x150.jpg","header":"EMEA Developer Advocate at Braintree_Dev.","speaker_id":"776","bio":"<p>I am passionate about innovation, mobility and Internet and commerce technologies. As an EMEA Developer Advocate at Braintree Dev, I look forward to opportunities to demonstrate how those crazy ideas we all have in mind can be turned into pragmatic solutions. Always learning new things, sharing experiences and knowledge with others, and everyday hungry for new challenges in the tech world; testing products, languages and in general, playing with tech and pushing what can be hacked to the limit.<\/p>"}],"content":"<p>&#8220;An unknown Mobile “country&#8221;&#8221;. A wandering developer from Web “city&#8221;&#8221;. No idea about how to deal with the “droids”. The only available means of transport: the express &#8220;&#8221;JavaScript&#8221;&#8221; train, the most up-to-date Html Underground and the confortable and safe CSS Tram. Tension, drama, action and finally, love. This is my story getting started with Android OS.<\/p>\n<p>In this talk we&#8217;ll speak about the existent cross platforms for mobile development, talking openly about weaknesses, strengths and myths present in cross platforms, from the point of view of a newbie mobile developer. We’ll see tons of sample code and a live demo. Do you want to join me on this trip? This is your talk!&#8221;<\/p>\n"},{"post_title":"The love child of Android and .NET: using Xamarin for app development","url":"http:\/\/it.droidcon.com\/2015\/sessions\/the-love-child-of-android-and-net-using-xamarin-for-app-development\/","time":"12:00","end_time":"12:40","date":"9 April 2015","location":"Sala Lisbona","color":"","track":["Crossplatform","Development","Xamarin"],"speakers":[{"post_title":"Lorenz Cuno Klopfenstein","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/lorenz-cuno-klopfenstein\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/lorenz-cuno-klopfenstein-150x150.jpeg","header":"Software architect at University of Urbino","speaker_id":"853","bio":"<p>Born in Switzerland in 1984, moved to Italy and then graduated in Computer Science, first at the University of Urbino, then at the University of Venezia. Now works mostly with web stuff and mobile applications, both on Android and Windows Phone, while also trying to get his Ph.D. in Urbino.<\/p>"}],"content":"<p>Xamarin is a technology that allows you to write .NET code, run it on Android, and share said code with different other platforms, among which iOS and Windows. Mono on Linux was met with polarizing opinions when it was launched, and Xamarin faces a similar scenario: is it a fiendish trick to trap you in Microsoft-land or is it a good opportunity to get more done, and more quickly?<br \/>\nThis presentation will give you an overview about how Xamarin for Android works in practice. Does .NET on Android live up to its promise? Does C# on Android look better or worse than Java? Do you want to wait until Java 8 for lambda expressions and type inference? Should you really learn a ton of new Microsoft acronyms, like PCL, CLR, AOT and BCL? How much code reuse do you get and what can you actually reuse? Money doesn&#8217;t give you happiness, but does it get you more productivity?<br \/>\nWe have been using Xamarin for a couple of months to write Android and iOS apps for “The TripMill”, a traveling social network, and will try to share our answers to those questions with you.<\/p>\n"},{"post_title":"Creating the Internet of My Things with Bluetooth Smart – Android Edition","url":"http:\/\/it.droidcon.com\/2015\/sessions\/creating-the-internet-of-my-things-with-bluetooth-smart-android-edition\/","time":"12:00","end_time":"12:40","date":"9 April 2015","location":"Sala Madrid","color":"","track":["Bluetooth","Development","Hardware","Iot"],"speakers":[{"post_title":"Martin Woolley","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/martin-woolley\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Martin-Woolley-150x150.jpeg","header":"Technical Program Manager at Bluetooth SIG","speaker_id":"793","bio":"<p>Martin Woolley is an industry veteran with over 30 years’ experience working with computers large, small and getting smaller. He still has a Sinclair ZX81 somewhere. Bluetooth Smart and IoT grabbed his attention a few years ago when working for BlackBerry on accessory to smartphone integration. Bluetooth Smart struck him as a phenomenally exciting, useful and developer-friendly technology and it&#8217;s no surprise it&#8217;s helping fuel the realisation of some remarkable technological visions and is key to some of the most fascinating industry trends of the moment, including IoT, wearables, the smart home and beacons.<\/p>"}],"content":"<p>Over 10 billion devices which use Bluetooth were shipped in the technology&#8217;s first 10 years. But last year alone, a further 2.5 billion new Bluetooth devices materialised. Bluetooth is going through what has been described as &#8220;quiet revolution&#8221;, with massive and increasing levels of adoption driven by the release of the latest version of Bluetooth called &#8220;Bluetooth Smart&#8221;. Bluetooth Smart enables some exciting and very current technology trends such as IoT (Internet of Things), Wearable Technology, the Smart Home and Beacons.<\/p>\n<p>Android developers have excellent Bluetooth Smart APIs at their disposal and Android “L” just added even greater power and flexibility, with some great new features.<\/p>\n<p>In this session attendees will learn about the fundamental concepts and architecture of Bluetooth Smart and how to create Android apps which exploit it. There will be a thorough review of the Android Bluetooth Smart APIs and code fragments illustrating their use. We’ll consider the case of a smart lighting product and how we can write Android code that controls it. There may even be a demo or two!<\/p>\n"},{"post_title":"Bugdroid Style","url":"http:\/\/it.droidcon.com\/2015\/sessions\/bugdroid-style\/","time":"12:00","end_time":"12:40","date":"9 April 2015","location":"Sala 500","color":"","track":["UI","UX","UX\/UI Design"],"speakers":[{"post_title":"Mike Wolfson","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/mike-wolfson\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/wolf--150x150.jpg","header":"Google Developer Expert Android @ Able Android","speaker_id":"795","bio":"<p>Mike is a passionate mobile designer\/developer working out of Phoenix. He has been working in the software field for more than 20 years, and with Android since its introduction. Currently, he develops Android applications for the health care field, and is a Lead Mobile Developer at athenahealth\\Epocrates. He is a Google Developer Expert in Android, and the author of the book &#8220;Android Developer Tools Essentials&#8221; published by O&#8217;Reilly.<\/p>\n<p>Mike has spoken about Android and mobile development at a variety of conferences and user groups (including Oscon, AnDevCon, GDGSv, and others). When he is not geeking out about phones, he enjoys the outdoors (snowboarding, hiking, scuba diving), collecting PEZ dispensers, and chasing his young (but quick) daughter.<\/p>"}],"content":"<p>It has always been challenging to chase Android fashion. For many years, the &#8220;style-makers&#8221; were pushing designs that would look more appropriate on an iPhone, or that were beautiful and unique masterpieces, yet impossible to actually implement. This was compounded by the fact that the formal guidelines were unclear, and incomplete. This made the role of an Android Interface developer very challenging.<\/p>\n<p>In recent years, I have participated in many high-profile &#8220;UI refresh&#8221; projects. I have learned a lot from these projects, and will share a few key lessons I have learned from this practical experience.<\/p>\n<p>I will discuss:<br \/>\n&#8211; how to build beautiful interfaces that are universally styled, responsive and beautiful<br \/>\n&#8211; strategies to work with designers and stake-holders to enhance workflow<br \/>\n&#8211; which key Android framework components that should be used to build flexible UI code<br \/>\n&#8211; the important concepts of the new &#8216;Material Design Guidelines<\/p>\n<p>Come to this presentation to learn the techniques you will need to be ready for the next Android fashion fad.<br \/>\n&#8220;Fashions fade, style is eternal.&#8221; — Yves Saint-Laurent<\/p>\n"},{"post_title":"Build Fast Multi Device Apps Fast-Workshop","url":"http:\/\/it.droidcon.com\/2015\/sessions\/build-multi-device-fast\/","time":"12:00","end_time":"13:30","date":"9 April 2015","location":"Sala Copenaghen","color":"","track":["Crossplatform","Development","ibeacon","Internet of things"],"speakers":[{"post_title":"Paweł Głowacki","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/pawel-glowacki\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/03\/PawelGlowacki_photo_2014-150x150.jpg","header":"Senior Software Consultant and EMEA Technical Lead @ Embarcadero","speaker_id":"1492","bio":"<p>Paweł Głowacki works for Embarcadero Technologies as European Technical Lead for Developer Tools. Previously, Paweł spent over 7 years working as a senior consultant and trainer for Delphi within Borland Education Services and CodeGear. As well as working with Embarcadero customers across the region, he also represents Embarcadero internationally as a conference and seminar speaker. For more information check out Paweł&#8217;s technical blog at http:\/\/blogs.embarcadero.com\/pawelglowacki<\/p>"}],"content":"<p>In this demo-oriented session Paweł is going to show how you can quickly build natively compiled, multi-device apps from the same codebase for iOS, Android, Windows and Mac.<br \/>\nCome and see live coding of 2D and 3D mobile user interfaces, using graphics effects and animations for stunning visual user experience, easy integration with REST APIs, cloud services, databases and more.<br \/>\nIn the second part of the workshop we are going to focus on building Internet of Things (IoT) solutions with Bluetooth LE and ibeacons for mobile, proximity aware apps<\/p>\n"},{"post_title":"Custom Java compilation tools for Android apps","url":"http:\/\/it.droidcon.com\/2015\/sessions\/custom-java-compilation-tools-for-android-apps\/","time":"12:50","end_time":"13:50","date":"9 April 2015","location":"Sala 500","color":"","track":["Continuous integration","Development"],"speakers":[{"post_title":"Boris Farber","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/boris-farber\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Photo-150x150.jpg","header":"Developer Advocate @ Google","speaker_id":"1093","bio":"<p>As a Developer Advocate I help promote the Android APIs to 3rd party developers. I advise to developers and partners, speak at conferences and write sample code on top of Google APIs.<\/p>\n<p>My background is in Android development with a focus on User Interface and Java run-time. I am author of a Map Reduce library for Android and a Code Search shell in Go language. My blog can be found at www.api-solutions.com<\/p>"}],"content":"<p>Code maintenance is one the biggest cost is developing software. Usually code around business logic tends to be messy boilerplate and error prone to maintain.<\/p>\n<p>Java and Android provide powerful API to treat code as data<\/p>\n<p>1. Reflection<br \/>\n2. Dynamic Proxy<br \/>\n3. ASM &#8211; byte code manipulation<br \/>\n4. JavaPoet<br \/>\n5. Annotations<\/p>\n<p>I want to do a taxonomy of this APIs and when use what with short samples. Using this APIs allows me to do tedious to impossible tasks while keeping the code short and clean.<\/p>\n"},{"post_title":"Secure VoIP","url":"http:\/\/it.droidcon.com\/2015\/sessions\/secure-voip\/","time":"12:50","end_time":"13:30","date":"9 April 2015","location":"Sala Lisbona","color":"","track":["Best practice","Development","Security"],"speakers":[{"post_title":"Marco Pozzato","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/marco-pozzato\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/02a19db-150x150.jpg","header":"CTO @ PrivateWave Italia S.p.A.","speaker_id":"858","bio":"<p>CTO in PrivateWave 2008-present<br \/>\nSW development Manager in Zucchetti Axess 2002-2008<br \/>\nSW developer in Honeywell Italia 2000-2002<br \/>\nFounding Member of Hermes Center for Trasparency and Digital Human Rights<br \/>\nFounding Member of Milan LUG OpenLabs<\/p>"},{"post_title":"Emanuele Gambaro","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/emanuele-gambaro\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/3698940-150x150.jpg","header":"Software Engineer at PrivateWave Italia S.p.A.","speaker_id":"1107","bio":"<p>Always interested in mobile development and open source philosophy and systems.<\/p>\n<p>Specialties:<br \/>\n&#8211; Server solution with JavaMail, BouncyCastle and Cryptography Java Architecture<br \/>\n&#8211; Database development with Postgres and Mysql<br \/>\n&#8211; Web application with Google Web Toolkit &amp; Tomcat<br \/>\n&#8211; CSS customization and design<br \/>\n&#8211; Web application with GRAILS framework and Groovy &#8211; Tomcat<br \/>\n&#8211; Mobile development with BlackBerry OS (version 5.0 and above)<br \/>\n&#8211; Mobile development with Android OS (version 2.2 and above)<br \/>\n&#8211; Simple Linux administration<br \/>\n&#8211; Eclipse, ANT, automatic build system<br \/>\n&#8211; SVN &amp; GIT versioning control<br \/>\n&#8211; Advanced Android development and AOSP &#8211; custom ROM development<\/p>"}],"content":"<p>Privacy and security became very relevant to everyday life and citizen. Scandals and leaks (eg: Snowden) demonstrated the importance to protect our own communications. PrivateWave was born in 2006 to secure communications, targeting large enterprise and government agencies.<\/p>\n<p>We developed a multi-platform secure VoIP solution, available on Android, Blackberry 7 and 10 and iOS, to protect phone calls and messages.<\/p>\n<p>As time goes by, SW development seems more and more simple and easy, but professional development in enterprise contexts is another matter. Production quality code, Q&amp;A, product management are difficult. Shaping everything under “secure” hat makes all of them even more complex and expensive. We would like to present some important lessons and experience that we learnt, during these years, in the following areas of secure software development:<br \/>\n* VoIP<br \/>\n* TLS, ciphers and certificate pinning<br \/>\n* SQLCipher<br \/>\n* Zorg<br \/>\n* Secure logging<br \/>\n* Randomness and entropy<br \/>\n* Mobile networks<br \/>\n* App designed and developed on BB5, then ported to android<br \/>\n* Cross-platform development<br \/>\n* Rebranding<br \/>\n* localization<br \/>\n* Vulnerability Assessment<br \/>\n* Static Analysis<br \/>\n* 3rd parties libraries, frameworks?<br \/>\n* mobile platforms in enterprise<br \/>\n* secure storage and keystore<\/p>\n"},{"post_title":"Building Top-Notch Android SDKs","url":"http:\/\/it.droidcon.com\/2015\/sessions\/building-top-notch-android-sdks\/","time":"12:50","end_time":"13:30","date":"9 April 2015","location":"Sala Londra","color":"","track":["Best practice","Development","Sdk"],"speakers":[{"post_title":"Hugo Domenech Juarez","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/hugo-domenech-juarez\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/hugo-150x150.jpg","header":"Lead Android Developer @ Relayr","speaker_id":"850","bio":"<p>Hugo is the Android lead at Relayr in Berlin. Responsible for delivering a smooth Android experience. Spends his time building the Relayr SDK and the Manager App.<\/p>"}],"content":"<p>The Android app ecosystem is growing and it&#8217;s time to make it easier for developers to build better apps. There is a need for better tools and libraries to make everyday&#8217;s work more efficient. This talk aims to create a minimum viable SDK. A set of best practices, tips and tricks in a step-by-step approach to show you how it should look like and let you focus on the functionality you want to provide.<\/p>\n"},{"post_title":"Android Auto : Rolling Droid gather no moss","url":"http:\/\/it.droidcon.com\/2015\/sessions\/android-auto-rolling-droid-gather-no-moss\/","time":"12:50","end_time":"13:30","date":"9 April 2015","location":"Sala Madrid","color":"","track":["AndroidAuto","Development"],"speakers":[{"post_title":"Damien Cavaillès","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/damien-cavailles\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Damien-Cavailles-150x150.jpeg","header":"Developer @ Tripndrive","speaker_id":"807","bio":"<p>Passionated by the changes that brought mobility and connected to our living style. Also Organizer of a Startup Weekend &#8220;Maker Edition&#8221; in Lille and Startup Weekend Global Facilitator.<\/p>"}],"content":"<p>Android Auto is coming to your car, and this, pretty much quickly and easily. This is a new extension of the Android platform. As well as Android Wear, this is meant to propose notification, and quick or low interaction to the user. The main difference is that where you use to find flexible guidelines, there is now totally definitive requirements. We are going to oversee what Android Auto is about, as a product and a user experience.<\/p>\n"},{"post_title":"Android Wear SDK","url":"http:\/\/it.droidcon.com\/2015\/sessions\/android-wear-sdk\/","time":"14:30","end_time":"15:10","date":"9 April 2015","location":"Sala Londra","color":"","track":["androidwear"],"speakers":[{"post_title":"Tiziano Basile","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/tiziano-basile\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/tiziano-basile-150x150.jpeg","header":"Developer @ GDG Bari","speaker_id":"869","bio":"<p>In love with Android since I&#8217;ve been switched from an iPhone 3GS to a Samsung Galaxy Next in late 2012, now a proud owner of a Nexus 5; I begun programming plugins for WordPress platform (and trivial projects for the web), now completely switched in Java and Android development.<\/p>"},{"post_title":"Michelantonio Trizio","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/michelantonio-trizio\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/michelantonio-150x150.jpg","header":"Chief Technology Officer @ Qiris","speaker_id":"1108","bio":"<p>I&#8217;m an engineer, I&#8217;m a hacker, I&#8217;m an enterpreneur.<br \/>\nI strongly believe that the driver of innovation must be the improvement of people life.<br \/>\nI love internet and new technologies, I believe that, with them, we can unleash the human potential and live together in a better world.<br \/>\nWe are at the beginning of the third industrial revolution.<br \/>\nA revolution made by the democratization of the tools needed to create new things.<br \/>\nA revolution made by the great availability of Data.<br \/>\n3d printers, Arduino, Android, Big (Open) Data and Cloud Computing are the ingredients of this revolution, I&#8217;m cooking my recipes.<\/p>"}],"content":"<p>Launched in june 2014, android wear is getting more present in people&#8217;s life.<br \/>\nStarting from an overview of the whole system, we&#8217;ll cover how to write wearable applications both on phone and smartwatches, desribing in depth the available API.<\/p>\n"},{"post_title":"The Augmented Reality Experience On Smart Glasses-Workshop","url":"http:\/\/it.droidcon.com\/2015\/sessions\/augmented-reality-smart-glasses\/","time":"14:30","end_time":"18:30","date":"9 April 2015","location":"Sala Copenaghen","color":"","track":["Augmented reality","smart glasses","UX\/UI Design","Wearable"],"speakers":[{"post_title":"Agnese Ragucci","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/agnese-ragucci\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/03\/agnese_droid-150x150.jpg","header":"Interaction Designer @ Joinpad","speaker_id":"1486","bio":"<p>Since 2006, I’ve been working as a graphic designer in collaboration with various agencies in Genoa. In 2011 I moved to Milan in order to attend the Master in Communication Design at Politecnico di Milano, with a focus on Interaction Design and Game Studies. In the last two years, I worked as a Interaction Designer at JoinPad, designing and developing Augmented Reality apps for iOS, Android and Smart Glasses, from concept to implementation. In 2014, I took part as a speaker in a series of conferences and workshops about UI\/UX best practices on Smart Glasses app development.<\/p>"},{"post_title":"Mauro Rubin","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/mauro-rubin\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/03\/mauro_droid-150x150.jpg","header":"Founder @ Joinpad","speaker_id":"1484","bio":"<p>Mauro Rubin was born in 1980 in Turin. He developed his first program in &#8220;basic language&#8221; when he was eleven years old, discovering the passion that would have stayed with him for the rest of his life. From 1998 to 2001 he teached skydiving in the italian Army and he approached for the first time to the virtual reality simulator for paratroopers. In 2003 he worked as analyst developer for several companies including Pricewaterhousecoopers. In December 2010 he founded JoinPad, one of the most advanced Augmented Reality company among the AR scene. Its core competence is developing and supporting applications for the industrial sector. JoinPad provides software solutions that offer an innovative and extremely user-friendly way to interact with the environment. In the 2015 Mauro Rubin is the first SmartGlasses Evangelist for Epson.<\/p>"}],"content":"<p>What’s Augmented Reality? How is possible to design a good AR app for smart glasses? Through two different theorical parts lead by the two tutors, this workshop will guide the participants first in the world of Augmented Reality, with history and case studies explanation of this technology. During the second section, UX and UI principles will be introduced to learn how to design a simple Augmented Reality App for smart glasses, with a special focus on Epson Moverio BT-200.<\/p>\n"},{"post_title":"Experimenting Monitoring and Proximity techniques using Android potential and iBeacon devices","url":"http:\/\/it.droidcon.com\/2015\/sessions\/experimenting-monitoring-and-proximity-techniques-using-android-potential-and-ibeacon-devices\/","time":"14:30","end_time":"15:10","date":"9 April 2015","location":"Sala Istanbul","color":"","track":["Bluetooth","ibeacon","Proximity"],"speakers":[{"post_title":"Matteo Gazzurelli","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/matteo-gazzurelli\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/04b66ce-150x150.jpg","header":"Founder \/ Android Developer @ DuckMa Srl","speaker_id":"859","bio":"<p>I started to develop apps for the Android back in 2009, first as an an employee and then as a contractor, until I decided it was time for me to fund my first company, DuckMa.<br \/>\nDuckMa is a small and mobile focused design and software boutique located in Northern Italy primarily working with startups and national leading brands.<br \/>\nWe are a group of passionate professionals who make handcrafted mobile apps both native and hybrid.<br \/>\nWe complement our software development services with teaching activities in the mobile space.<br \/>\nDuring the last year we specialised our competences on iBeacon technology working with some leading edge customers who operate in the proximity marketing field.<\/p>"}],"content":"<p>What is iBeacon technology and what is used for?<br \/>\nHow can we use this technology to effectively track people movements in a closed space like a room or a shop?<br \/>\nHow can we push them interesting contents based on their proximity to an object?<br \/>\nIn my presentation I will show you how to create a simple indoor location app to locate users in a room mapped through some iBeacon devices. Then I will show you how to interact with users presenting them notifications and contents based on their distance from iBeacon devices.<\/p>\n"},{"post_title":"Engineering Wunderlist for Android","url":"http:\/\/it.droidcon.com\/2015\/sessions\/engineering-wunderlist-for-android\/","time":"14:30","end_time":"15:10","date":"9 April 2015","location":"Sala Madrid","color":"","track":["Best practice","Development"],"speakers":[{"post_title":"Cesar Valiente","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/cesar-valiente\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/cesar-valiente-150x150.jpeg","header":"Android engineer at 6Wunderkinder","speaker_id":"844","bio":"<p>Cesar Valiente is currently working at 6Wunderkinder (in Berlin), the makers of Wunderlist, the famous and awarded multi platform productivity app, as Android Engineer.<\/p>\n<p>Previously, he worked in Amsterdam (Netherlands) and Madrid (Spain) in some relevant big companies and startups\/agencies.<\/p>\n<p>He considers himself a community guy, he is co-founder of AndroidStartup, which is the most important and largest Android developer community located in Madrid, and he’s also an Open Source advocate, trying to spread the great benefits of open source software whenever he can.<\/p>"}],"content":"<p>Wunderlist is the most important productivity app with more than 10 million users, available in the five most important platforms, best app of the year in the Mac App Store 2013… uppps… this is Droidcon Torino right?? ok … then:<\/p>\n<p>Wunderlist for Android, rated 4.5 and in Editor’s Choice since August 2013, Top Developers in Google Play Store, being promoted as a featured app by Google several times and included in the collection of the Best Apps of 2014.<\/p>\n<p>Do you want to know how Wunderlist has been made? the architecture? the secrets about the real time sync and more many more cool stuff?<br \/>\nIn this talk I will explain you everything that you wanted to know and never dared to ask <img src=\"http:\/\/it.droidcon.com\/2015\/wp-includes\/images\/smilies\/icon_wink.gif\" alt=\";-)\" class=\"wp-smiley\" \/><\/p>\n"},{"post_title":"Writing Android Libraries","url":"http:\/\/it.droidcon.com\/2015\/sessions\/writing-android-libraries\/","time":"14:30","end_time":"15:10","date":"9 April 2015","location":"Sala Lisbona","color":"","track":["Best practice","Development","Libraries","Ndk"],"speakers":[{"post_title":"Emanuele Zattin","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/emanuele-zattin\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/emanuele-zattin2-e1425131316342-150x150.jpg","header":"Senior SW Engineer at Realm","speaker_id":"811","bio":"<p>38 years old, Italian and living in Denmark since 2005.<br \/>\nWorked for Nokia for 5 years, growing expertise in development for embedded devices and tooling.<br \/>\nWorked for Realm for the last year, working on the Android version of Realm, the build systems and the continuous integration setup.<\/p>"}],"content":"<p>t some point during your career as a developer you will consider writing a library. Sometimes you want to do it simply to be able to reuse your code in an elegant way. Other times because your code-base is getting so big that you feel the urge to modularize it. Sometimes you just realize you invented a cool new way to perform a specific task and you want to share it with the rest of the world. Whatever your motivation is you will come across some choices and difficulties which hard to predict and even harder to solve. Questions about the build system, the publishing process, the Android vs Java compatibility and many many more are waiting for you. In this talk I will try to show you the best practices my team and I came up with to write libraries both in Java or exposing a C\/C++ code-base. We will discuss API design, CI techniques and performance considerations try to provide you with the right tools for the job.<\/p>\n"},{"post_title":"Prototype your Mobile UX design-Workshop","url":"http:\/\/it.droidcon.com\/2015\/sessions\/prototype-your-mobile-ux-design-workshop-2\/","time":"14:30","end_time":"17:30","date":"9 April 2015","location":"Sala Parigi","color":"","track":["Design","UX"],"speakers":[{"post_title":"Wiebe Elsinga","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/wiebe-elsinga\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Wiebe-Elsinga-150x150.jpeg","header":"Android GDE at GDG Dutch Android User Group","speaker_id":"802","bio":"<p>Besides being a Google Developer Expert for Android, I’m also an Android Developer with a passion for UX and design.<br \/>\nCo-Founder\/Organizer of the Google Developer Group Dutch Android User Group and working at Itude Mobile.<br \/>\nBasically a EntrepreNerd. Mainly focused on the design and development of mobile applications.<\/p>"}],"content":"<p>Mobile (User) Experience Design is very important when creating awesome mobile application.<br \/>\nThis workshop will show you how the professionals do this.<br \/>\nAlso you will learn how to design a mobile application and how to improve your design skills.<\/p>\n"},{"post_title":"The 16 milliseconds magic.","url":"http:\/\/it.droidcon.com\/2015\/sessions\/the-16-milliseconds-magic\/","time":"15:20","end_time":"16:00","date":"9 April 2015","location":"Sala Istanbul","color":"","track":["Animation","Development","UI"],"speakers":[{"post_title":"Pasquale Anatriello","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/pasquale-anatriello\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/97eb4dac-0363-4482-978b-3281e2a0ff06-150x150.jpg","header":"Lead Android developer @ Digitas LBI","speaker_id":"861","bio":"<p>I&#8217;ve been active in mobile development since 2007. Started with iOS and soon moved to the &#8220;green side&#8221;. Smoothly moving things on the screen and awesomeness have always been my mani goal.<br \/>\nLiving in London since 2013.<\/p>"}],"content":"<p>16 is the real magic number.<br \/>\nWhy should you care about it?<br \/>\nHow is Android really making things move on that screen? Why should you care about vSync and what exactly is it?<br \/>\nLayout passes, measurements and drawing will have no more secrets for you if you attend this talk (well almost&#8230;)<\/p>\n"},{"post_title":"Grab’n Run: a practical and secure library for dynamic code loading on Android devices","url":"http:\/\/it.droidcon.com\/2015\/sessions\/grabn-run-a-practical-and-secure-library-for-dynamic-code-loading-on-android-devices\/","time":"15:20","end_time":"16:00","date":"9 April 2015","location":"Sala Lisbona","color":"","track":["Best practice","Development","Security"],"speakers":[{"post_title":"Luca Falsina","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/luca-falsina\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/falsina-150x150.jpg","header":"Master student in ECS at Politecnico di Milano","speaker_id":"855","bio":"<p>Luca Falsina is currently a Master student in Engineering of Computing Systems at Politecnico di Milano, university in which he also got his Bachelor Degree in 2012.<br \/>\nDuring his Master thesis period, Luca is deepening his knowledge in the computer security area, in particular related to Android mobile phones, and in cryptography, especially when used on the very same devices. Grab’n Run, an open-source library to secure dynamic code loading on Android devices, is the main outcome of his thesis work and is clearly a mixture between these two areas of interest.<br \/>\nDuring his first Master year, Luca had the possibility to spend six months at the Computer Science Department of Aarhus University in Denmark, where, among all, he strengthened his cryptography knowledge by taking Ivan Damgård class on the topic.<br \/>\nBack in 2012 Luca joined the DOSE project, a course organized by ETH Zurich, whose goal was teaching how to successfully manage and develop outsourced and distributed complex pieces of software while cooperating with teams from all over the world.<br \/>\nLuca has also experience in teaching activities at Politecnico di Milano, where in particular he covered the position of Laboratory Tutor for the final examination course in Software Engineering in 2013 and where he is currently enrolled as a Tutor for incoming foreign Master students with the program “150 Ore”.<\/p>"}],"content":"<p>Recent studies [Poeplau. 2014] show developers of Android apps, even the most famous ones (i.e. Facebook, Google Ads), may need to dynamically load additional code during execution. Such code can be recovered from both local or remote containers. This technique has clear advantages, as minimizing code occupancy in memory or helping deploy “silent updates” to decouple updates of our app from those of its third-party libraries.<br \/>\nUnluckily some drawbacks in terms of security are also carried out. Firstly, malware authors may use dynamic code loading (DCL) to bypass antivirus checks by loading malicious code at runtime after that an apparently benign APK has been installed. Secondly, native Android API do not implement any kind of integrity check on DCL. This means that a remote attacker, that succeeds in modifying the bytecode of the APK or JAR container specified as source for DCL, will, not only, not been caught but also see his repackaged code kindly executed by the Dalvik VM. This kind of vulnerabilities was found in 9.25% of apps present on Play Store in 2012. In our opinion devs should not be required to be security or crypto experts and that&#8217;s why we think that API should abstract security details by implementing the best practices in a truly transparent way for devs.<br \/>\nIn this talk an overview on this issue will be depicted alongside with Grab&#8217;n Run, an open-source drop-in library that wraps current DexClassLoader API with an extra layer and makes DCL easier, safe and secure.<\/p>\n"},{"post_title":"Kick-start your experience with Android Wear","url":"http:\/\/it.droidcon.com\/2015\/sessions\/kick-start-your-experience-with-android-wear\/","time":"15:20","end_time":"16:00","date":"9 April 2015","location":"Sala Londra","color":"","track":["androidwear","Development","Wearable"],"speakers":[{"post_title":"Mario Viviani","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/mario-viviani\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/mario-viviani-150x150.jpeg","header":"CEO at Mariux Apps, Google Developer Expert","speaker_id":"791","bio":"<p>Mario Viviani, Android Developer since 2010, has been nominated Google Developer Expert (GDE) for Android by Google in 2013. Mario has published more than 90 apps on Google Play. In 2011 Mario decided to create the startup Mariux Apps, based in Milan, Italy, focused on Mobile Applications Development. He’s member of Talent Garden, a network of co-working spaces focused on digital and innovation. As Mariux Apps his products received 12.000.000+ total downloads and are currently ranked in the Top 100 apps in a lot of Categories in Google Play. At Mariux Apps he’s also working with cutting edge technologies like Google Glass and Leap Motion. Mario is really active in the Android community, attending a lot of events worldwide, helping Android developers build new, compelling and well-received apps.<\/p>"}],"content":"<p>With the addition of Android Wear to the Android ecosystem, the &#8220;wearables era&#8221; is officially opened. Android apps can now extend beyond the limits of smartphone and tablets, providing to the user a new kind of interaction where &#8220;less is more&#8221; and opening new ways for developers to engage users within their apps.<br \/>\nHowever, the approach to Wear development is slightly different from handheld Android coding, and different are also the types of applications developers can design, develop and distribute for Wear devices.<br \/>\nIn this talk you will discover how to easily setup and include Android Wear features within your Android App in just a few minutes, an overview of Android Studio tools for Wear development, what are the best practices of Wear APIs you should keep in mind and what are the main differences between &#8220;classic&#8221; Android handheld development and Wear.<\/p>\n"},{"post_title":"Testable Android Apps","url":"http:\/\/it.droidcon.com\/2015\/sessions\/testable-android-apps\/","time":"15:20","end_time":"16:00","date":"9 April 2015","location":"Sala Madrid","color":"","track":["Development","Testing"],"speakers":[{"post_title":"Fabio Collini","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/fabio-collini\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/fabio-collini-150x150.jpeg","header":"Android developer @ Nana Bianca","speaker_id":"814","bio":"<p>Fabio Collini is an Android developer since 2009, first as a freelance with two apps on Play Store and now as senior developer at Nana Bianca, a startup accelerator in Florence. In the last months he is working on the Android version of Freapp, a social network dedicated to Android and iOS apps. He is a co-owner and writer for the Technical blog &#8220;CoseNonJaviste&#8221; (http:\/\/www.cosenonjaviste.it\/) dedicated to Java and Android platforms.<\/p>"}],"content":"<p>Quale è il framework giusto per scrivere i test su Android? Espresso o Robotium? Robolectric o il buon vecchio junit? Purtroppo il motivo per cui molti sviluppatori Android non scrivono i test (e quindi non fanno tdd) non è dovuto alle librerie di testing ma alla bassa testabilità del codice Android. In questo talk vedremo con alcuni esempi concreti come è possibile sfruttare la dependency injection con Dagger e l&#8217;organizzazione del codice seguendo il pattern MVP per rendere la propria app facilmente testabile.<\/p>\n"},{"post_title":"The unconventional devices for the Android video streaming","url":"http:\/\/it.droidcon.com\/2015\/sessions\/the-unconventional-devices-for-the-android-video-streaming\/","time":"16:10","end_time":"16:50","date":"9 April 2015","location":"Sala Madrid","color":"","track":["Androidtv","Chromecast","Development"],"speakers":[{"post_title":"Alessandro Martellucci","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/alessandro-martellucci\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/IMG_4323-Custom-150x150.jpg","header":"Senior Android Developer at Open Reply","speaker_id":"839","bio":"<p>Computer Scientist at Open Reply with a strong attitude to work with other people. Likes working hard and solving problems. Specialist in mobile development sector, especially for Android applications, everyday tempts to make sure everything would be innovative. Experienced in mobile-side and server-side development, domain modelling, analysis requirements but always careful of world changes<\/p>"},{"post_title":"Matteo Bonifazi","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/matteo-bonifazi\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/bonifazi-150x150.png","header":"Android developer at Reply-Open Reply","speaker_id":"1104","bio":"<p>Mobile Software Engineer with deep passion in application development and willing to face new challenges. Background in Computer Engineering brings strong analytical skills and problem solving attitude.<\/p>\n<p>Skilled in building cutting-edge mobile applications, mainly developing for Android device (smartphone, tablet and smart Tv). Experienced working with Android source AOSP. Solid OO design and modeling using UML; strong interest to apply AGILE methodologies in software life cycle.<\/p>\n<p>Experienced in working and living abroad.<\/p>\n<p>Author of the book “Sviluppare applicazioni per Android in 7 giorni” (http:\/\/androidinsettegiorni.wordpress.com\/).<\/p>\n<p>Member of GDG Rome with the goal to spread Android technologies to the community.<\/p>"}],"content":"<p>Streaming video is not just through Android smartphone and tablet.<br \/>\nThe 2014 was the year where Chromecast reached its brightness, getting into 4 millions living rooms. The 2015 instead is the year of the Android TV, the Google way &#8220;to smart&#8221; the TV.<br \/>\nThis talk we’ll give you an overview about the streaming in Android. Starting from video streaming on mobile devices, we will guide you into the evolution of the development through Chromecast up to Android TV.<br \/>\nMatteo Bonifazi and Alessandro Martellucci will be illustrating this talk with their experiences developing mobile television applications for the main Italian broadcaster providers.<\/p>\n"},{"post_title":"TDD for Android","url":"http:\/\/it.droidcon.com\/2015\/sessions\/tdd-for-android\/","time":"16:10","end_time":"16:50","date":"9 April 2015","location":"Sala Lisbona","color":"","track":["Best practice","Design","Development","Tdd"],"speakers":[{"post_title":"Matteo Vaccari","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/matteo-vaccari\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/matteo-vaccari-150x150.jpeg","header":"Freelance","speaker_id":"828","bio":"<p>I started my career in academia in formal methods, then I worked as a developer, then I gradually morphed into an agile coach. I do, coach and teach Extreme Programming and other agile methods. I&#8217;m particularly keen on the more technical side of XP, such as TDD.<\/p>"}],"content":"<p>Delivering updates with confidence; shortening time to market; writing clean and correct code every day: this is the promise of Test-Driven Development. But, it&#8217;s not easy to do TDD in Android. You have to either run the tests on the device, or install a complex framework that mimics the Android APIs. Both options slow you down.<\/p>\n<p>In this session we&#8217;ll get back to the roots of TDD and show how to deal with this problem. We&#8217;ll learn time-tested techniques that greatly reduce the need to run tests on the device. The good side-effect of these techniques is that our code becomes simpler and better. We&#8217;ll learn about old workhorses such as presenter-first, model-view separation, humble dialog box and spikes.<\/p>\n<p>I will present an example of how to test-drive a drawing application that supports multi-touch.<\/p>\n<p>Warning: this is not a session about testing! It&#8217;s about writing well-written, well-designed code. Testing is important, but it&#8217;s not our focus here; we use test to drive the design.<\/p>\n<p>This session&#8217;s material is from my training course http:\/\/www.avanscoperta.it\/it\/training\/tdd-android\/ and our upcoming book https:\/\/leanpub.com\/tddforandroid<\/p>\n"},{"post_title":"Building High-Performance Android Applications in Java and C++","url":"http:\/\/it.droidcon.com\/2015\/sessions\/building-high-performance-android-applications-in-java-c\/","time":"16:10","end_time":"16:50","date":"9 April 2015","location":"Sala Istanbul","color":"","track":["Development","Java","Jni","Performance"],"speakers":[{"post_title":"Kenneth Geisshirt","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/kenneth-geisshirt\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/kenneth-150x150.jpg","header":"Software developer @ Realm","speaker_id":"822","bio":"<p>Chemist by education, geek by Nature, and working as software developer at Realm.<\/p>"}],"content":"<p>Apps become more complex, and users expect smooth UIs. In order to meet both demands, app developers often have to dive into the dark waters of performance optimisation techniques At first, these techniques might look as magic as any other sufficiently advanced technology and you drift any and hope for a more powerful device next year. This talk will present techniques and tricks for building high-performance Androids apps. These tricks include working closer to the CPU with the Java Native Interface (JNI) with C++ source code, managing memory efficiently, and utilising multi-threading to keep multiple cores busy.<\/p>\n"},{"post_title":"Advanced dev tips for Android Wear","url":"http:\/\/it.droidcon.com\/2015\/sessions\/advanced-dev-tips-for-android-wear\/","time":"16:10","end_time":"16:50","date":"9 April 2015","location":"Sala Londra","color":"","track":["androidwear","Development","UI","Wearable"],"speakers":[{"post_title":"Alfredo Morresi","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/alfredo-morresi\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Alfredo-Morresi-150x150.jpg","header":"Developer Relations Program Manager at Google","speaker_id":"778","bio":"<p>I have always been addicted by innovation since 12 years old. My last passion (and work, of course) is Android, but in the past I managed Windows and Linux infrastructures for middle-size companies (250-300 empl.) and developed applications using .NET and Java.<\/p>\n<p>Now, in Google, I&#8217;m taking care of the developers Italian ecosystem, providing technical contents, organizing events, teaching in universities, working with communities and much more.<\/p>"}],"content":"<p>You first Android Wear app is finally complete. A working notification system, a couple of custom wear activities and an exciting voice input<br \/>\ncontrol. Now what?<br \/>\nIn this session, you&#8217;ll learn about some of the advanced Android Wear programming guidelines, code optimizations, useful community libraries, best UI patterns seen so far, brilliant watch faces, pitfalls to avoid and other &#8220;real world&#8221; Android Wear tips&#8217;nd tricks.<\/p>\n"},{"post_title":"Barcamp","url":"http:\/\/it.droidcon.com\/2015\/sessions\/barcamp-5\/","time":"17:10","end_time":"18:40","date":"9 April 2015","location":"Sala Lisbona","color":"","track":[],"speakers":[],"content":""},{"post_title":"Barcamp","url":"http:\/\/it.droidcon.com\/2015\/sessions\/barcamp-3\/","time":"17:10","end_time":"18:40","date":"9 April 2015","location":"Sala Madrid","color":"","track":[],"speakers":[],"content":""},{"post_title":"Barcamp","url":"http:\/\/it.droidcon.com\/2015\/sessions\/barcamp\/","time":"17:10","end_time":"18:40","date":"9 April 2015","location":"Sala Londra","color":"","track":[],"speakers":[],"content":""},{"post_title":"To be Defined","url":"http:\/\/it.droidcon.com\/2015\/sessions\/to-be-defined-6\/","time":"17:10","end_time":"17:50","date":"9 April 2015","location":"Sala Istanbul","color":"","track":["Game design","Game developing"],"speakers":[{"post_title":"Valerio Di Donato","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/valerio-di-donato\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/03\/2fded0a-150x150.jpg","header":"Lead Engineer at Rocketplay","speaker_id":"1369","bio":"<p>I have been developing applications and games for mobile platforms (iOS, Android) for the last 6 years, trying my best to reach or create the state-of-the-art in whatever project I have been involved.<\/p>\n<p>I have been studying, prototyping and working on games for years: I coded or leaded the technical part of more than five finished games and I directed one.<\/p>"}],"content":""},{"post_title":"AngularJS: from code to mobile","url":"http:\/\/it.droidcon.com\/2015\/sessions\/angularjs-from-code-to-mobile\/","time":"18:00","end_time":"18:40","date":"9 April 2015","location":"Sala Istanbul","color":"","track":["Cloud","Crossplatform","html5"],"speakers":[{"post_title":"Gabriele Mittica","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/gabriele-mittica\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/DSCF0167-150x150.jpg","header":"Cloud Developer @ Corley srl","speaker_id":"819","bio":"<p>I&#8217;m a experienced developer in cloud computing with long experience in international speaking. I talked at MongoDB Day, AngularJSDay, Google DevFest, CloudConf, Mobile TEA Party and other events. Now focused con cross-platform scripting with AngularJS.<\/p>"}],"content":"<p>How to centralize the coding in one place using AngularJS, Grunt, Bower, PhoneGAP and other tools to create a web and mobile application easy to manage, ready to push on the market and able to work with cloud services (AWS) directly from the client.<\/p>\n"},{"post_title":"Presenting The New Joinpad Ar Sdk For Moverio Bt-200 Smart Glasses-Workshop","url":"http:\/\/it.droidcon.com\/2015\/sessions\/presenting-new-joinpad-sdk-moverio-smart-glasses\/","time":"09:00","end_time":"13:00","date":"10 April 2015","location":"Sala Copenaghen","color":"","track":["Augmented reality","Development","smart glasses"],"speakers":[{"post_title":"Niccolò Mangiarotti","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/niccolo-mangiarotti\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/03\/niccolo_droid-150x150.jpg","header":"AR Development Specialist @ JoinPad","speaker_id":"1488","bio":"<p>I&#8217;m Niccolò Mangiarotti and I work as Augmented Reality development specialist in JoinPad. I approached the world of software development for the first time at the age of 12, finding out that I had a great passion for the world of computer science. During my life this passion guided me through a great variety of sectors, spacing from hardware repairing to research and deploy of innovative software solutions, passing through databases administration, backend to frontend development, enterprise projects architecture prototyping and much more, I always built my knowledges as an autodidact and I&#8217;m very proud of it. Even tough my awareness is wide, I also have a very deeply detailed knowledge in each one of the sector I accessed. By working with Augmented Reality I ended up finding the context in which I can fully express my potential.<\/p>"}],"content":"<p>This workshop will introduce the major features of the new Augmented Reality SDK developed by JoinPad for Epson Moverio BT-200 smart glasses. Thanks to a step by step detailed tutorial, the participants will be guided through the creation of a basic Augmented Reality app.<\/p>\n"},{"post_title":"Cyanogen Workshop – Building your own Android OS","url":"http:\/\/it.droidcon.com\/2015\/sessions\/cyanogen-workshop\/","time":"09:00","end_time":"17:00","date":"10 April 2015","location":"Sala Parigi","color":"","track":["Rom Cooking"],"speakers":[{"post_title":"Abhisek Devkota","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/abhisek-devkota\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Abhisek-Devkota-150x150.jpg","header":"Senior Engineering &amp; Community Manager @ Cyanogen Inc.","speaker_id":"1086","bio":"<p>Abhisek Devkota is the Senior Engineering &amp; Community Manager Cyanogen Inc., formed to support the largest aftermarket Operating System for Android devices ­ CyanogenMod, and provide additional consumer choice with the Android platform. The CyanogenMod Project is an open ­source distribution that is community driven and created in collaboration with volunteers around the world, with the goal to allow users to truly own their phone through customization, functionality and enhanced security over their personal data.<\/p>\n<p>Abhisek is a veteran of the consulting industry surrounding Washington, DC. Before joining Cyanogen Inc. he worked on implementation of Software as a Service solutions for various US government agencies and in his spare time, was himself a volunteer to the CyanogenMod project for 6 years.<\/p>\n<p>Abhisek is an avid fan of technology and open­ source communities. He is especially interested in opening the more niche prosumer and enthusiast ideas to the average user, including the benefits of secure services and personal data management.<\/p>"}],"content":"<p>Learn to build the CyanogenMod based Android OS on your own &#8211; no experience required. A step by step guide will be provided to build Lollipop for some of the most popular devices from HTC, LG, Sony and more. Learn how to setup a build environment, sync the Android source, an overview of the Android build system and how to compile the OS for yourself. All you need to bring is an SSH capable laptop and a enthusiasm!<\/p>\n"},{"post_title":"The Android Build System – A Gradle Perspective","url":"http:\/\/it.droidcon.com\/2015\/sessions\/the-android-build-system-a-gradle-perspective\/","time":"09:00","end_time":"09:50","date":"10 April 2015","location":"Sala Londra","color":"","track":["Best practice","Gradle"],"speakers":[{"post_title":"Etienne Studer","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/etienne-studer\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/etienne-studer-150x150.jpeg","header":"VP of Product Tooling @ Gradleware GmbH","speaker_id":"846","bio":"<p>Etienne has been working as a developer, architect, project manager, and CTO over the past 15 years. He has spent most of his time building software products from the ground up and successfully shipping them to happy customers. He had the privilege to work in different domains like linguistics, banking, insurance, logistics, and process management. Etienne is convinced that key ingredients of delivering software successfully are simplicity, test-driven development, build automation, customer feedback, continuous improvement, and a team of high technical and social skills.<\/p>"}],"content":"<p>The Gradle-based Android build system has been designed to elegantly deal with the diversity of the Android ecosystem and the demands of modern development practices. In this presentation, we will take a closer look at the unique concepts and features of Gradle and how they are leveraged for Android.<br \/>\nThe new Android build system is also a key component to the Android Studio. We will show you how this makes Android Studio much more powerful than other Android IDEs.<\/p>\n<p>Along the way, you will also learn some hands-on Gradle tricks that you can apply to your daily Android work.<\/p>\n"},{"post_title":"Android Piracy","url":"http:\/\/it.droidcon.com\/2015\/sessions\/android-piracy\/","time":"09:00","end_time":"09:40","date":"10 April 2015","location":"Sala Istanbul","color":"","track":["Copyprotection","Security"],"speakers":[{"post_title":"Martin Liersch","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/martin-liersch\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/liersch-150x150.jpg","header":"Papierprintit GmbH","speaker_id":"825","bio":"<p>I am a freelance Android developer from Germany. I started to develop Android apps right when I got my Motorola Milestone. It all started with an app where students at my university could rate and comment on the meals in the cafeteria. A lot of apps followed the success of this first app and I now have a couple of dozen apps in the Play Store (and other app stores) – ranging from some unsuccessful ideas to 1 million+ downloads apps. I am also an organizer of the GTUG Lake Constance and a frequent speaker at Android events.<\/p>"}],"content":"<p>This talk will show the problems that arise from pirated apps as well as which countermeasures you, as a developer, can take to make it as difficult as possible to pirate your apps.<\/p>\n"},{"post_title":"Put Android on your objects and make them alive!","url":"http:\/\/it.droidcon.com\/2015\/sessions\/put-android-on-your-objects-and-make-them-alive\/","time":"09:00","end_time":"09:40","date":"10 April 2015","location":"Sala Madrid","color":"","track":["Hardware"],"speakers":[{"post_title":"Luca Pisani","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/luca-pisani\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/pisani-150x150.jpg","header":"Mobile &amp; Software Developer at UDOO","speaker_id":"823","bio":"<p>Luca is a Computer Scientist with expertise and experience in Android programming, software development and hardware hacking. Now he focuses on embedded solutions as well as developing Android Apps.<\/p>"},{"post_title":"Michelangelo Guarise","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/michelangelo-guarise\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/guarise-150x150.jpg","header":"Maker, Audio Enthusiast and Tech Journalist at UDOO","speaker_id":"1096","bio":"<p>Michelangelo focuses on Cognitive Aspects of User Interactions, Community building and Physical Computing.<\/p>"}],"content":"<p>We are used to see and interact with Android just with touch devices. But there&#8217;s a whole world yet to explore: physical things and Internet of Things. What if Android could power our everyday, offline appliances? What if we could integrate them using the thousands of available Android APIs ?<br \/>\nWe&#8217; re going to see how to make this happen, turning for example a regular coffee machine into a voice controlled, interactive and internet enabled coffee maker called Moka. Moka will greet us in the morning asking if we want a coffee and how do we want it. While preparing Moka can inform us about weather, news or cheer us with our favourite spotify music.<br \/>\nThis can enable developers and makers to move Android away from touch devices, and create interactive projects with physical computing abilities.<br \/>\nWe&#8217;ll detail how to achieve such result with UDOO, a single board computer that combines Android with Arduino.<br \/>\nWe&#8217;ll explain we can fully exploit ADK capabilities and integrate every API into the physical world: like moving a motor when a tweet is received, turn Home heating system if outside weather requires it or turn on a light with a simple voice command. We&#8217;ll cover the basics of ADK implementation and explain some minimal Arduino related Hardware wiring.<\/p>\n"},{"post_title":"ARM: a long history","url":"http:\/\/it.droidcon.com\/2015\/sessions\/arm-a-long-history\/","time":"09:00","end_time":"09:40","date":"10 April 2015","location":"Sala Lisbona","color":"","track":["History"],"speakers":[{"post_title":"Elia Bellussi","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/elia-bellussi\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/elia-150x150.jpg","header":"President at Museo Piemontese dell&#8217;Informatica","speaker_id":"810","bio":"<p>I&#8217;m a founder and the president of non profit cultural association &#8220;Museo Piemontese dell&#8217;Informatica &#8211; MuPIn&#8221; since september 2011. I&#8217;m also a system engineer and ITIL consultant for an Italian ICT company: Consoft Sistemi (Gruppo Consoft S.p.A.) since may 2011.<\/p>"}],"content":"<p>What is ARM? Since when exist this technology?<br \/>\nThe ARM instruction set&#8217; architecture has a long life although a certain technology will eventually be replaced by newer. We want to know how it is remained at the top of the market, what lucky coincidences have guided it from the era of Acorn Computer until today. A long journey in which many major companies and technologies have fallen by the wayside. In few words: a journey in the history of computer science about ARM instruction set&#8217; architecture.<\/p>\n"},{"post_title":"HOLY SYNC: A sane approach to offline-first cross-platform data syncing","url":"http:\/\/it.droidcon.com\/2015\/sessions\/holy-sync-a-sane-approach-to-offline-first-cross-platform-data-syncing-2\/","time":"09:50","end_time":"10:30","date":"10 April 2015","location":"Sala Lisbona","color":"","track":["Database","Development","Networking","Offline","Sync"],"speakers":[{"post_title":"Eugenio Marletti","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/eugenio-marletti\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/3f952ce-150x150.jpg","header":"Senior Android Developer @ Clue","speaker_id":"812","bio":"<p>Stuck in a love\/hate relationship with the green droid. Addicted to challenges. Made in Italy, grown on the Web, currently proud Berliner.<\/p>"}],"content":"<p>Today users expect to have their data available on every device, and to be able to view and edit it at any time without an Internet connection.<br \/>\nGiven how common the need is, anyone who tried to approach this problem might have found out that it&#8217;s (un)surprisingly complex, and that there are very few available tools!<br \/>\nIn this talk I want to show how we solved it at Clue, without going crazy, on both Android and iOS.<\/p>\n<p>In particular:<\/p>\n<p>* Who needs this, and who doesn&#8217;t.<br \/>\n* Couchbase Lite: an open-source, cross-platform, embedded NoSQL database.<br \/>\n* Transitioning from a standard SQL data model to a NoSQL one, with deep implications on how that affects every level of the stack.<br \/>\n* How embracing a &#8220;Git-like approach&#8221; to conflict management can be tremendously effective.<br \/>\n* Keeping performance smooth on Android.<\/p>\n"},{"post_title":"Learn to accelerate – hardware acceleration in Android","url":"http:\/\/it.droidcon.com\/2015\/sessions\/learn-to-accelerate-hardware-acceleration-in-android\/","time":"09:50","end_time":"10:30","date":"10 April 2015","location":"Sala Londra","color":"","track":["Development","Graphics","UI"],"speakers":[{"post_title":"Royi Benyossef","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/royi-benyossef\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/personal_square-150x150.png","header":"Android group leader at Vidmind","speaker_id":"835","bio":"<p>I have been an Android developer since before the first Android phone existed and proceeded to work on Android based tablets and TVs long before they were launched by Google so you might say i&#8217;m an Android pioneer, as an avid Open source enthusiast i have been Organizing events as well as blogging and lecturing on Android related topics since 2008.<br \/>\nBoth of these facts have led to the fact that i am a Google developer expert since the program&#8217;s inception which means that i&#8217;m not a Google employee but Google believes that i know what i&#8217;m talking about as well as how to say it.<\/p>"}],"content":"<p>Hardware acceleration is a very important tool to know because it&#8217;s maybe the only tool that not knowing it can damage existing code for no apparent reason in a way that could make your application start crashing or misbehaving without you changing a single character of code.<br \/>\nWhy would that happen? Very simple; since hardware acceleration is simply the translation of former software rendered canvas drawing code to OpenGL commands which run on the GPU so your code looks the same but it does not act the same and to make matters worse it will also behave differently on different devices and API levels. So why do we need it and how do we make it right again? Wait and see&#8230; this is what the session is all about <img src=\"http:\/\/it.droidcon.com\/2015\/wp-includes\/images\/smilies\/icon_smile.gif\" alt=\":)\" class=\"wp-smiley\" \/><\/p>\n"},{"post_title":"Getting your app on Android TV","url":"http:\/\/it.droidcon.com\/2015\/sessions\/gettingyourapp-for-android-tv\/","time":"09:50","end_time":"10:30","date":"10 April 2015","location":"Sala Madrid","color":"","track":["Androidtv","Development"],"speakers":[{"post_title":"Xavier Hallade","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/xavier-hallade\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/xavier-150x150.jpg","header":"Software Engineer at Intel and Google Developer Expert","speaker_id":"804","bio":"<p>Xavier Hallade is Developer Evangelist in Intel Software and Service Group in Paris, France.<br \/>\nHe is helping developers to improve their support for new hardware and technologies backed by Intel, with a focus on the Android NDK, Android TV and dual-displays.<\/p>"}],"content":"<p>Discover Android TV and its promising ecosystem.<\/p>\n<p>See how you can easily adapt your apps and games to bring these to TV and distribute them through the Play Store.<br \/>\nLearn how to take advantage of TV-specific features from your apps, like live channels, global search and recommendations.<br \/>\nAlso, the Nexus Player being based on an Intel SOC; discover what it implies for existing apps and libs, like with any other Intel-based Android devices.<\/p>\n<p>This talk will give you a broad overview of all you can do with Android TV and your apps\/games.<br \/>\nTo experience more in details how to craft a TV application from scratch, it&#8217;s advised to follow up with Sebastiano&#8217;s talk &#8220;Developing an Android TV application&#8221;<\/p>\n"},{"post_title":"Developing an Android TV application","url":"http:\/\/it.droidcon.com\/2015\/sessions\/developing-android-tv-application\/","time":"10:40","end_time":"11:20","date":"10 April 2015","location":"Sala Madrid","color":"","track":["Androidtv","Development"],"speakers":[{"post_title":"Sebastiano Gottardo","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/sebastiano-gottardo\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/sebastiano-gottardo-150x150.jpeg","header":"Android Engineer @ musixmatch","speaker_id":"836","bio":"<p>Sebastiano is a CS M.Sc. currently working at musixmatch as an Android engineer. He is passionate about mobile security and cutting edge technologies, matured while working with companies like Megavideo and several other startups. He now actively contributes to the Android community with online articles and tutorials.<\/p>"}],"content":"<p>There have been several attempts at conquering the users’ living room by offering the perfect entertainment device. Android TV is Google’s latest effort to this end, which offers a sofa-tuned user interface based on Android Lollipop. Will you, as a developer, miss out the chance of bringing your content to the party?<\/p>\n<p>This talk will walk you through the building blocks of the TV-centric libraries and widgets offered by the Android framework. There will be code snippets, nice GIFs, live demos, best practices and more advanced techniques. Following Xavier Hallade&#8217;s talk &#8220;Getting your app on Android TV&#8221; is advised, so that you will have a comprehensive view of the Android TV ecosystem.<\/p>\n"},{"post_title":"Improving UX through performance","url":"http:\/\/it.droidcon.com\/2015\/sessions\/improving-ux-through-performance\/","time":"10:40","end_time":"11:10","date":"10 April 2015","location":"Sala Lisbona","color":"","track":["Development","Optimization","UX"],"speakers":[{"post_title":"Kentaro Takiguchi","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/kentaro-takiguchi\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Kentaro-Takiguchi-150x150.jpeg","header":"Software Engineer @ Cookpad","speaker_id":"872","bio":"<p>I&#8217;m an Android developer at Cookpad. I was involved in several large-scale projects that is required performance and scalability. More recently, Cookpad is expanding businesses to new markets such as Spain, Indonesia and Lebanon. I&#8217;m developing Android app while traveling the world.<\/p>"}],"content":"<p>These days, more companies are entering the global market and even more individuals are using smart phones globally. It is becoming increasingly important for mobile engineers to guarantee stable service under any environment. Cookpad Inc. is one of the companies that are struggling at this phase. The company runs the largest recipe site (50mil MAU) in Japan and is expanding businesses to new markets such as Indonesia and Lebanon. The greatest challenges in those countries are harsh internet environments such as low bandwidth, low specification devices and spreadout locales. As a leading Android engineer of the company, I would like to share some knowledge that we learned. My presentation consists of 3 parts.<\/p>\n<p>1. API design<br \/>\nUX depends a great deal on API design same as UI design. We should know how to design API for mobile which is totally different from web API. Specifically, API should be designed based on user action.<\/p>\n<p>2. Communicating with the server<br \/>\nThere are many ways to request\/cache\/manage resources. I will talk<br \/>\nabout the efficient way for an Android project that communicates with a server and how we optimize it.<\/p>\n<p>3. Image optimization<br \/>\nImage is a largest bandwidth consumer. The good news is that there are many effective ways to improve performance of application. I will do a demostration to show how images are loaded.<\/p>\n"},{"post_title":"Sensor Stack in 5.0: what’s new and why you should care about it","url":"http:\/\/it.droidcon.com\/2015\/sessions\/sensor-stack-in-5-0-whats-new-and-why-you-should-care-about-it\/","time":"10:40","end_time":"11:10","date":"10 April 2015","location":"Sala Istanbul","color":"","track":["Development","Sensor management"],"speakers":[{"post_title":"Claudio Capobianco","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/claudio-capobianco\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/capobianco-150x150.jpg","header":"Head of Human Machine Interaction @ Snapback","speaker_id":"871","bio":"<p>Claudio Capobianco (Head of Human Machine Interfaces at Snapback) is an aeronautical engineer and worked for six years as software analyst and developer of embedded systems in this field. He is a researcher on human factor and collaborates with the Department of Psychology, Sapienza University of Rome, Italy.<\/p>"}],"content":"<p>Android 5.0 Lollipop has arrived with the new Material Design, but there is much more than a new UI: sensors management also had a deep review that gives developer more control and opens the way to a better user-experience.<br \/>\nDuring the talk, I will introduce the Android sensor stack and the Sensors SDK API, both for app developers and AOSP developers. Examples of how the right use of Sensors API improves applications will be provided. Finally, I will introduce the Snapback SDK, explaining how it semplify the management of different kind of sensors.<\/p>\n"},{"post_title":"How Yahoo builds apps","url":"http:\/\/it.droidcon.com\/2015\/sessions\/how-yahoo-builds-apps\/","time":"10:40","end_time":"11:10","date":"10 April 2015","location":"Sala Londra","color":"","track":["Best practice","Development"],"speakers":[{"post_title":"Alex Florescu","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/alex-florescu\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/me_fb-150x150.jpg","header":"Lead Android Developer at Yahoo","speaker_id":"806","bio":"<p>George Washington University graduate, BS &#8220;magna cum laude&#8221; 2010, MS 2011.<br \/>\nWorked at Goldman Sachs on a commodity e-trading system from 2011 to 2013.<br \/>\nFrom 2013, joined Yahoo initially as a back-end \/ big data developer, then Android developer where I became the Lead for the Fantasy Football App released in July 2014.<br \/>\nAlso published local London Android apps as an independent developer, under the company name Shardbits.<\/p>\n<p>I write a blog at www.florescu.org and I&#8217;m also a writer for Yahoo&#8217;s mobile blog at yahoo-mep.tumblr.com.<\/p>"}],"content":"<p>I would like to present the process and methodology that we employ at Yahoo London to build high quality apps for millions of users over the world. This would be a high-level talk touching on several different aspects such as team dynamics, testing, architecture, reporting, internationalisation etc.<\/p>\n"},{"post_title":"Studio di Gestures innovative per l’interazione con App per dispositivi mobili","url":"http:\/\/it.droidcon.com\/2015\/sessions\/studio-di-gestures-innovative-per-linterazione-con-app-per-dispositivi-mobili\/","time":"11:40","end_time":"12:10","date":"10 April 2015","location":"Sala Lisbona","color":"","track":["Interaction","UI","UX"],"speakers":[{"post_title":"Paolo Spagnoli","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/paolo-spagnoli\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/afterfocus_1350587375789-150x150.jpg","header":"Consultant at Capgemini","speaker_id":"831","bio":"<p>Appassionato di informatica e di tecnologia fin da piccolo, la mia carriera da vero NERD è iniziata durante il triennio della scuola media superiore iniziando a programmare in PASCAL.<br \/>\nSuccessivamente la mia carriera scolastica è proseguita con una laurea triennale e una laurea magistrale in informatica all&#8217;Università degli Studi di Milano Bicocca.<\/p>\n<p>Negli anni il mio interesse di focalizzato soprattutto sulla telefonia mobile e sulla UX, e in particolare sul mondo Android.<br \/>\nIl mio primo Smartphone Android è stato il bellisimo HTC Magic e sulla spinta dell&#8217;entusiasmo, da autodidatta, ho sviluppato la mia prima App (GlobeTrotter) iniziando a conoscere il mondo Android più nel dettaglio e a capirne i pregi e i difetti.<\/p>\n<p>Attualemnte lavoro presso Capgemini come Mobile Developer\/IT Consultant.<\/p>"}],"content":"<p>Negli ultimi anni dispositivi mobili dotati di schermi touch screen, quali smartphone e tablet, hanno registrato un notevole incremento di vendite e interesse da parte del pubblico. Questi dispositivi hanno una modalità di utilizzo completamente diversa rispetto al classico personal computer o ai vecchi telefoni cellulari; ad esempio il tipo di interazione, le modalità di utilizzo, la tipologia degli applicativi, le dimensioni dei device e anche la posizione di utilizzo sono totalmente differenti. Per questo motivo sono sempre più gli studi che tentano di progettare metodi di interazione e interfacce più user friendly e più consone a tali dispositivi. Uno studio di usabilità molto attento durante la fase di progettazione di una interfaccia utente può portare al successo di un’applicazione e migliorare l’esperienza d’uso. È dunque preferibile studiare e progettare interfacce innovative che sfruttino a pieno le potenzialità di questi device, facendo attenzione a non replicare le interfacce classiche che vengono utilizzare sui normali sistemi desktop e laptop, poiché poco finger friendly. In questo studio si è quindi voluto progettare, implementare e infine testare App con modalità di interazione completamente nuove e innovative.<\/p>\n<p>Sono state progettate due applicazioni che utilizzano paradigmi di interazioni differenti, che sono state poi oggetto del test da parte di alcuni utenti. Il primo prototipo è la pura replica di un’interfaccia per PC, con menù e icone. Il secondo invece ha un’interfaccia utente innovativa priva icone o menù, in questo caso l’utente può interagire con l’applicazione solo tramite gesture. Inoltre è stata progettata e realizzata anche una nuova modalità di zoom per mappe virtuali da affiancare alle altre già presenti.<\/p>\n"},{"post_title":"The magic box: Google Cardboard-introduction to Cardboard development and practical use with augmented reality","url":"http:\/\/it.droidcon.com\/2015\/sessions\/google-cardboard-synesthesia\/","time":"11:40","end_time":"12:10","date":"10 April 2015","location":"Sala Madrid","color":"","track":["Augmented reality","Development","Google Cardboard"],"speakers":[{"post_title":"Andrea Lucibello","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/andrea-lucibello\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/10457961_10204133282036056_7563095546593875599_n-150x150.jpg","header":"Android developer at Synesthesia","speaker_id":"772","bio":""},{"post_title":"Luca Piras","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/luca-piras\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/2013-08-01-14.15.49-150x150.jpg","header":"Android developer at Synesthesia","speaker_id":"783","bio":""}],"content":"<p>Join this talk to discover the magic inside the Google Cardboard box.<\/p>\n<p>We will show you how the cardboard works and how to create apps with the associated Google SDK.<br \/>\nFinally we will present an example of integration with an augmented reality framework.<\/p>\n"},{"post_title":"Can you work without open source libraries?","url":"http:\/\/it.droidcon.com\/2015\/sessions\/can-you-work-without-open-source-libraries\/","time":"11:40","end_time":"12:10","date":"10 April 2015","location":"Sala Londra","color":"","track":["License","Opensource"],"speakers":[{"post_title":"Gabriele Mariotti","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/gabriele-mariotti\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Gabriele-Mariotti-150x150.jpg","header":"Android developer at Namirial","speaker_id":"787","bio":"<p>Gabriele Mariotti is a software engineer at Namirial. He has been working in this company since 2001 on a wide variety of projects in Android, Android Wear,J2SE, J2EE and Lotus Notes.<br \/>\nHe is actively involved in the Android community and shares his passion writing blog posts and creating open source libraries.<br \/>\nMoreover he is one of organizers of the Google Developer Group in Ancona.<\/p>"}],"content":"<p>Every Android developer uses Open Source libraries.<br \/>\nAndroid has a large ecosystem of libraries that developers can freely use in their own apps, but before to choose to use a library, you should know some important points about the open source development.<br \/>\nThis sessions will introduce how to evaluate a library and how to get started the incredible experience to write an Open Source.<\/p>\n"},{"post_title":"IoT is not about “Things”, it’s about “You”","url":"http:\/\/it.droidcon.com\/2015\/sessions\/iot-is-not-about-things-its-about-you\/","time":"11:40","end_time":"12:10","date":"10 April 2015","location":"Sala Istanbul","color":"","track":["Development","Iot"],"speakers":[{"post_title":"Daniele Stirpe","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/daniele-stirpe\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/daniele-stirpe-150x150.jpg","header":"Backend Developer at Atooma","speaker_id":"809","bio":"<p>Daniele Stirpe is a Computer Scientist who works as a Backend Engineer in Atooma. He obtained his BSc and MSc in Computer Science Engineering at the University of Rome La Sapienza. During his studies he spent a period at the University of Lübeck (Germany) in order to prepare his master thesis focusing on Wireless Sensor Networks (WSN) and their relation with the Internet of Things (IoT).<\/p>"},{"post_title":"Luca Barboni","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/luca-barboni\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/barboni-150x150.jpg","header":"MKTG Manager @ Atooma","speaker_id":"1092","bio":"<p>My name is Luca Barboni and I&#8217;m a young and motivated professional working on Marketing and Communication Strategy.<br \/>\nMy background in Psychology of Communication gave me the tools to become aware and receptive on how to manage communication when it gets to connecting with people and building relationships, online and offline.<br \/>\nI am skilled with Social Media, Web Marketing, and I love combining them for smart solutions as in Growth Hacking.<\/p>\n<p>I am an evangelist of the Web 2.0 vision, advising companies on how to build their online presence from Branding on social media to Social Selling ultimately growing their business.<\/p>"}],"content":"<p>The Internet of Things (IoT) is a new vision of the Internet which is becoming a reality due to emerging new technologies guided by the current economy demand. Among these we can encounter Radio Frequency Identification (RFID), Wireless Sensor Networks (WSNs), embedded systems, as well as everyday life objects like smartphones.<br \/>\nThe goal of the IoT is to integrate all these technologies with the Internet cloud in order for every device to be accessible from anywhere, enabling the remote interaction with a huge amount of objects that can support a communication link. Atooma is an Android-based engine that enables new connections between connected entities, contributing to the Internet of Things distributed intelligence with an horizontal approach to the technology. Atooma vision is bringing us to develop a context-aware suggestion engine able to make sense of big data and deliver relevant informations and interactions directly to the end user. &#8220;From the Internet of Things to the Internet of You&#8221;.<\/p>\n"},{"post_title":"Android Industrial Mobility","url":"http:\/\/it.droidcon.com\/2015\/sessions\/android-industrial-mobility\/","time":"12:20","end_time":"13:00","date":"10 April 2015","location":"Sala Istanbul","color":"","track":["B2B","Best practice","Enterprise"],"speakers":[{"post_title":"Pietro F Maggi","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/pietro-f-maggi\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/pietro-f.-maggi-150x150.png","header":"EMEA SW Consultant @ Zebra Technologies","speaker_id":"862","bio":"<p>Pietro is a full-stack technical architect with 15 years of development experience from 8-bit MCU to HTML5 web apps who spent too much time architecting solutions for Enterprise Mobility before it was trendy.<\/p>\n<p>As European Technical Architect for Zebra Technologies Pietro has the opportunity to present to large industrial groups and public organisations about how to upgrade from legacy Industrial Mobililty to the new generation of Mobile OSes and modern architectures.<\/p>\n<p>Pietro is a regular presenter at international conferences such as Droidcon London,Amsterdam and Turin and European Apps World in addition to his public speaking activities inside Motorola Solutions.<br \/>\nDuring 2013 Pietro presented RhoMobile&#8217;s Developer Workshop across EMEA in 22 cities.<\/p>"}],"content":"<p>Best practices to use new technologies to solve old problems.<\/p>\n"},{"post_title":"The hitchhiker’s guide to functional testing","url":"http:\/\/it.droidcon.com\/2015\/sessions\/the-hitchhikers-guide-to-functional-testing\/","time":"12:20","end_time":"13:00","date":"10 April 2015","location":"Sala Lisbona","color":"","track":["Development","Testing"],"speakers":[{"post_title":"Ali Derbane","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/ali-derbane\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Ali-Derbane-150x150.png","header":"Software Engineer at Itude","speaker_id":"781","bio":"<p>In 2009 Ali Derbane started developing Android software at a company called Itude Mobile. With a vibrant team of cool developers he has developed various applications for different industries like banking and pharmaceutical. While developing these apps lots of challenges arose. These challenges drive him to keep learning about the exciting world of Android. Blogging, hosting workshops and talking about the challenges and the solutions to these challenges gives him the opportunity to share his knowledge with the rest of the world<\/p>"},{"post_title":"Wiebe Elsinga","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/wiebe-elsinga\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Wiebe-Elsinga-150x150.jpeg","header":"Android GDE at GDG Dutch Android User Group","speaker_id":"802","bio":"<p>Besides being a Google Developer Expert for Android, I’m also an Android Developer with a passion for UX and design.<br \/>\nCo-Founder\/Organizer of the Google Developer Group Dutch Android User Group and working at Itude Mobile.<br \/>\nBasically a EntrepreNerd. Mainly focused on the design and development of mobile applications.<\/p>"}],"content":"<p>Android development and testing go hand in hand. When it comes to automated functional testing there are plenty of frameworks out there. During this interactive session Wiebe and Ali will be presenting a fine selection that could help you decide what to use in your next project. Some of the frameworks they will talk about are Robotium, Robolectric, UIAutomator, Calabash, Selendroid and Espresso. And since it’s a developer conference there will be code as well!<\/p>\n"},{"post_title":"Automatising Android Development","url":"http:\/\/it.droidcon.com\/2015\/sessions\/automatising-android-development\/","time":"12:20","end_time":"13:00","date":"10 April 2015","location":"Sala Londra","color":"","track":["Continuous integration","Gradle","Jenkins"],"speakers":[{"post_title":"Enrique López Mañas","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/enrique-lopez-manas\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/575373_3578247571089_1120136129_33450891_1271959558_n-150x150.jpg","header":"Lead Android Developer at Sixt","speaker_id":"785","bio":"<p>Enrique is a Google Developer Expert, and Mobile Engineer at Sixt in Munich. Among other projects he has been involved with DriveNow, Sixt and myDriver. He spends his free time developing OpenSource code, writing articles, learning languages or taking photographies. He loves nature, beer, traveling, and talking about him in third person.<\/p>"}],"content":"<p>Automatising the build and release project will save you time and prevent you from manual mistakes&#8230; as long as it is done correctly.<\/p>\n<p>This talk will explore which tools and techniques you should use to automatise your Android project and how to correctly apply Continuous Integration &#8211; from Jenkins to Gradle scripting &#8211; and provide useful tricks and release strategies.<\/p>\n"},{"post_title":"From This To That – A deep dive into the TransitionManager and Activity Transitions","url":"http:\/\/it.droidcon.com\/2015\/sessions\/from-this-to-that-a-deep-dive-into-the-transitionmanager-and-activity-transitions\/","time":"12:20","end_time":"13:00","date":"10 April 2015","location":"Sala Madrid","color":"","track":["Design","Development","Graphics","UI"],"speakers":[{"post_title":"Lucio Maciel","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/lucio-maciel\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Lucio-Maciel-e1424969828513-150x150.jpeg","header":"Software Engineer at We Heart It","speaker_id":"789","bio":"<p>Lúcio Maciel is a Brazilian Software Engineer with almost 15 years of experience. Working with Mobile and Android for the last 4 years, he is passionate about beautiful UI and UX.<br \/>\nCurrently he is the Lead Android Engineer at We Heart It, and before that had worked for several Brazilian startups.<\/p>"}],"content":"<p>Like cool animations and transitions? And what about letting all the hard work to the Android Framework?<\/p>\n<p>In this talk Lucio will do a Deep dive into the TransitionManager and the new Activity Transitions on Lollipop and show how you can do cool transitions and let almost all the hard work to the Framework.<\/p>\n"},{"post_title":"Death to Passwords","url":"http:\/\/it.droidcon.com\/2015\/sessions\/death-to-passwords\/","time":"14:00","end_time":"14:40","date":"10 April 2015","location":"Sala Londra","color":"","track":["Authentication","Development","Security"],"speakers":[{"post_title":"Tim Messerschmidt","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/tim-messerschmidt\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/tim-messerschmidt-150x150.png","header":"Head of Developer Advocacy @ PayPal + Braintree","speaker_id":"867","bio":"<p>As a long time mobile and web developer, Tim channels his knowledge and experience as Braintree&#8217;s Head of Developer Relation. He is passionate about startups and served as mentor at multiple incubators and accelerators.<\/span><\/p>\n<p>Prior to joining PayPal, Tim worked with Neofonie Mobile and Samsung focusing on several mobile projects. In his spare time, he leads and creates training classes in all sorts of developer-oriented topics, contributes to Open Source projects and is one of the authors of the Mobile Developer’s Guide to the Galaxy. In addition, he authored numerous articles published in print magazines.<\/p>"}],"content":"<p>User authentication in mobile applications is a very common and integral use case. Implementing regular passwords is an easy solution for developers but comes with several pitfalls that impair user experience like (re-)entering passwords, the need to create a new unique password or even just the input of personal data on a flaky keyboard while registering a new account.<\/p>\n<p>In this talk the security flaws and UX implications of passwords will be discussed and highlighted which different techniques exist that are able to offer a more mobile friendly flow. Highlighting authorization and authentication techniques like OAuth, OpenID Connect and even hardware features like Bluetooth Low Energy this talk will be interesting for anyone who&#8217;s facing a situation where creating and storing user accounts matters.<\/p>\n"},{"post_title":"Pixel perfect is (not) the new black","url":"http:\/\/it.droidcon.com\/2015\/sessions\/pixel-perfect-is-not-the-new-black\/","time":"14:00","end_time":"14:40","date":"10 April 2015","location":"Sala Madrid","color":"","track":["Design","material design","UI"],"speakers":[{"post_title":"Lydia Selimalhigazi","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/lydia-selimalhigazi\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/lydhia-150x150.png","header":"Senior Interactive Designer @Clue","speaker_id":"824","bio":"<p><span data-sheets-value=\"[null,2,&quot;I am a creative designer with over 8 years of experience. After my Master (+5) in Visual Communication I worked both as freelancer and full-time employee in and with various agencies, startups as well as independent publishing houses, industries and brands, associations, and cultural institutions. \\n\\nOver the past years I have worked as a User Interface designer, specialising myself on app design and developing an extensive knowledge of the design patterns and standards that underlie each platform (iOS, Android and Windows). I also have a significant experience in print design (corporate, culture, publishing, annual reports) and Illustration. I'm very enthusiastic about Material design and the challenges Android offers UX\/UI wise and I consider each day as an opportunity to learn something new and be a better designer.\\n\\nhttps:\/\/dribbble.com\/lyslydia&quot;]\" data-sheets-userformat=\"[null,null,8320,null,null,null,null,null,null,null,0,null,null,null,null,null,8]\">I am a creative designer with over 8 years of experience. After my Master (+5) in Visual Communication I worked both as freelancer and full-time employee in and with various agencies, startups as well as independent publishing houses, industries and brands, associations, and cultural institutions.<\/p>\n<p>Over the past years I have worked as a User Interface designer, specialising myself on app design and developing an extensive knowledge of the design patterns and standards that underlie each platform (iOS, Android and Windows). I also have a significant experience in print design (corporate, culture, publishing, annual reports) and Illustration. I&#8217;m very enthusiastic about Material design and the challenges Android offers UX\/UI wise and I consider each day as an opportunity to learn something new and be a better designer.<\/p>\n<p>https:\/\/dribbble.com\/lyslydia<\/span><\/p>"}],"content":"<p>UI CHALLENGES<\/p>\n<p>&#8212;&gt; Digital vs Print<br \/>\n&#8211; Statical design that will never change versus something that is dynamically changing based on user’s influence and device specific factors.<br \/>\n&#8211; Static VS user flow.<\/p>\n<p>&#8212;&gt; The case of Android: many devices and densities<br \/>\n&#8211; Fragmentation: a challenge that a designer cannot control but need to face in order to provide the best experience possible.<\/p>\n<p>THINK USER<\/p>\n<p>&#8212;&gt; Focus on the user and user flows instead of pixel perfect design.<br \/>\n&#8211; User-centered: the user is the most important thing.<br \/>\n&#8211; User will provide the interaction that will trigger the flows.<br \/>\n&#8211; App’s purpose is de facto given the user.<\/p>\n<p>HOW TO ACHIEVE THAT UI WISE?<\/p>\n<p>&#8212;&gt; Anticipate the user actions and provide a smooth experience: know and use native Android patterns<br \/>\n&#8211; Use Animations to provide guides towards actions.<br \/>\n&#8211; Don’t be afraid to experiment.<br \/>\n&#8211; Provide the user with something he’s already familiar with (native patterns).<br \/>\n&#8211; User should be naturally able to navigate through the app and reach his goal.<\/p>\n<p>&#8212;&gt; Material Design looks good, let me tell you why<br \/>\n&#8211; It has been developed to work everywhere, it’s an adaptive design.<br \/>\n&#8211; Since it is using beautiful semi-flat style, it gives you the power to easily create a hierarchy for the content and guide the user.<br \/>\n&#8211; Easy to understand.<\/p>\n<p>&#8212;&gt; Guide the user: hierarchy of the content matters<br \/>\n&#8211; User should not think where the next call to action is, it shall be there in front of him.<\/p>\n<p>&#8212;&gt;Think adaptive and define breakpoints to ensure your design is flexible<br \/>\n&#8211; There is no pixel perfect design.<br \/>\n&#8211; The design will evolve from one screen to the other and through the experience, because it is interactive.<br \/>\n&#8211; The designer needs to define k screens, the breakpoints of the design and he should imagine how the design will evolve in between, keeping in mind that it shall always keep the level of visual quality and experience he designed on the k screens.<br \/>\n&#8211; The designer will never be able to test the design on all the screens and conditions, so he should rather focus on the best solution for most of the screens than pixel perfect solution that will work only in one case.<\/p>\n<p>THE IMPLEMENTATION CHALLENGE<\/p>\n<p>&#8212;&gt; Let’s discuss feasibility and nativeness first<br \/>\n&#8211; Having a talk with a developer when you are brainstorming can help you understand the challenge and define the best way to deal with the UX\/UI.<\/p>\n<p>&#8212;&gt; Developer vs designer: what we can learn from each other.<br \/>\n&#8211; Developers and designers not always speak the same language and they focus on different things: talking together can help both to build up a better product, find better solutions and lead to a smoother process.<\/p>\n<p>&#8212;&gt; Team work and communication are always better than guidelines.<br \/>\n&#8211; Guidelines are still needed though, not all developers are nice.<br \/>\n&#8211; Sitting together and use a pair-programming-alike style will help you both in creating something nice and cleaner: from the developer point of view, he will be somehow forced to extract correctly the values and refactor his layouts to make them more flexible. On designer’s side, it will give a runtime overlook on his design.<br \/>\n&#8211; Working together will help you being more involved in the product and with that you will gain ownership over the product.<\/p>\n<p>&#8212;&gt; Why sanity check matters.<br \/>\n&#8211; Because designers like to torture developers. <img src=\"http:\/\/it.droidcon.com\/2015\/wp-includes\/images\/smilies\/icon_wink.gif\" alt=\";-)\" class=\"wp-smiley\" \/><br \/>\n&#8211; It’s the perfect time to recap all the design (you both might have been focused more on details than on general look) and further improve the process: the more you work together, the faster you will get in achieving the results.<\/p>\n<p>CONCLUSION<\/p>\n<p>&#8212;&gt; There is no pixel perfect design on Android.<\/p>\n<p>&#8212;&gt; If you focus on the user, think adaptive design and work as a team, your app will be way better.<\/p>\n"},{"post_title":"Why Android first?","url":"http:\/\/it.droidcon.com\/2015\/sessions\/android-first\/","time":"14:00","end_time":"14:40","date":"10 April 2015","location":"Sala Lisbona","color":"","track":["Design","layout optimization","UX"],"speakers":[{"post_title":"Luca Troisi","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/guido-guaschino\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/n1224802505_522389_1746-150x150.jpg","header":"Creative Director @ Enhancers","speaker_id":"820","bio":"<p>Founder, Creative Director, Head of Design.  I&#8217;m a design enthusiast that literally lives for creating the best customer experience possible. I help companies and organizations to create brand new meanings for their customers. In the last few years I helped medium and large companies, such as Azimut Yachts, Samsung, Logitech, Vodafone to innovate through a Human Centered Approach.<\/p>"},{"post_title":"","featured":"","url":false,"post_image":null,"header":"","speaker_id":"1190","bio":""}],"content":"<p>Designing for multiplatform is a nightmare. Even if the three main OS speak almost the same language, they actually speak three different lingos.<br \/>\nEnhancers will showcase an optimal workflow &#8211; starting with Android Material &#8211; to minimize effort and variations, keeping the user experience (UX) great along all platforms.<\/p>\n"},{"post_title":"Working in an effective team","url":"http:\/\/it.droidcon.com\/2015\/sessions\/working-in-an-effective-team\/","time":"14:00","end_time":"14:40","date":"10 April 2015","location":"Sala Istanbul","color":"","track":["Agile","Kanban","Scrum","Tdd","Xp"],"speakers":[{"post_title":"Filip Maelbrancke","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/filip-maelbrancke\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/2601a1b-150x150.jpg","header":"Consultant at AppFoundry","speaker_id":"817","bio":"<p>Filip Maelbrancke is a software consultant at AppFoundry in Belgium. He mainly works on Android projects in the financial services, telecom and media sectors as a developer and tech lead.<\/p>"}],"content":"<p>&#8220;Most of us know about agile practices such as Scrum or Kanban, we have heard about and\/or practice continuous integration and maybe even continuous delivery. We dream of TDD, BDD, XP and other buzzwords. But how do you put these in practice? How do you get your team to be an effective team? How do you get those dreams to not turn out as nightmares?<\/p>\n<p>That is what we were asking ourselves when we started a new multi platform project at VRT a few years ago (Vlaamse Radio en Televise or for you non-dutch speaking attendees: Flemish Radio and Television). How would we apply this on our native clients? How do you do these things on Android and iOS? How do you manage your backends in conjunction with these frontend platforms?<\/p>\n<p>In this talk we&#8217;ll tell you the story of our quest to become an effective team.&#8221;<\/p>\n"},{"post_title":"RxFy All The Things!","url":"http:\/\/it.droidcon.com\/2015\/sessions\/rxfy-all-the-things\/","time":"14:50","end_time":"15:30","date":"10 April 2015","location":"Sala Lisbona","color":"","track":["Development","Functional","rxjava"],"speakers":[{"post_title":"Benjamin Augustin","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/benjamin-augustin\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/benjamin-augustin-150x150.jpeg","header":"Android Software Craftsman at Novoda","speaker_id":"842","bio":"<p>Cesar Valiente is currently working at 6Wunderkinder (in Berlin), the makers of Wunderlist, the famous and awarded multi platform productivity app, as Android Engineer.<\/p>\n<p>Previously, he worked in Amsterdam (Netherlands) and Madrid (Spain) in some relevant big companies and startups\/agencies.<\/p>\n<p>He considers himself a community guy, he is co-founder of AndroidStartup, which is the most important and largest Android developer community located in Madrid, and he’s also an Open Source advocate, trying to spread the great benefits of open source software whenever he can.<\/p>"}],"content":"<p>Ever had to deal with terribly designed API or spent hours re-factoring your code to deal with an updated API?<br \/>\nYou&#8217;ve heard about RxJava but can&#8217;t see how it could benefit your project?<br \/>\nThis talk will take the practical approach of a complex API to explain how RxJava and Functional Reactive Programming (FRP) can be used on every project to make your life easier.<br \/>\nThis talk takes a practical approach to explain RxJava concepts and the advantages it has on a developper day to day life.<br \/>\nThe main idea of this talk is to give an overview on how using RxJava we can ease refactoring, dealing with additional constraints and overall help maintaining a growing project.<\/p>\n<p>You can find the slides from droidcon paris 2014 online at https:\/\/speakerdeck.com\/dorvaryn\/rxfy-all-the-things<\/p>\n<p>It might change a bit but overall it should remain similar to this.<\/p>\n"},{"post_title":"Fit4Dev – Case Study","url":"http:\/\/it.droidcon.com\/2015\/sessions\/fit4dev-case-study\/","time":"14:50","end_time":"15:30","date":"10 April 2015","location":"Sala Istanbul","color":"","track":["Development","Wearable"],"speakers":[{"post_title":"Nicola Policoro","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/nicola-policoro\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/nicola_policoro-150x150.jpg","header":"GDG Bari-Zerodo","speaker_id":"830","bio":"<p>I&#8217;m a DIY guru. I love playing with Lego Mindstorm, knowledge representation, recommendation systems and soft computing. I started to play with all this stuff​ &#8216;a long time ago​ in a galaxy far, far away&#8230;&#8217; when I worked at the​ Department of Computer Science, in Bari. After that​ experience, I worked in a team of computer engineers, involved in business intelligence projects, open data, data flow optimization and Cloud Computing. Now I&#8217;m the​ designer and co-founder of Zerodo&#8217;s team. I love using rapid prototyping, agile software development and all the methods and technologies to design and build new fabulous tools and applications.<\/p>"},{"post_title":"Marco Rinaldi","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/marco-rinaldi\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/20141121_1310471-150x150.jpg","header":"Freelance Android &amp; Web Developer, Member @ GDG Bari","speaker_id":"1100","bio":"<p>Marco is an Android developer and GDG member based in Bari. Works as Android and Web Developer for Zerodo where he uses his android-abracadabras to make enterprise software users more productive.<\/p>"}],"content":"<p>Developers&#8217; life is quite sedentary and waterless, as when they work, they go into wormholes and forget to drink water and take proper exercises. With this app we try to take them back into real life.<\/p>\n<p>Thanks to this app we&#8217;ll show the approach to design and develop a wearable application.<\/p>\n"},{"post_title":"Lessons from Material Design on cross-channel digital experiences","url":"http:\/\/it.droidcon.com\/2015\/sessions\/material-design-on-cross-channel\/","time":"14:50","end_time":"15:30","date":"10 April 2015","location":"Sala Madrid","color":"","track":["Interaction","material design","UX"],"speakers":[{"post_title":"Italo Marconi","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/italo-marconi\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/italo-150x150.jpg","header":"Strategist + Information Architect + Digital Humanist at UbiquityLab","speaker_id":"821","bio":"<p>PhD in Social Sciences and Master&#8217;s degree in Multimedia Content Design, I am Managing Director of UbiquityLab and I am in charge of the Department of Digital Strategy and Design. I also teach Digital Marketing and Communication at Polimoda.<\/p>"},{"post_title":"Julie Blitzer","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/julie-blitzer\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/03\/1c18681-150x150.jpg","header":"User Experience Designer at UbiquityLab","speaker_id":"1412","bio":"<p>UX Designer and strategist. New Yorker who moved to Milan, Italy in August 2013 to obtain a Master in Interaction Design at Domus Academy. Worked with startups, e-commerce, fashion, advertising, law, education, non-profit and government.<\/p>"},{"post_title":"Andrea Todon","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/andrea-todon\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/03\/045da50-150x150.jpg","header":"Interaction designer @ Ubiquitylab","speaker_id":"1414","bio":"<p>As an interaction designer with strong background in visual design and front-end development I&#8217;m able to to manage the design process from the big picture to the little micro-interactions.<\/p>\n<p>In my professional experience in cultural heritage, multimedia consumer products and online magazines fields I had the opportunity to work on large-traffic multichannel websites, mobile apps (both web-based and native), productivity web-based software, interactive tables for learning, museum’s interactive exhibits, interfaces for televisions and camcorders, usability and accessibility evaluation of institutional websites.<\/p>"}],"content":"<p><em>&#8220;Develop a single underlying system that allows for a unified experience across platforms and device sizes. Mobile precepts are fundamental, but touch, voice, mouse, and keyboard are all ﬁrst-class input methods.&#8221;<\/em><\/p>\n<p>Google&#8217;s Material Design gives clear, concise instructions on how to design digital experiences that follow their principles, patterns and goals. UbiquityLab&#8217;s UX and Android development experts will show how these lessons can be applied to the design of Android-based digital services that are cross-channel, that is, designed to work across various devices and contexts.<\/p>\n"},{"post_title":"Framing the Canvas","url":"http:\/\/it.droidcon.com\/2015\/sessions\/framing-the-canvas\/","time":"14:50","end_time":"15:30","date":"10 April 2015","location":"Sala Londra","color":"","track":["Canvas","Development","Graphics"],"speakers":[{"post_title":"Sebastiano Poggi","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/sebastiano-poggi\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Sebastiano-Poggi-150x150.jpeg","header":"Android Software Craftsman at Novoda &#038; GDE ","speaker_id":"797","bio":"<p>A self-taught and strong OSS believer who loves beautiful and simple UX and UI, where “less is more”, Sebastiano spends a big chunk of his spare time reading and writing about Android development. He also creates and maintains some FOSS apps and libraries, that span from the fun, smaller projects to the more serious (and, perhaps, useful) work.<\/p>\n<p>Sebastiano worked some time in AKQA as a Senior Software Engineer. Before moving to London, he also worked at i’m Spa (an Italian smartwatch startup) for two years, playing with the Android platform and handling their Developer Relations. He’s been toying with the Android SDK since 2010.<\/p>"}],"content":"<p>In his talk, Sebastiano will guide you through a topic that is often ignored: the Canvas API. Even if there’s only scarce documentation for it, the Canvas API is at the heart of everything that shows a UI on Android. You’ll need to tame this powerful and mysterious creature if you want to create great custom views and brilliant, lightweight UIs for your apps.<\/p>\n<p>What is a Canvas? How do you Paint? Can you draw Paths? What is Skia, and who invited it anyway? What actually happens during a drawing pass? What are Shaders? What are Filters? Is it true that text is basically impossible to measure correctly? What shape does a Shape have if noone’s painting it? These are some of the questions which will be answered during the session. Or not. But the point is, after this session, you&#8217;ll want to know and be able to find out!<\/p>\n<p>Connect the dots in the spotty documentation the Android team has assembled, and become a true pixel pusher!<\/p>\n"},{"post_title":"Developing UX is your job!","url":"http:\/\/it.droidcon.com\/2015\/sessions\/developing-ux-is-your-job\/","time":"15:40","end_time":"16:20","date":"10 April 2015","location":"Sala Istanbul","color":"","track":["UI","UX","UX\/UI Design"],"speakers":[{"post_title":"Roberto Orgiu","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/roberto-orgiu\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/roberto-orgiu-150x150.png","header":"Android Specialist @ DeltaTre","speaker_id":"864","bio":"<p>Android developer and enthusiastic, DroidCon and community fan, I love the Android environment and pushing the limits of the platform.<\/p>"}],"content":"<p>Many people think UI and UX are the same thing, but they are not! UI is a subset of UX and this talk is about what we can do, as developers, to enhance user experience in our apps.<\/p>\n"},{"post_title":"Android development: from an idea to your first (tested) app","url":"http:\/\/it.droidcon.com\/2015\/sessions\/android-development-from-an-idea-to-your-first-tested-app\/","time":"15:40","end_time":"16:20","date":"10 April 2015","location":"Sala Madrid","color":"","track":["Continuous integration","Development","Gradle","Testing"],"speakers":[{"post_title":"Chiara Chiappini","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/chiara-chiappini\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/d1c5616bfec257a224b86cb47985d82e-150x150.png","header":"Agile software developer @ eBay","speaker_id":"875","bio":"<p><span data-sheets-value=\"[null,2,&quot;With a degree on Software Engineering from University of Bologna, I have been working for the past 5 years as a Software developer. After moving to London 3 years ago and meeting excellent developers, I became passionate on TDD, Agile and clean code principles. Even if my primary coding languages are Java and Javascript, I constantly challenge myself learning new languages: at the moment I am enjoying learning Android.&quot;]\" data-sheets-userformat=\"[null,null,8320,null,null,null,null,null,null,null,2,null,null,null,null,null,10]\">With a degree on Software Engineering from University of Bologna, I have been working for the past 5 years as a Software developer. After moving to London 3 years ago and meeting excellent developers, I became passionate on TDD, Agile and clean code principles. Even if my primary coding languages are Java and Javascript, I constantly challenge myself learning new languages: at the moment I am enjoying learning Android.<\/span><\/p>"}],"content":"<p>This presentation reviews the process of starting with Android development with a focus on testing.<br \/>\nWhen starting with Android development, you can find tons of resources to help you to start your first app. When it comes to testing, there are a lot of questions you will ask yourself:<br \/>\n-which test libraries are around<br \/>\n-how to build a Continuous integration environment<\/p>\n<p>During this talk, I will walk you through steps to start to write tests while developing your first Android app. I will introduce some test libraries, like the Android testing framework and Selendroid.<\/p>\n<p>When it comes to Continuous Integration, there are a lot of tutorials around, but they never cover the entire space from unit tests to acceptance tests. During this talk, I will show you how I setup a Jenkins CI environment at eBay that is repeatable using Chef.<br \/>\nYou will learn how to run unit and functional tests using the Android Emulator Jenkins plugin and Gradle. I will also go over some of the problems I encountered like a bug from the Android Emulator plugin and how I overcame them.<\/p>\n<p>Key takeaways:<br \/>\n&#8211; how to choose a testing library for your first Android app<br \/>\n&#8211; how to setup a CI to run your tests<\/p>\n"},{"post_title":"(Un)Security Guidelines","url":"http:\/\/it.droidcon.com\/2015\/sessions\/unsecurity-guidelines\/","time":"15:40","end_time":"16:20","date":"10 April 2015","location":"Sala Lisbona","color":"","track":["Best practice","Security"],"speakers":[{"post_title":"Paolo Stagno","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/paolo-stagno\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/AAEAAQAAAAAAAAHNAAAAJDUzMTQxNDliLTc1ZjUtNGM0MC1hYzcyLWIzNDZkYWI1NGVmMQ-150x150.jpg","header":"CEO &#038; Founder (Cyber Security Analyst) at VoidSec","speaker_id":"832","bio":"<p>Paolo Stagno, aka VoidSec, is a Cyber Security Analyst for iDialoghi, an Italian security firm based in Milan. He’s consultant specialized in Penetration Test, Vulnerability Assessment, Information Security, Technology Risk, Network and Application Security for a wide range of clients across top tier international bank, major companies and industries.<br \/>\nHe is attending as speaker for various international conferences, like: DEFCON, BlackHat.<br \/>\nHe is also the leader and founder of VoidSec.com<\/p>"},{"post_title":"Luca Poletti","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/luca-poletti\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/luca-150x150.png","header":"Developer at Voidsec","speaker_id":"1101","bio":"<p>Mi definirei un appassionato di Matematica, ambito della teoria dei numeri e interessi per la teoria dei gruppi, con un ottimo spirito analitico e una buona capacità di astrazione logica. Studente al primo anno del corso Magistrale di Ingegneria Matematica presso il Politecnico di Torino, diplomato presso il liceo scientifico Cattaneo, da sempre ho puntato a orientare i miei studi e interessi verso aspetti algoritmici e matematici.<\/p>"}],"content":"<p>Cosa fare, ma soprattutto, cosa non fare durante il ciclo di sviluppo di un&#8217;applicazione Android.<br \/>\nIn questo talk mostreremo quali sono le possibili problematiche e i vettori di attacco nello scenario<br \/>\nAndroid, dimostrando con esempi pratici le pratiche da utilizzare e in particolare quelle da evitere.<\/p>\n<p>Le macro tematiche affronatate durante il corso del talk saranno:<br \/>\nInsecure Storage (SqlLite, Shared Preferences, Internal\/External Storage, Cookie e Token)<br \/>\nAPI (Backened, Sql Injection, XSS, CSRF, User Enumeration)<br \/>\nConnessioni sicure e Crittografia (SSL, Certificati, MitM, Implementazioni proprie)<br \/>\nProtezione del codice (Offuscamento, Reversing)<br \/>\nLog (Data Leak)<\/p>\n<p>Il talk è orientato agli sviluppatori esperti e non, perchè chiunque si trovi a sviluppare e a gestire i dati degli utenti dovrebbe essere in grado di proteggere queste inforamzioni.<br \/>\nBest practice e linee guida per uno sviluppo sicuro e responsabile.<\/p>\n"},{"post_title":"Monetizing Free-to-Play: Making the Most of In-App Purchases and Ads","url":"http:\/\/it.droidcon.com\/2015\/sessions\/monetizing-free-to-play-making-the-most-of-in-app-purchases-and-ads\/","time":"15:40","end_time":"16:20","date":"10 April 2015","location":"Sala Londra","color":"","track":["Monetization"],"speakers":[{"post_title":"Cüneyt Ünar","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/cuneyt\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/AAEAAQAAAAAAAACyAAAAJDI0Yjg4OGU3LTRhNmQtNDFiNi1iZDVlLTAzYzc0ZDk2NDE2Mg-150x150.jpg","header":"Strategy Manager at Google","speaker_id":"816","bio":"<p>Cüneyt Ünar has been working for Google for four years now and focusing on the growth of mobile app ecosystem as well improving their life-cycle with Google solutions. He has a keen interest to develop AdMob as a product in a way to make it the smartest mobile ad network. Prior to Google, Cüneyt worked on the strategic planning of Mobile Telecommunications.<\/p>"}],"content":"<p>In-app purchases (IAP) comprise a large share of in-game revenue today and are driven by paying power users (a.k.a ‘whales’), which typically make up less than five percent of the total user base. Ads can supplement monetization for the remaining ninety-five percent of non-paying users, and also reinforce your IAP revenue. How to show the right message to the right user at the right time? How to take advantage of the ads opportunity across platforms and screens? Come join the discussion on how to leverage Google&#8217;s ad technology and services. Unlock new revenue streams and boost your business, while letting your users monetize at their own pace!<\/p>\n"},{"post_title":"Android Lollipop for enterprise","url":"http:\/\/it.droidcon.com\/2015\/sessions\/android-lollipop-for-enterprise\/","time":"16:40","end_time":"17:20","date":"10 April 2015","location":"Sala Lisbona","color":"","track":["B2B","Development","Enterprise","Lollipop","Security"],"speakers":[{"post_title":"Roberto Gassirà","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/roberto-gassira\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Foto-RG-150x150.jpg","header":"Senior Security Analyst at Consulthink S.p.A.","speaker_id":"834","bio":"<p>Senior security analyst and Android mobile developer for the Mobile Security Lab of Consulthink S.p.A., Roberto Gassirà is specialized in Information Security with an indepth focus on the Mobile World. He works on reverse engineering, vulnerability assessment and secure development of Android applications.<br \/>\nHe has spoken at international conferences such as Blackhat, DeepSec and DroidCon.<\/p>"},{"post_title":"Roberto Piccirillo","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/roberto-piccirillo\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/piccirillo-150x150.jpg","header":"Senior Security Analyst @ Consulthink S.p.A.","speaker_id":"1102","bio":"<p>Roberto Piccirillo is currently working as a Senior Security Analyst for Mobile Security Lab of Consulthink S.p.A.. He graduated in Computer Science and specialises in Information Security. He deals mainly with Mobile Applications, Protocol Security and vulnerability assessment on Web and Mobile applications but he works also on reverse engineering and on secure development of Android applications. He partecipated as speaker at Security Conferences such as BlackHat, DeepSec and Droidcon UK 2014<\/p>"}],"content":"<p>With the latest major release of the Android OS, codenamed “Lollipop”, Google is playing its best cards to enter the enterprise market. Android 5.0 Lollipop has introduced new features, security enhancement and upgraded API for device management; it can now be considered a mature operating system to be used in critical environment and a potential major player in the enterprise world. The talk will explore new features such as the &#8220;kill switch&#8221; factory reset, the smart lock functionality and other innovative security features and improvements. The session will end with a deep technical discussion on the device management extensions offered by Android; it will focus on the new &#8220;managed profile&#8221; feature for “containerization technology”, based on the integration of Samsung‘s KNOX platform, which offers the ability to run enterprise applications in a secure protected environment and to keep the working and personal spaces independent from each other.<\/p>\n"},{"post_title":"Android BaaS hands-on","url":"http:\/\/it.droidcon.com\/2015\/sessions\/android-baas-hands-on\/","time":"16:40","end_time":"17:20","date":"10 April 2015","location":"Sala Istanbul","color":"","track":["Baas","Development"],"speakers":[{"post_title":"Giulio Roggero","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/giulio-roggero\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/giulio-roggero-150x150.jpeg","header":"CTO at MakeItApp.eu","speaker_id":"848","bio":"<p>Giulio Roggero sviluppa in node.js la parte server delle App lavorando a stretto contatto con gli sviluppatori mobile per creare App di successo. E&#8217; co-fondatore e CTO di MakeItApp.eu, un social network dove le persone creano App in modo collaborativo e CEO di AgileReloaded.it, l&#8217;azienda italiana per il coaching agile.<\/p>\n<p>Federico Oldrini e Jacopo Giola sono responsabili dell&#8217;evoluzione degli SDK Android e iOS che semplificano la vita ai team di MakeItApp.eu.<\/p>"},{"post_title":"Federico Oldrini","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/federico-oldrini\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/31977d2e11ad94804149fa904c60af12-150x150.jpg","header":"Lead Android Developer @ MakeItApp.eu","speaker_id":"1105","bio":"<p>I have been working on Android utilities and games projects for the last 4 years, making of my biggest\/greatest hobby my job.<br \/>\nSince October 2014 I&#8217;m the lead Android Developer at MakeItApp.eu<\/p>"},{"post_title":"Jacopo Andrea Giola","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/jacopo-giola\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/10153943_10203741844456111_8428734019882073875_n-e1425310222615-150x150.jpg","header":"Lead iOS Developer @ MakeItApp.eu","speaker_id":"1106","bio":"<p>I&#8217;m an iOS developer since 2012. After graduating in Computer Science at the Università Statale di Milano,<br \/>\nI worked both on B2B and B2C applications for iOS spanning from utilities to games.<br \/>\nSince December 2014 I&#8217;m the lead iOS developer at MakeItApp.eu and started to work on the iOS SDK for our social publishing platform.<\/p>"}],"content":"<p>Dal 2011 i Backend as a Service (BaaS) stanno rivoluzionando il modo in cui le App dialogano con i server.<\/p>\n<p>Grazie alla loro semplicià e flessibilià è possibile disegnare ed implementare un’App con dati distribuiti in rete senza scrivere una linea di codice lato server.<\/p>\n<p>In 45 minuti mostreremo come sviluppare una chat con tanto di file sharing grazie ai servizi offerti dal BaaS quali data storage, file storage, user management e push notifications.<\/p>\n<p>Alla fine del talk distribuiremo l’App e raccoglieremo i pareri con la nuova chat costruita insieme!<\/p>\n"},{"post_title":"Layout Traversals on Android","url":"http:\/\/it.droidcon.com\/2015\/sessions\/layout-traversals-android\/","time":"16:40","end_time":"17:20","date":"10 April 2015","location":"Sala Londra","color":"","track":["Design","layout optimization","UI"],"speakers":[{"post_title":"Lucas Rocha","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/lucas-rocha\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/rocha-150x150.jpg","header":"Software Engineer @ Facebook","speaker_id":"805","bio":"<p>UI engineer hacking on Android at Facebook. Creator of some cool open source libraries for Android.<\/p>\n<p>Formerly, I was at Mozilla working on Firefox for Android, one of the highest-rated mobile browsers for Android. And before that, I worked at litl on the development of the webbook, a cloud-based computer for the family, and at Nokia implementing the system UI for the Maemo-based internet tablets, such as the N810.<\/p>\n<p>I&#8217;m mostly focused on Android development at the moment. I’m the creator of Pattrn, an unique wallpaper app with over a million downloads that has been featured on Google Play multiple times; and some cool Android libraries such as TwoWayView, Smoothie, dspec, and Probe.<\/p>\n<p>I’ve been a core GNOME contributor in the past where I have taken several leadership roles such as GNOME Foundation director, Release Team member, and software maintainer.<\/p>"}],"content":"<p>Understanding how a UI framework behaves under the hood is key if you want to push the boundaries of the platform and write solid UI code. Layout traversals are at the heart of Android&#8217;s UI toolkit. What happens behind the scenes in requestLayout() call? What kind of layout optimizations Android implements? In this talk, we&#8217;ll go through some of the key steps that the Android UI framework takes to display your UI on the screen, from a layout perspective.<\/p>\n"},{"post_title":"Intel I.N.D.E. (Integrated Native Development Environment)","url":"http:\/\/it.droidcon.com\/2015\/sessions\/intel-i-n-d-e-independent-native-development-environment\/","time":"16:40","end_time":"17:20","date":"10 April 2015","location":"Sala Madrid","color":"","track":["Development","html5","I.N.D.E.","XDH"],"speakers":[{"post_title":"Francesco Baldassarri","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/francesco-baldassarri\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/03\/399-150x150.jpg","header":"Italian Community Manager @ Intel Corporation","speaker_id":"1478","bio":"<p>Francesco Baldassarri dal 2011 ricopre l&#8217;incarico di Community Manager per l&#8217;Italia all&#8217;interno del Software and Services Group (SSG) di Intel Corporation. Nello specifico opera per la Developer Relations Division (DRD) e le responsabilità del suo ruolo prevedono di gestire tutte le relazioni con gli sviluppatori software che siano essi maker, hobbisti, studenti, piccoli o grandi professionisti, o semplicemente “entusiasti”, supportando le loro idee, le loro attività e i loro progetti. Per fare questo organizza numerose attività ed eventi community.<\/p>"}],"content":"<p>Intel offre un set completo di strumenti di progettazione, codifica e debug per software scritto in codice nativo destinato ai dispositivi mobili, smartphone e tablet, basati su sistema operativo Android. Scoprite i sorprendenti vantaggi nello sviluppare applicazioni per Android con Intel Hardware Accelerated Execution Manager o con I.N.D.E.; tutti strumenti messi a disposizione sulla Developer Zone, la piattaforma Intel interamente dedicata allo sviluppo e all&#8217;ottimizzazione su architetture x86, e non solo.<br \/>\nInfine un accenno a XDK, framework per lo sviluppo HTML5, Javascript, Node.js di Intel: totalmente gratuito ed altamente versatile, per realizzare app e giochi multipiattaforma.<\/p>\n"},{"post_title":"Android Security and Ethical Hacking","url":"http:\/\/it.droidcon.com\/2015\/sessions\/android-security-ethical-hacking\/","time":"17:30","end_time":"18:10","date":"10 April 2015","location":"Sala Lisbona","color":"","track":["Security"],"speakers":[{"post_title":"Vito Rallo","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/vito-rallo\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/rallo-150x150.jpg","header":"Senior Manager in Security Consulting @ PwC","speaker_id":"874","bio":"<p>Vito works as Senior Manager in Security Consulting for PwC. He spent the last 8 years in the security field as a Senior Consultant and Leader for IBM. He performed in the CSAR global team (Cyber Security Assessment and Response) with focus on: Infrastructure, Web and Mobile Application Security Assessment. By growing his knowledge across the years and facing real life challenges, he became a recognized asset in Mobile Hacking.<\/p>\n<p>He has worked in IT for more than 17 years, started as a freelance consultant, developer, trainer, moved to Networking and finally landed into Security as product specialist and evangelist for IPS before embracing the challenge of ethical hacking.<\/p>\n<p>Vito is university graduated with a Master Degree in Computer Science (MSc) followed by a private Master in Networking for Enterprises and Carriers, former Certified IT Specialist, Cisco, GIAC\/SANS, EC-Council\/CEH certified.<\/p>\n<p>More references about the speaker below:<\/p>\n<p>Twitter: @vitorallo<br \/>\nPersonal security blog: restart-thinking.vitorallo.com<br \/>\nLinkedIn: www.vitorallo.com<\/p>"}],"content":"<p>Do you want to know more about pentest of Android applications and devices? Do you want to understand the role of an Ethical Hacker in the mobile security picture today? If yes, this talk is for you!<\/p>\n<p>The presentation introduces principles of ethical hacking and, in general, the role of a penetration tester to dive into the specific of hacking Android applications. Besides development best practices and methodologies to test apps, the speaker explains what to do in order to perform a Mobile Application Assessment (or Penetration Test) trying to emphasize what is more important and fun.<\/p>\n"},{"post_title":"Baasbox-To be defined","url":"http:\/\/it.droidcon.com\/2015\/sessions\/to-be-defined-8\/","time":"17:30","end_time":"18.10","date":"10 April 2015","location":"Sala Istanbul","color":"","track":["Baas","Development"],"speakers":[{"post_title":"Federico Pacilli","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/federico-pacilli\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/03\/3310540-150x150.jpg","header":"CEO at Baasbox","speaker_id":"1379","bio":"<p>During the development of a mobile app project I started BaasBox together with co-founder Claudio Tesoriero at the end of 2012. BAASBOX is now a venture-capital-backed company that operates in the software industry for mobile applications.<\/p>"}],"content":""},{"post_title":"Qt: Android and more","url":"http:\/\/it.droidcon.com\/2015\/sessions\/qt-android-and-more\/","time":"17:30","end_time":"18:10","date":"10 April 2015","location":"Sala Madrid","color":"","track":["Crossplatform","Development","Qt"],"speakers":[{"post_title":"Tam Hanna","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/tam-hanna\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/tamhanna-150x150.jpg","header":"CEO at Tamoggemon Holding k.s.","speaker_id":"838","bio":"<p>Having been in the mobile market since 2004, \/me has spoken at numerous conferences. In addition to that, \/me wrote a fair group of scientific books and stories for various German and English IT newspapers.<\/p>"}],"content":"<p>Developers working with Qt can use one code base to target multiple operating systems. Sadly, promise and reality diverge quite a bit. This talk starts out by looking at what Qt is, and then goes on to explain specifics on various platforms.<\/p>\n"},{"post_title":"Going from a good Android design to an awesome one.","url":"http:\/\/it.droidcon.com\/2015\/sessions\/going-from-a-good-android-design-to-an-awesome-one\/","time":"17:30","end_time":"18:10","date":"10 April 2015","location":"Sala Londra","color":"","track":["Best practice","UI","UX","UX\/UI Design"],"speakers":[{"post_title":"Wiebe Elsinga","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/wiebe-elsinga\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/Wiebe-Elsinga-150x150.jpeg","header":"Android GDE at GDG Dutch Android User Group","speaker_id":"802","bio":"<p>Besides being a Google Developer Expert for Android, I’m also an Android Developer with a passion for UX and design.<br \/>\nCo-Founder\/Organizer of the Google Developer Group Dutch Android User Group and working at Itude Mobile.<br \/>\nBasically a EntrepreNerd. Mainly focused on the design and development of mobile applications.<\/p>"}],"content":"<p>Making a well designed Android application is not enough anymore, it has to be awesome.<br \/>\nThis talk will show you how to change a good design to a awesome design so it will benefit your Android application.<\/p>\n"},{"post_title":"Chiusura","url":"http:\/\/it.droidcon.com\/2015\/sessions\/chiusura\/","time":"18:20","end_time":"18:40","date":"10 April 2015","location":"Sala Istanbul","color":"","track":[],"speakers":[],"content":""},{"post_title":"Building a magic box, cloud-based backend for your Android apps","url":"http:\/\/it.droidcon.com\/2015\/sessions\/building-a-magic-box-cloud-based-backend-for-your-android-apps\/","time":"09:50","end_time":"10:30","date":"10 April 2015","location":"Sala Istanbul","color":"","track":["Azure","Baas","Xamarin"],"speakers":[{"post_title":"Pietro Brambati","featured":"","url":"http:\/\/it.droidcon.com\/2015\/speakers\/brambati\/","post_image":"http:\/\/it.droidcon.com\/2015\/wp-content\/uploads\/2015\/02\/2881f45-150x150.jpg","header":"Pietro Brambati, Sr. Technical Evangelist@ Microsoft","speaker_id":"1061","bio":"<p>Pietro Brambati is a passionate developer ninja. He likes working with different kind of languages and framework, working on different size applications, scaling from mobile device apps to large, enterprise- ready applications. He has been working with Microsoft where he has the opportunity to work with developer and academic community. You can reach him at the main developer events and hackathon all around Italy.<\/p>"}],"content":"<p>In this session, we will explore a way to build a single backend for your Android app, that can also be used for iOS, Windows Phone, Windows, Xamarin and HTML\/JS apps using Azure Mobile Services, a magic box service, that seamlessly and easily allow you to have a database, a way to use different identity providers like Facebook, Twitter, Google and Microsoft account. In addition, it supports different push notification services via server-side JavaScript APIs that you can leverage in your solution!<\/p>\n"}],"strings":{"more_info":"More info"}}