{"sessions":[{"id":"17","title":"Coding for consoles","location":"Room 1","description":"Al Sutton will be demonstrating how to develop games for Ouya, the innovative games console that runs on Android; as he was Ouya’s Android Specialist and helped them improve both software and firmware, there’s no one better to explain how to use it!","subtype":"SESSION","startTimestamp":1382690700,"isLivestream":false,"presenterIds":["2"],"endTimestamp":1382693400},{"id":"24","title":"It's HOLO time!","location":"Room 2","description":"Find out how HOLO became the main design language of Android – and how it can transform your approach to creating apps!\r\n\r\nDespite Android becoming a major platform for mobile phones, no guidelines existed for designing homogeneous user experience across the entire platform – leading to companies re-using designs meant from other platforms, which lacked any Android-specific features. Fortunately, Google created HOLO, which quickly went mainstream as companies realised a proper Android design approach was essential.\r\n\r\nStephan will cover the emergence of HOLO, the impact it had on the design philosophy of Runtastic, and how it improved Runtastic’s apps, as well as demonstrating how Runtastic’s designers create clean and easy mock-ups that inspire the rest of the team. Finally, you’ll learn how HOLO influenced Runtastic app design on other platforms – a valuable piece of information if you’re looking to expand!\r\n\r\nIf you want to learn how to create top-quality, easy-to-use apps by putting skeuomorphism on the shelf and using clean design elements, this is the ideal presentation for you!","subtype":"SESSION","startTimestamp":1382690700,"isLivestream":false,"presenterIds":["23"],"endTimestamp":1382693400},{"id":"26","title":"Fist of Awesome","location":"Room 1","description":"Nicoll Hunt’s indie game project Fist of Awesome smashed through its Kickstarter funding targets in just 14 days, after a flurry of word of mouth and media attention – find out what that was like at Nicoll’s talk! He’ll demo his progress, talk about what it’s like to run a Kickstarter project, the challenges of developing a game simultaneously on Android and iOS, his involvement in the new OUYA Android-based TV console and why he went full circle from working for big companies back to bedroom coding. If you’re thinking of going solo, starting a Kickstarter project, or just want to be a success in indie gaming, this is the place to be!","subtype":"SESSION","startTimestamp":1382693400,"isLivestream":false,"presenterIds":["25"],"endTimestamp":1382696100},{"id":"33","title":"Responsive design for Android","location":"Room 2","description":"With the expansion in different Android devices, it’s no longer enough to design Android apps for just phone and tablet forms: apps on Android need to scale to a continuum of screen sizes, not just two. Web apps have faced the same issue for years and are now designed to be responsive, meaning that they adapt intelligently to any screen size. All the best Android apps follow the same principles, and combined with Android’s powerful tools, apps can be built to support any device – find out how to get yours up to scratch!","subtype":"SESSION","startTimestamp":1382693400,"isLivestream":false,"presenterIds":["32"],"endTimestamp":1382696100},{"id":"35","title":"Case Studies in Android design","location":"Room 2","description":"Join Jamie McDonald for a  tour of Android’s design landscape, including patterns, tips, techniques and tools, grounded in real world examples. Come and find out how to build apps that stand out by crafting interfaces that are simple, beautiful and usable!","subtype":"SESSION","startTimestamp":1382697000,"isLivestream":false,"presenterIds":["34"],"endTimestamp":1382699700},{"id":"28","title":"Designing freemium games for the Mobile play pattern","location":"Room 1","description":"Mobile games are different from traditional console games. Players don’t dedicate so much time or mind-space to playing games on their phone as they do when they sit down for a console or PC game play session. Game developers for mobile devices must learn how to satisfy this new kind of gamer and even take advantage of the evolution in play patterns to create new and innovative styles of game. Jason Avent has directed games on both console and mobile platforms and so is ideally placed to observe the differences. He has demonstrated that console teams can successfully move to mobile with the breakout hit, CSR Racing.","subtype":"SESSION","startTimestamp":1382697000,"isLivestream":false,"presenterIds":["27"],"endTimestamp":1382699700},{"id":"37","title":"Android Animations","location":"Room 2","description":"Join Mark Allison to learn about the animation APIs available within Android, and how you can add polish to your apps to make them stand out from the crowd!","subtype":"SESSION","startTimestamp":1382699700,"isLivestream":false,"presenterIds":["36"],"endTimestamp":1382702400},{"id":"29","title":"Open Mic - Gaming problems and solutions, share your experiences!","location":"Room 1","description":"An open mic session for people to raise problems they've had writing games on Android and for others to offer up solutions. If something grabs your interest then you've got a chance to carry on your discussion over lunch.","subtype":"SESSION","startTimestamp":1382699700,"isLivestream":false,"presenterIds":["2"],"endTimestamp":1382702400},{"id":"31","title":"3D on Android: Open Source Workflow","location":"Room 1","description":"This talk will be about the process of creating 3D content for Android using a number of open source tools: Blender to create 3D content, Gimp to create textures and Rajawali to bring it to life using the Android SDK. Rajawali is a 3D framework for Android based on OpenGL ES 2.0 and written in pure Java. It abstracts all the complicated OpenGL bits. This presentation will also benefit people who are unfamiliar with 3D. I will be going over the basics and I will also cover optimisation, common techniques used in 3D, animation and interaction.","subtype":"SESSION","startTimestamp":1382708700,"isLivestream":false,"presenterIds":["30"],"endTimestamp":1382711400}]}