{"sessions":[{"id":"109","title":"AIDE – develop for Android on Android","location":"2","description":"We are the makers of the popular app AIDE – Android IDE, an integrated development environment for Android that runs on Android devices: www.android-ide.com.\r\n\r\nIn this presentation we will show how developers can use AIDE to develop a fully functional Android app using only their Android device. We will also show how AIDE makes it easy for developers to switch back and forth between a PC dev environment (Android Studio or Eclipse) and AIDE for on-the-go development. Finally, we will give technical insights about the making of AIDE, and show how we solved the technical challenges to get a complete scalable Android toolchain working on Android itself.","subtype":"SESSION","startTimestamp":1382604300,"webLink":"http://uk.droidcon.com/2013/sessions/aide-develop-for-android-on-android/","presenterIds":["107","108"],"endTimestamp":1382606700},{"id":"115","title":"Android Based Dongles and Wearable Accessories","location":"4","description":"New packaging configurations are appearing that use the Android OS that are more correctly called accessories or APPcessories. Some of these small, wearable and video dongles actually have accessories associated with them (e.g. sensors). These innovations are being driven by compelling use cases within market sectors (healthcare, video distribution, education, maintenance, logistics, public services, fitness/wellness/sports to name but a few).\r\n\r\nThis presentation is a look at a few of the new applications for very small Android based platforms, focusing on use cases and associated business propositions, and why Android is the platform of choice. If you’ve got an idea for an Android accessory, don’t miss this talk!\r\n","subtype":"SESSION","startTimestamp":1382604300,"webLink":"http://uk.droidcon.com/2013/sessions/android-based-dongles-and-wearable-accessories/","presenterIds":["114"],"endTimestamp":1382606700},{"id":"113","title":"Customize your Views","location":"6","description":"Tired of writing multiple layout.xmls for different screen densities? There are alternatives.\r\n\r\nYou’ll learn how customizing Views can help easing development of responsive apps. Gain knowledge on when and how to write custom views. Learn how to get rid of includes, merges, code duplication and other nasty things.\r\n","subtype":"SESSION","startTimestamp":1382604300,"webLink":"http://uk.droidcon.com/2013/sessions/customize-your-views-2/","presenterIds":["112"],"endTimestamp":1382606700},{"id":"106","title":"Dinosaurs and Androids: The Listview evolution","location":"3","description":"Dinosaurs, like all living things, evolved, slowly and gradually, from previously existing creatures. The same happened with Listviews, they also evolved from pre-existing ancestors. Dinosaurs didn’t spring suddenly into existence two hundred million years ago, huge, toothy, and hungry for grub. Listviews on Android appeared since the beginning and they have been changing over the time. As you know, ListView is a fundamental component in Android, one of the most widely used widgets and also the most complex one.\r\n\r\nIn this talk, Jorge Barroso and Fernando Cejas will explain the evolution of this widget from previous versions of Android (based on its source code), mistakes that have been made in its implementation, giving examples and showing tips on how should be used when developing cool Android applications. Also, stuff like features, optimization, quirks and limitations will take place in this talk.","subtype":"SESSION","startTimestamp":1382604300,"webLink":"http://uk.droidcon.com/2013/sessions/dinosaurs-and-androids-the-listview-evolution/","presenterIds":["105","104"],"endTimestamp":1382606700},{"id":"111","title":"Top 10 tips for marketing your mobile games","location":"5","description":"The mobile games industry of today is unrecognisable from that of just a few years ago: developers used to be able to rely on the quality of their apps to get them noticed, but with such incredible competition, app discovery and marketing has become as critical as the game itself in building a successful launch.\r\n\r\nIndustry data suggests that less than 40% of developers manage to break even with their app, and 80% of developers can’­t make a living purely from their app revenues. Yet new apps launch every day, and monster successes from Rovio, Supercell and King.com give developers and coders hope that they could have the next global smash hit.\r\n\r\nThe reality is far less glamorous. As this presentation will seek to show, launching an app requires a blend of skills and a keen business brain if an app is to have a chance of success.\r\n\r\nThe presentation will share a wealth of best practice, tips and tricks, data and insight into how to create and launch apps. It will also explain why the marketing of your app only starts with the launch, and why you need to be thinking long-term about keeping your app fresh and your users engaged if you are going to get them spending money. The presentation will cover the key issues around mobile game marketing and discovery, talk about successes and failures in app marketing, and discuss how indie developers can work smarter in an effort to compete with the big-spending publishers that often dominate the app stores.","subtype":"SESSION","startTimestamp":1382604300,"webLink":"http://uk.droidcon.com/2013/sessions/top-10-tips-for-marketing-your-mobile-games/","presenterIds":["110"],"endTimestamp":1382606700},{"id":"121","title":"Authentication for Droids","location":"6","description":"This talk is going to shed some light on different techniques that help to authenticate users in your service via methods such as Basic Authentication and more advanced technologies like OAuth 2.0 and OpenID Connect. Best practices will be presented and (dis-)advantages are going to be discussed.\r\n\r\nChoosing the right identity provider (like Facebook, Twitter, PayPal or Google Plus) can be difficult and there are different scenarios where it makes more or less sense to implement them. After leaving this session, the audience will have a broad overview of this topic and should be able to provide their users with a nice experience.","subtype":"SESSION","startTimestamp":1382607000,"webLink":"http://uk.droidcon.com/2013/sessions/authentication-for-droids/","presenterIds":["120"],"endTimestamp":1382609400},{"id":"229","title":"Beyond the framework: portable and efficient system components using NDK","location":"4","description":"While Android framework provides a solid generic foundation for developers to write portable and robust applications, it is common for application developers to reach limits (regarding either features, performance, or compatibility across API levels and platforms) where a generic framework doesn’t fulfil specific requirements. However, thanks to its very open nature (and the NDK), Android as a platform grants to the developers the ability to implement custom frameworks, the same way Android framework is built as a wrapper around low-level native components (skia, OpenMAX, …). From extending BitmapFactory for advanced image decoding and processing (face detection, dominant colour detection, seam carving, …) for Flickr to implementing a purely native highly efficient event based HTTP/HTTPS/SPDY network stack, we will demonstrate how native development has been used in Yahoo’s Android products to push limits of the framework in a cross-platform, highly performant way, and solve fragmentation by providing a strictly consistent set of features across all API levels.","subtype":"SESSION","startTimestamp":1382607000,"webLink":"http://uk.droidcon.com/2013/sessions/beyond-the-framework-portable-and-efficient-system-components-using-ndk/","presenterIds":["228"],"endTimestamp":1382609400},{"id":"123","title":"Developing i’m Watch Apps","location":"5","description":"Wearable computing is turning out to be the next big thing. Most of the major players in the smartphone market are hurrying up to release smartwatches, wearable sensors, glasses, and a variety of the most diverse kinds of devices. Launched in 2012 and based on a customized version of Android, the i’m Watch is one of the first smart watches available on the market, and the most complete feature-wise.\r\n\r\nIn this session, you’ll get an overview of what you need to develop apps for the i’m Watch (spoiler alert: you probably already have everything you need!), you’ll learn what a smart watch is supposed to do and what the main differences in user experience and expectations are from what you’re used to on phones and tablets.\r\n\r\nThe session will also briefly cover the libraries that will make your life easier and help you create outstanding apps for the i’m Watch.\r\n\r\nWhy not find out more about this great new technology?","subtype":"SESSION","startTimestamp":1382607000,"webLink":"http://uk.droidcon.com/2013/sessions/developing-im-watch-apps/","presenterIds":["122"],"endTimestamp":1382609400},{"id":"119","title":"Give Your Objects Exactly What They Need","location":"2","description":"Tell Don’t Ask”, Single Responsibility Principle, Separation of Concerns. Such guidelines ride shotgun while we code, sitting on our shoulders and whispering in our ears. JB outlines another important Object Oriented principle not yet widely understood – one that’s key to effective use of Dagger and RoboGuice, and that underpins the raison d’etre of DI frameworks.","subtype":"SESSION","startTimestamp":1382607000,"webLink":"http://uk.droidcon.com/2013/sessions/give-your-objects-exactly-what-they-need/","presenterIds":["118"],"endTimestamp":1382609400},{"id":"117","title":"Understanding the what and how of Android app performance","location":"3","description":"Do you know the #1 reason why customers uninstall apps is when they are frustrated with its performance? If your app is functional deficient, it would just get relegated to the background and you still have a chance to update your app and figure out a way to get him or her back. But research has shown that if they find their app behaving badly by draining power, crashing often or consuming too much of bandwidth or just slows down the system, they will uninstall it in a blink and you have lost them for life! If developers had a good sense of how their app was behaving internally, as they have on how it behaves externally, many of these frustrations could be avoided.\r\n\r\nThis talk will cover the various aspects of an Android apps performance, including what causes power consumption issues for an app and what are the best practices to help reduce it, what are the best practices for bandwidth management, memory management, etc. The talk will also cover some of the tools out there to help it, including Little Eye.","subtype":"SESSION","startTimestamp":1382607000,"webLink":"http://uk.droidcon.com/2013/sessions/understanding-the-what-and-how-of-android-app-performance-2/","presenterIds":["116"],"endTimestamp":1382609400},{"id":"239","title":"CyanogenMod: Origins and Future of the aftermarket Android OS","location":"6","description":"Shane and Abhisek will be introducing you to CyanogenMod and giving you the rundown on why users are drawn to it and how collaboration has worked with it, as well as giving you the latest company news and updates.\r\n\r\nThey’ll be covering things like:\r\n\r\n- Maintaining the device\r\n- OpenIR (Open source IR HAL) as an example of a new feature\r\n- What the formation of the new company means for the community developers\r\n- Some examples of what additions were created from community contributions\r\n\r\nFind out how they brought a more useable operating ROM to their users!","subtype":"KEYNOTE","startTimestamp":1382630400,"webLink":"http://uk.droidcon.com/2013/sessions/keynote-cyanogenmod-origins-and-future-of-the-aftermarket-android-os/","presenterIds":["236","237"],"endTimestamp":1382632800},{"id":"242","title":"Smart-phones in Space: A Guide","location":"6","description":"Smartphones are everywhere now – even in space!\r\n\r\nA small team in Guildford have launched a satellite – which includes a Nexus 1 – into low Earth orbit. The team are staff and students from Surrey Space Centre (SSC) at the University of Surrey, and their commercial spinout Surrey Satellite Technology Ltd (SSTL).\r\n\r\nThe satellite has a mass of 3.5 kg and a volume of 34 x 10 x 10 cm, which is enough room for the Android smart-phone and required peripherals to point the antenna back to Earth and communicate to the groundstation.\r\n\r\nThis talk will provide the journey from cradle to grave in Earth’s first of many ‘phone-sat’ projects we now see springing up, and how hardware and software challenges were overcome to achieve this scientific feat in teaching and research.","subtype":"KEYNOTE","startTimestamp":1382688000,"webLink":"http://uk.droidcon.com/2013/sessions/keynote-smart-phones-in-space-a-guide/","presenterIds":["240"],"endTimestamp":1382690400},{"id":"17","title":"Coding for Android consoles","location":"3","description":"Al Sutton will be demonstrating how to develop games for Ouya, the innovative games console that runs on Android; as he was Ouya’s Android Specialist and helped them improve both software and firmware, there’s no one better to explain how to use it!","subtype":"SESSION","startTimestamp":1382690700,"webLink":"http://uk.droidcon.com/2013/sessions/coding-android-consoles-al-sutton/","presenterIds":["2"],"endTimestamp":1382693100},{"id":"55","title":"Crafting Unique, Delightful Apps","location":"6","description":"Join the leads of Expedia’s Android developer and designer team to hear how they make such popular apps that stand out from the crowd. They’ll be going beyond the Android design guide to demonstrate what makes an app unique, walking you through their processes, giving advice on how teams can work together to achieve the best results, and showing you how to create a polished UI with delightful interactions and transitions!","subtype":"SESSION","startTimestamp":1382690700,"webLink":"http://uk.droidcon.com/2013/sessions/crafting-unique-delightful-apps/","presenterIds":["54","53"],"endTimestamp":1382693100},{"id":"125","title":"Hello SmartWatch 2","location":"2","description":"During this session, you will be able to learn more about SmartWatch 2 and what it can do. The session will include a live demo and a live coding example of creating applications for SmartWatch.","subtype":"SESSION","startTimestamp":1382690700,"webLink":"http://uk.droidcon.com/2013/sessions/hello-smartwatch-2/","presenterIds":["124"],"endTimestamp":1382693100},{"id":"24","title":"It's HOLO time!","location":"4","description":"Find out how HOLO became the main design language of Android – and how it can transform your approach to creating apps!\r\n\r\nDespite Android becoming a major platform for mobile phones, no guidelines existed for designing homogeneous user experience across the entire platform – leading to companies re-using designs meant from other platforms, which lacked any Android-specific features. Fortunately, Google created HOLO, which quickly went mainstream as companies realised a proper Android design approach was essential.\r\n\r\nStephan will cover the emergence of HOLO, the impact it had on the design philosophy of Runtastic, and how it improved Runtastic’s apps, as well as demonstrating how Runtastic’s designers create clean and easy mock-ups that inspire the rest of the team. Finally, you’ll learn how HOLO influenced Runtastic app design on other platforms – a valuable piece of information if you’re looking to expand!\r\n\r\nIf you want to learn how to create top-quality, easy-to-use apps by putting skeuomorphism on the shelf and using clean design elements, this is the ideal presentation for you!","subtype":"SESSION","startTimestamp":1382690700,"webLink":"http://uk.droidcon.com/2013/sessions/its-holo-time-stephan-brunner-runtastic/","presenterIds":["23"],"endTimestamp":1382693100},{"id":"52","title":"This Way Up: Implementing Effective App Navigation","location":"5","description":"Consistent, predictable app navigation is crucial to the user experience of your app, but the patterns and guidelines in the Android framework are easily misused or misunderstood – leading to a worse experience for the user.\r\n\r\nIn this session, we will explore how platform navigation mechanics have changed since the release of Android 3.0, demystify Tasks and the back stack, explain the subtleties and differences between Up and Back, look at common problems that occur when app navigation is poorly implemented, and demonstrate code techniques that will help you provide user-friendly navigation and is consistent within the platform.","subtype":"SESSION","startTimestamp":1382690700,"webLink":"http://uk.droidcon.com/2013/sessions/implementing-effective-app-navigation-jeff-gilfelt/","presenterIds":["51"],"endTimestamp":1382693100},{"id":"80","title":"Bringing Firefox To Android","location":"5","description":"Last year, Firefox for Android was rebuilt from scratch to use Android’s UI framework instead of Mozilla’s XUL, improving its overall performance and user experience through a series of fast-paced development cycles. In this talk, you’ll learn how the Mozillians implemented the new Firefox for Android and which technical challenges he faced to get Mozilla’s web platform running efficiently on Android – and be able to ask Lucas whatever burning question is on your mind!\r\n","subtype":"SESSION","startTimestamp":1382693400,"webLink":"http://uk.droidcon.com/2013/sessions/bringing-firefox-to-android/","presenterIds":["79"],"endTimestamp":1382696100},{"id":"212","title":"Epson’s Moverio smart glasses and their potential for augmented reality","location":"6","description":"Epson has used its core technologies to develop binocular see-through smart glasses for the general public. And with a first concept product launched in late 2011, Epson can be considered as one of the pioneers of this exciting technology.\r\nDuring this session you will learn more about our smart glasses, the Moverio BT-100, and the opportunities the product offers when it comes to innovative applications, and being adapted for augmented reality. You will discover how both individual users and companies have been using Moverio to change the way we interact with technology and merge the real world with the digital to enhance reality. Learn what makes Moverio a natural platform for Augmented Reality and be excited by its potential.\r\nSo, if you are fascinated by the possibilities inherent in augmented reality, or inspired to develop applications to run on an exciting new platform, don’t miss the Epson session.","subtype":"SESSION","startTimestamp":1382693400,"webLink":"http://uk.droidcon.com/2013/sessions/epsons-moverio-smart-glasses-and-their-potential-for-augmented-reality/","presenterIds":["211"],"endTimestamp":1382696100},{"id":"26","title":"Fist of Awesome","location":"2","description":"Nicoll Hunt’s indie game project Fist of Awesome smashed through its Kickstarter funding targets in just 14 days, after a flurry of word of mouth and media attention – find out what that was like at Nicoll’s talk! He’ll demo his progress, talk about what it’s like to run a Kickstarter project, the challenges of developing a game simultaneously on Android and iOS, his involvement in the new OUYA Android-based TV console and why he went full circle from working for big companies back to bedroom coding. If you’re thinking of going solo, starting a Kickstarter project, or just want to be a success in indie gaming, this is the place to be!","subtype":"SESSION","startTimestamp":1382693400,"webLink":"http://uk.droidcon.com/2013/sessions/fist-of-awesome-nicoll-hunt-ifightbears/","presenterIds":["25"],"endTimestamp":1382696100},{"id":"58","title":"Hardening your Android app","location":"4","description":"If you need to improve your app security, this is the talk to come to – with 9 years experience, Scott Alexander-Bown will take you through all the tips and tricks to harden your app and make sure it’s safe for your users!","subtype":"SESSION","startTimestamp":1382693400,"webLink":"http://uk.droidcon.com/2013/sessions/hardening-your-android-app-scott-alexander-bown-via-forensics/","presenterIds":["57"],"endTimestamp":1382696100},{"id":"33","title":"Responsive design for Android","location":"3","description":"With the expansion in different Android devices, it’s no longer enough to design Android apps for just phone and tablet forms: apps on Android need to scale to a continuum of screen sizes, not just two. Web apps have faced the same issue for years and are now designed to be responsive, meaning that they adapt intelligently to any screen size. All the best Android apps follow the same principles, and combined with Android’s powerful tools, apps can be built to support any device – find out how to get yours up to scratch!","subtype":"SESSION","startTimestamp":1382693400,"webLink":"http://uk.droidcon.com/2013/sessions/responsive-design-for-android-juhani-lehtimaki-smashing-android-ui/","presenterIds":["32"],"endTimestamp":1382696100},{"id":"50","title":"Android for Healthcare","location":"5","description":"“eHealth is seen by some as possibly the most important revolution in healthcare since the advent of modern medicine,” – Dr Rhonda Jolly, Australian Policy Online\r\n\r\nWith the massive adoption and proliferation of Android devices across the globe, a diminishing number of medical professionals per capita, and a long term goal of providing Star Trek-esque medical aid, there’s a big opportunity for Android to play a role in revolutionising the healthcare industry.\r\n\r\nAs Australia is rolling out its fledgling eHealth system, countries around the world are either preparing to roll out their own systems or desperately trying to catch up to speed to accommodate increased demand – facing many political, resourcing, privacy, and security hurdles as they do so.\r\n\r\nThis talk aims to provide awareness of common issues, mitigations, and methodologies particular to the healthcare domain and Android and to inspire attendees to take advantage of the many opportunities present there.","subtype":"SESSION","startTimestamp":1382697900,"webLink":"http://uk.droidcon.com/2013/sessions/android-for-healthcare/","presenterIds":["41"],"endTimestamp":1382700300},{"id":"35","title":"Case Studies in Android design","location":"4","description":"Join Jamie McDonald for a  tour of Android’s design landscape, including patterns, tips, techniques and tools, grounded in real world examples. Come and find out how to build apps that stand out by crafting interfaces that are simple, beautiful and usable!","subtype":"SESSION","startTimestamp":1382697900,"webLink":"http://uk.droidcon.com/2013/sessions/case-studies-in-android-design/","presenterIds":["34"],"endTimestamp":1382700300},{"id":"60","title":"Gradle for Android","location":"6","description":"We will talk about the new Gradle based Build System for the Android SDK. This new build system has been developed as a Gradle plugin by the Google Android team. It is full of innovation, many of them demonstrating the unique underlying capabilities of Gradle. We will also introduce Gradle as such with a special focus on the new features that have been developed as part of the Android effort. For example more generic, platform independent dependency management and the concept of library variants for different runtimes. We will show how these new features are extremely useful for other platforms like Javascript, Scala, Java and C++.","subtype":"SESSION","startTimestamp":1382697900,"webLink":"http://uk.droidcon.com/2013/sessions/gradle-hans-dockter/","presenterIds":["59"],"endTimestamp":1382700300},{"id":"210","title":"Project Anarchy","location":"2","description":"For the past 14 years Havok has been creating middleware and tools specifically for games. What started off as a Physics engine pushed them to Animation, Destruction, AI and Graphics. Now released in 2013 is a tool set called Project Anarchy aimed at mobile app developers, is free for iOS, Android and Tizen. The tool contains a large amount of the Havok tools including Havok Physics, Havok Animation, Havok AI and Havok Vision.","subtype":"SESSION","startTimestamp":1382697900,"webLink":"http://uk.droidcon.com/2013/sessions/project-anarchy-2/","presenterIds":["209"],"endTimestamp":1382700300},{"id":"62","title":"When Your Korean Is Just Not Good Enough","location":"3","description":"Join Leslie Drewery for an introduction to device management for enterprise customers – find out how to successfully negotiate the long and rocky road of ensuring your Android enterprise devices do what they are bought to do!","subtype":"SESSION","startTimestamp":1382697900,"webLink":"http://uk.droidcon.com/2013/sessions/when-your-korean-is-just-not-good-enough-leslie-drewery/","presenterIds":["61"],"endTimestamp":1382700300},{"id":"37","title":"Android Animations","location":"2","description":"Join Mark Allison to learn about the animation APIs available within Android, and how you can add polish to your apps to make them stand out from the crowd!","subtype":"SESSION","startTimestamp":1382700600,"webLink":"http://uk.droidcon.com/2013/sessions/android-animations-mark-allison-stylingandroid-com/","presenterIds":["36"],"endTimestamp":1382703000},{"id":"48","title":"Beef Up Your Android Apps Using Java Tools","location":"4","description":"In this talk, you’ll find out how to increase the quality of your Android apps by taking advantage of the maturity of the Java ecosystem (which has been flourishing for 17 years). You’ll be given an overview of the different technologies that can be used to bring Android to the standard of Java, combining well-known tools like Jenkins, Maven and Sonar with Lint, Robolectric or UIAutomator. If you want to make your app better all round, don’t miss this talk by two of the top experts in the field!","subtype":"SESSION","startTimestamp":1382700600,"webLink":"http://uk.droidcon.com/2013/sessions/beef-up-your-android-apps-using-java-tools/","presenterIds":["42","38"],"endTimestamp":1382703000},{"id":"231","title":"Google Glass and #NoUi","location":"5","description":"Google Glass is a massive scale social experiment. The first heads up display that has the potential for mass adoption. Most of us are old enough to remember the “elitist”\u009d moniker of the mobile phone when it first went commercial, the yuppy accessory in the City, now used globally by billions.\r\n\r\n70% of 300 online business leaders I surveyed recently believe there is a high level of confusion around the potential of wearable technology and the majority also agreed that both enterprise and startup alike should be assessing this new and disruptive paradigm.\r\n\r\nI will explore the google glass through its unique user experience, what challenges there are in moving from heads down to heads up and the ways it challenges our preconceptions about the way we create software services, how do we create value when there may be #NoUi?","subtype":"SESSION","startTimestamp":1382700600,"webLink":"http://uk.droidcon.com/2013/sessions/google-glass-and-noui/","presenterIds":["230"],"endTimestamp":1382703000},{"id":"49","title":" Leveraging Android for the Internet of Things with Eclipse M2M","location":"3","description":"The Eclipse M2M (Machine-to-Machine) open source initiative delivers a stack of open source building blocks that accelerate the development of connected solutions.\r\n\r\nIn this session, you’ll be briefly introduced to the Eclipse M2M projects and discover cool end-to-end examples (Augmented Reality anyone?) combining the use of Android API with Open Hardware platforms (Arduino, Raspberry Pi…) for doing fleet tracking, remote monitoring, home automation, and much more.\r\n\r\nThere will also be a discussion of the challenges of operating large fleets of M2M devices, and the need for cloud-based scalable infrastructures. So if that sounds like your area, don’t miss out on Benjamin Cabé’s talk!","subtype":"SESSION","startTimestamp":1382700600,"webLink":"http://uk.droidcon.com/2013/sessions/leveraging-android-for-the-internet-of-things-with-eclipse-m2m/","presenterIds":["40"],"endTimestamp":1382703000},{"id":"64","title":"Ship Faster With Open Source from Square","location":"6","description":"To keep up with the Android eco-system, you have to deliver updates at a rapid pace without losing out on quality. Square is a company that excels in this through their code structure – come and see concrete usage examples of their open source libraries (such as Dagger, Otto, Picasso, Retrofit, and OkHttp)  to learn how they do it!","subtype":"SESSION","startTimestamp":1382700600,"webLink":"http://uk.droidcon.com/2013/sessions/ship-faster-with-open-source/","presenterIds":["63"],"endTimestamp":1382703000},{"id":"74","title":"Android Security: Defending Your Users","location":"6","description":"In today’s world of hackers and security breaches, it’s essential that developers make their users as safe as possible. One piece of “low-hanging fruit” for data security is to use SQLCipher for Android, a near drop-in replacement for SQLite offering transparent AES-256 encryption of data and metadata. Mark Murphy’s presentation will discuss where and how to use SQLCipher for Android and related encryption techniques to help you defend your app against all the miscreants and malefactors out there!","subtype":"SESSION","startTimestamp":1382707200,"webLink":"http://uk.droidcon.com/2013/sessions/android-security-defending-your-users/","presenterIds":["73"],"endTimestamp":1382709600},{"id":"72","title":"ProGuard and DexGuard for Optimisation and Protection","location":"4","description":"Eric will be presenting some typical results of using ProGuard and DexGuard and how they improve your applications, with a particular focus on the protection of Android applications. Find out where your weak spots are, how to use DexGuard to fix them, and make sure that you stay ahead of the hackers!","subtype":"SESSION","startTimestamp":1382707200,"webLink":"http://uk.droidcon.com/2013/sessions/proguard-eric-lafortune/","presenterIds":["71"],"endTimestamp":1382709600},{"id":"68","title":"Sensor fusion between car and smartphone","location":"5","description":"More sensors mean more opportunities for “intelligent” applications that detect changes in their environment and adapt accordingly.\r\n\r\nWhile modern Android phones are equipped with a wide range of sensors, capturing data from machines in the environment already equipped with specific sensors multiplies the possibilities. The talk makes a case for sensor fusion between the Android phone sensors and the sensors provided by an ordinary passenger car.\r\n\r\nI will present an application that processes data from the phone’s accelerometer, compass and gyroscope sensors plus the car’s speed sensor and integrates the result with internet-based services such as Google Maps. I hope to inspire the audience to start thinking about a platform for supporting these “car applications”.","subtype":"SESSION","startTimestamp":1382707200,"webLink":"http://uk.droidcon.com/2013/sessions/sensor-fusion-between-car-and-smartphone/","presenterIds":["67"],"endTimestamp":1382709600},{"id":"70","title":"Teaching Your Client Android Design; or, Ridding the World of iPhoneys","location":"3","description":"Clients don’t get Android. Soho agencies really don’t get Android. They seem to think that if you take an iPhone app and stick an Android badge on it, then you’re done. But users are smarter than that these days, and they want, and deserve, and demand better.\r\n\r\nThis talk will give you the confidence to stand up to your client and tell them where they’re wrong, where their design agency’s wrong, and show them that you really know how to make a proper native Android app and convince them to trust you and come along for the ride.\r\n\r\nIt’s your absolute duty as an Android professional to help your client by correcting them in this way – but of course you can’t say that without some serious supporting foundation and of course no fear of being fired – but that’s another story.\r\n\r\nSo we’ll talk about Android design patterns, Android anti-patterns, and how to add those little flourishes that surprise and delight your users; where to obey Google guidelines, and where to deviate; and how to work with designers and product owners to mould their original vision into a proper native Android app that sits comfortably in its little green robot home.\r\n\r\nKenton will be illustrating this talk with his experiences developing BBC Weather and Summly this year. Within a month of release, BBC Weather became the BBC’s third most popular Android app after iPlayer and News, its highest-rated Android app with a rating of 4.7 and the ratio of 5* to 1* reviews at over 100 to 1, with users raving about its native Android credentials. It became the fifth app he’s worked on to be featured by Google on Play Store. Summly was famously sold to Yahoo who immediately closed down the iPhone app and shuttered the Android app days before its release, but it’s still worth using it as an example of how to take a great iPhone app and make an even better Android app from it.","subtype":"SESSION","startTimestamp":1382707200,"webLink":"http://uk.droidcon.com/2013/sessions/teaching-your-client-android-design-or-ridding-the-world-of-iphoneys/","presenterIds":["69"],"endTimestamp":1382709600},{"id":"99","title":"Why Cross-Platform Multiplayer Social Gaming Is Now Possible","location":"2","description":"The idea of this session is to show that it is now essential to develop cross platform games, in particular because games are becoming more and more social and focused on multiplayers. Gamers now want a device that they can use to play with the community, not just alone.\r\n\r\nIn this session, a social cross platform multiplayer game will be demonstrated and you’ll discover what’s been developed at Nuggeta. You’ll learn how to empower your Android game by using a game data definition langage, so you can get the best from the cross platform game framework without having to redefine your legacy data format protocol. You’ll also find about the launch of their powerful new plugin that empowers the Google Game Services API.\r\n\r\nThis will be an animated session with 3 speakers who are all experts in the gaming industry and development – don’t miss out!","subtype":"SESSION","startTimestamp":1382707200,"webLink":"http://uk.droidcon.com/2013/sessions/why-cross-platform-multiplayer-social-gaming-is-now-possible/","presenterIds":["97","96","98"],"endTimestamp":1382709600},{"id":"31","title":"3D on Android: Open Source Workflow","location":"3","description":"This talk will be about the process of creating 3D content for Android using a number of open source tools: Blender to create 3D content, Gimp to create textures and Rajawali to bring it to life using the Android SDK. Rajawali is a 3D framework for Android based on OpenGL ES 2.0 and written in pure Java. It abstracts all the complicated OpenGL bits. This presentation will also benefit people who are unfamiliar with 3D. I will be going over the basics and I will also cover optimisation, common techniques used in 3D, animation and interaction.","subtype":"SESSION","startTimestamp":1382709900,"webLink":"http://uk.droidcon.com/2013/sessions/3d-on-android-open-source-workflow/","presenterIds":["30"],"endTimestamp":1382712300},{"id":"56","title":"Conquering concurrency: bringing the reactive extensions to the Android platform","location":"4","description":"As a software engineer at the world’s largest social audio platform, Matthias Kappler brings a fount of knowledge to Droidcon London 2013. He works on Soundcloud’s Android app and mobile service API, and was previously tech lead for mobile at Qype, as well as contributing to the book ‘Android in Practice’. He’s an experienced engineer that you don’t want to miss!","subtype":"SESSION","startTimestamp":1382709900,"webLink":"http://uk.droidcon.com/2013/sessions/conquering-concurrency-bringing-the-reactive-extensions-to-the-android-platform/","presenterIds":["39"],"endTimestamp":1382712300},{"id":"83","title":"Hardening Android Dual Boot for Enterprise Usage","location":"5","description":"The need for root exploits to gain full control of Android systems gives attackers easy to use tools which can be included in malware – you could pack an existing exploit into an app in as few as three hours!\r\n\r\nTo harden Android devices for enterprise usage, zertisa is developing a multi-boot Android system based on Linux containers. By design, this abstraction layer does not offer more security – exploits that run in one container can easily infect the host system, and breaking out of the container is only a matter of mounting the right partition. So, how do you solve this problem?\r\n\r\nTo securely use such a system, Janosch will propose the following:\r\n\r\n- Each container uses its own kernel to prevent the spreading of root-kits between containers\r\n\r\n- The containers use SEAndroid policies to complicate the use of root-exploits to break out\r\n\r\n-Each container is encrypted to complicate physical attacks\r\n\r\nThe use of SEAndroid promises the best increase of security. Though such measures are essential to prevent container break-outs, their use is not limited to dual boot solutions, and luckily are by now merged into the Android AOSP.\r\n\r\nFind out how to apply these methods and fully protect your app!","subtype":"SESSION","startTimestamp":1382709900,"webLink":"http://uk.droidcon.com/2013/sessions/hardening-android-dual-boot-for-enterprise-usage/","presenterIds":["81","82"],"endTimestamp":1382712300},{"id":"87","title":"Mastering Android Drawables","location":"2","description":"Over the past few years, the quality of apps in the Google Play Store has increased substantially. Developers are taking Android UI seriously and producing beautiful apps made of tons of graphics resources (Bitmaps, 9-patches, shapes, etc.) every day. To help you avoid the pain of handling all these different resources, the Drawable abstraction was born.\r\n\r\nIn this session, we will deep dive into the android.graphics.drawable package and how you can use it to render scalable and responsive UIs. The Drawable notion is essential to the creation of UIs, but developers often only scratch the surface. After this class, you’ll understand Drawables and be able to use them to create clean code and a polished, smooth app!","subtype":"SESSION","startTimestamp":1382709900,"webLink":"http://uk.droidcon.com/2013/sessions/mastering-android-drawables/","presenterIds":["86"],"endTimestamp":1382712300},{"id":"233","title":"Simplify Android apps testing and presentation with Genymotion","location":"6","description":"The stock Android emulator being known to be slow and difficult to setup, many Android developers don’t use it and prefer to directly test their applications on real devices. But, still, it’s difficult to test their apps on many different Android versions and device resolution/DPI. Thus, Genymotion was developed to provide Android developers and people making apps demonstration a fast and easy to setup Android emulator. We will show how Genymotion can help developers save time on apps testing and help demonstrators make great presentation of their products. With more than 3 000 daily registered users, Genymotion is greatly appreciated by Android developers.\r\n\r\nDuring this presentation, we will :\r\n- Explain Genymotion architecture\r\n- Demonstrate how Genymotion can be used for apps testing and presentation\r\n- Show how Genymotion can be integrated with testing and CI tools\r\n- Unveil new exciting features","subtype":"SESSION","startTimestamp":1382709900,"webLink":"http://uk.droidcon.com/2013/sessions/simplify-android-apps-testing-and-presentation-with-genymotion/","presenterIds":["232"],"endTimestamp":1382712300},{"id":"78","title":"Awesomeness Check List","location":"6","description":"There are an increasing number of apps that come with great design nowadays, and most of the carefully crafted apps resonate with the Android users due to their great and consistent User Experience (UX) design. Many developers and designers try hard to create an app with great UX by largely referring to the Android Design Guideline, however, to make remarkable UX design is certainly more than that, and often they missed certain important items from their check list. If you want to check if your app(s) is heading the right direction to awesomeness, be sure to attend this session to find out more about this ‘advanced’ check list in making awesome Android apps.","subtype":"SESSION","startTimestamp":1382714100,"webLink":"http://uk.droidcon.com/2013/sessions/awesomeness-check-list/","presenterIds":["77"],"endTimestamp":1382716500},{"id":"89","title":"Device Fragmentation vs. Clean Code","location":"5","description":"Trying to implement the same functionality on different devices, OS versions, manufacturers etc. can be more eventful than it should. This session will attempt to be a guide about how you can achieve your task at hand without compromising code quality and readability. Specifically, Iordanis will demonstrate how to use Dependency Injection to your favour, for graceful handling and degrading experience at production code and automated tests.","subtype":"SESSION","startTimestamp":1382714100,"webLink":"http://uk.droidcon.com/2013/sessions/device-fragmentation-vs-clean-code/","presenterIds":["88"],"endTimestamp":1382716500},{"id":"215","title":"Getting your app noticed","location":"3","description":"You’ve published your app and now you want people to find it. Find out how you can get your app noticed and decide on the best monetization strategy. ","subtype":"SESSION","startTimestamp":1382714100,"webLink":"http://uk.droidcon.com/2013/sessions/getting-your-app-noticed/","presenterIds":["213","214"],"endTimestamp":1382716500},{"id":"91","title":"How To Break Your Beast Project Down Into Services And Enjoy A Happy Life!","location":"4","description":"We’ve all been there and done that. A project starts small, and all of a sudden turns into a two-headed monster.\r\n\r\nWhat if you could break it (your project and not the monster) down by functionality, into smaller self-contained services that allowed you to develop, test and deploy without interfering with the rest of your other services?\r\n\r\n“You’re telling me fibs!” you say? In this presentation, Marcos Placona will tell you the secrets of SOA (Service Oriented Architecture) and show you how to build robust, scalable and lean services that provide incredible functionality as well as being very low maintenance.\r\n\r\nHe will share his experiences with using such approaches, and tell you the pros (and cons) with doing things this way, as well as taking you through some common tools that can be used to make you sail through that ginormous enterprise application you’ve been working on with common dialects such as JSON, REST, HTTP and message queues.\r\n\r\nIf this sounds like a familiar problem, you’d best attend!","subtype":"SESSION","startTimestamp":1382714100,"webLink":"http://uk.droidcon.com/2013/sessions/how-to-break-your-beast-project-down-into-services-and-enjoy-a-happy-life/","presenterIds":["90"],"endTimestamp":1382716500},{"id":"85","title":"Productising a modern Android Device","location":"2","description":"Vertu is a UK-based manufacturer and retailer of luxury mobile phones. Established by Nokia in 1998, it spent the next fourteen years creating phones using the S40 and S60 platforms. In 2012, they introduced their first Android phone with the Vertu Ti. This session will discuss Vertu’s experiences productising Android along with the benefits and pitfalls in creating an Android phone that will be used around the world.\r\n\r\nTopics will include discussions of what sorts of issues any Android OEM would face, such as dealing with an ever-changing Google Mobile Services and moving from one Android baseline to another. Discussion will also include some of the specific challenges that Vertu met, such as adding extra physical buttons, unique services integration, selling in China where Google Mobile Services aren’t allowed, and the trade-offs between using an existing analytics platform and creating one from scratch.","subtype":"SESSION","startTimestamp":1382714100,"webLink":"http://uk.droidcon.com/2013/sessions/productising-a-modern-android-device/","presenterIds":["84"],"endTimestamp":1382716500},{"id":"101","title":"App to App: Designing Local APIs","location":"6","description":"Designing an elegant interface and local APIs for developers to communicate with your app is crucial for building a platform around your product: in this talk, you’ll find out how Evernote allows third party developers to seamlessly interact with the users’ local data and shortcut more expensive server operations. Ty Smith will walk you through how to create a well-defined interface in your app – if that’s something you want to know, don’t miss it!","subtype":"SESSION","startTimestamp":1382716800,"webLink":"http://uk.droidcon.com/2013/sessions/app-to-app-designing-local-apis/","presenterIds":["100"],"endTimestamp":1382719500},{"id":"127","title":"Building for Success: Scalable Cloud Backends for your Android Apps","location":"2","description":"Today, building the next generation of mobile apps and scaling them to create success requires leading edge platforms and infrastructure.\r\n\r\nIn this session we will look at how you can use Google Cloud Platform to build highly scalable mobile backends.\r\n\r\nUsing a sample application and live demos, we’ll show how applications built on Google App Engine and Compute Engine can make use of Google Cloud Endpoints and Google Cloud Messaging to provide all that’s needed to allow Android devices to access backend services in the Cloud.\r\n\r\nIf you want to take advantage of Google’s Cloud platform, don’t miss out on this talk!","subtype":"SESSION","startTimestamp":1382716800,"webLink":"http://uk.droidcon.com/2013/sessions/building-for-success-scalable-cloud-backends-for-your-android-apps/","presenterIds":["126"],"endTimestamp":1382719500},{"id":"95","title":"Don’t Screw Up Your App! A Case Study in Using Cutting-edge Technologies Before They Are Ready","location":"5","description":"We all want a simpler, smarter app; however, trying to amaze with cutting-edge technologies can be difficult and lead to unpredictable experiences.\r\n\r\nJoin this talk to learn about Gumtree’s journey into using smart technologies to improve user content generation. Starting with an experiment with Elastic Search and continuing to a prototype integrating real-time image recognition, you will learn about their experiences and the effects this had on their 1 million Android users.","subtype":"SESSION","startTimestamp":1382716800,"webLink":"http://uk.droidcon.com/2013/sessions/dont-screw-up-your-app-a-case-study-in-using-cutting-edge-technologies-before-they-are-ready/","presenterIds":["92","94","93"],"endTimestamp":1382719500},{"id":"235","title":"If Spock had an Android phone: Android and the Web of Things","location":"3","description":"In the vision of the Web of Things, embedded devices become first-class citizens of the Web but what if every day objects could all become part of this gigantic network? What if your watch, guitar, bike or bottle of organic iced-tea could all have an active digital identity on the Web? With the advent of tagging technologies such as NFC, EPC or QR-codes, this is becoming a reality with a lot of potential for simple but great innovations. In this talk, we’ll first briefly look at these three tagging technologies comparing and contrasting them in order to understand their respective use-case based on our experience deploying such solutions in the real-world. We will then wear our Android hat and look at how much of a fantastic Web of Things platform Android truly is! We’ll go hands-on and implement a mobile application that can read both NFC and QR tags on products in order to bootstrap the access to their virtual profiles.\r\n\r\nLooking at event “better” connected things, we’ll introduce the Microbridge Android library, Google’s ADK (Accessory Development Kit) standard and the Processing IDE for Arduino and show how this savoury combination will let your phone talk with pretty much any real-world device (did someone say toaster?). We’ll also throw a glimpse into the future and look at Bluetooth Low Energy support on mobile phones.\r\n\r\nFinally, we’ll show how mobile phones can be used as physical gateways to cloud services such as the EVRYTHNG API. Where Droids, bottles, toasters and Large Hadron Colliders can meet to talk Web of Things!”","subtype":"SESSION","startTimestamp":1382716800,"webLink":"http://uk.droidcon.com/2013/sessions/if-spock-had-an-android-phone/","presenterIds":["208"],"endTimestamp":1382719500},{"id":"76","title":"The beautiful game","location":"4","description":"Picture the scene. The end of football season is fast approaching. As the matches enter injury time, fans in stadia across the country look down nervously at their smartphones, eager to find out how their rivals are performing and if their club has secured promotion or even avoided relegation. That is if they can get a data connection.\r\n\r\nMobile connectivity is notoriously poor in football stadia due to their construction and the high density of users. Yet, football fans increasingly expect the same level of connectivity and access to services that they experience elsewhere. Our proposed solution – sharing content and data connections betweens fans’ smartphones using a delay tolerant network (DTN) implemented on Android smartphones with WiFi-Direct.\r\n\r\nIn association with Brighton & Hove Albion Football Club, we have designed and deployed an Android application to allow users’ smartphones to form networks that are used to share and request content, such as live scores and Twitter. Users without mobile network connectivity were able to continue using services via the DTN, whilst those with an Internet connection were able to download and share content with others.\r\n\r\nIn this presentation, the primary focus of this talk will be on the design and implementation of the DTN, the many technical issues that we had to overcome (particularly with Wifi-Direct and device dependent issues), and the practical issues of deploying a WiFi-Direct based application in the real world.\r\n\r\nProject Website: http://www.digitalstadium.mobi/","subtype":"SESSION","startTimestamp":1382716800,"webLink":"http://uk.droidcon.com/2013/sessions/delay-tolerant-networking-using-wifi-direct/","presenterIds":["75"],"endTimestamp":1382719500},{"id":"158","title":"Hackathon","location":"7","description":"Join us at Skills Matter straight after the conference for a big weekend of Hackathon and Workshops!\r\n\r\nMini-challenges will also be organised and many prizes will be distributed by our generous sponsors – so don’t miss it!","subtype":"SESSION","startTimestamp":1382770800,"webLink":"http://maps.google.co.uk/?daddr=Skills+Matter,+116-120+Goswell+Rd,+London+EC1V+7DP,+United+Kingdom","presenterIds":[],"endTimestamp":1382814000},{"id":"161","title":"Hackathon","location":"7","description":"Join us at Skills Matter straight after the conference for a big weekend of Hackathon and Workshops!\r\n\r\nMini-challenges will also be organised and many prizes will be distributed by our generous sponsors – so don’t miss it!","subtype":"SESSION","startTimestamp":1382860800,"webLink":"http://maps.google.co.uk/?daddr=Skills+Matter,+116-120+Goswell+Rd,+London+EC1V+7DP,+United+Kingdom","presenterIds":[],"endTimestamp":1382904000}]}