{"presenters":[{"id":"2","bio":"Al Sutton is the founder of Funky Android and co-founder of Enterprise Data Safe Ltd., and over the last year has helped customise and improve Android for the innovative OUYA games console – there’s no one better to explain it than the person who helped develop it! He’s been involved in Android since it was released in 2008, and he’s bringing all this experience (plus twenty years in general computing) to the table here at Droidcon London.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/games_AlSutton.jpg","name":"Al Sutton","publicPlusId":"http://www.twitter.com/alsutton","plusoneUrl":""},{"id":"30","bio":"Dennis is a London based creative developer. His main focus is interactive 3D on mobile platforms and interactive installations. He has done work for clients such as Nike, Unilever, Ferrari, and EA at global digital agency AKQA. Heâ\u0080\u0099s an active contributor to open source projects and is the founder and lead developer of the Rajawali 3D framework for Android.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/game_DennisIppel.jpg","name":"Dennis Ippel","publicPlusId":"https://plus.google.com/110899192955767806500/posts","plusoneUrl":""},{"id":"34","bio":"Jamie McDonald is an Android developer with a passion for good user experience, and has worked on a series of apps with companies like The Guardian, Songkick and holosudoku.com. He has been on the mobile team at Guardian News & Media and worked with Novoda on bringing start-ups to the Android platform.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_JamieMcDonald.jpg","name":"Jamie McDonald","publicPlusId":"https://twitter.com/jdamcd","plusoneUrl":""},{"id":"27","bio":"Jason Avent has been engaged with game development for nearly twenty years and has worked on PC, console, iOS and Android games. Having held game design and production roles at Electronic Arts, Disney and Microprose he has lead teams to create multi-million selling, critically acclaimed, award winning games. Most recently Jason founded Boss Alien, the company responsible for the hit free to play mobile game CSR Racing which dominated the world’s app stores last year and continues to delight millions of customers every day – over a year after it’s release.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/Jason-Avent.jpg","name":"Jason Avent","publicPlusId":"https://twitter.com/bossalientweets","plusoneUrl":""},{"id":"32","bio":"Author of ‘Smashing Android UI’ and androiduipatterns.com, Juhani Lehtimaki is an Android developer with a real passion for design. Currently working at Snapp TV as the Head of Android Development, building apps for smartphones, tablets, and Google TV, he’s the ideal expert for all your design needs! In his spare time, he’s working on a hybrid Android and table-top game called Lands of Ruin – feel free to ask him about it, and any other issue that comes to mind, at his talk on responsive design!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/design_JuhaniLehtimaki.jpg","name":"Juhani Lehtimäki","publicPlusId":"https://plus.google.com/u/0/102272971619910906878/posts","plusoneUrl":""},{"id":"36","bio":"Mark Allison is an engineer devoted to helping you realise your full potential: on his technical Android UI/UX blog, he writes posts to help and advise Android developers on common problems. With over 30 years experience, you can ask him any design question under the sun and get a great answer â\u0080\u0093 donâ\u0080\u0099t miss out on the opportunity to pick his brain!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2012/09/markallison.jpg","name":"Mark Allison","publicPlusId":"https://twitter.com/MarkIAllison","plusoneUrl":""},{"id":"39","bio":"As a software engineer at the world’s largest social audio platform, Matthias Kappler brings a fount of knowledge to Droidcon London 2013. He works on Soundcloud’s Android app and mobile service API, and was previously tech lead for mobile at Qype, as well as contributing to the book ‘Android in Practice’. He’s an experienced engineer that you don’t want to miss!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_MatthiasK%C3%A4ppler.jpg","name":"Matthias Käppler","publicPlusId":"https://twitter.com/mttkay","plusoneUrl":""},{"id":"25","bio":"A rising star in the indie game scene, Nicoll Hunt has worked on everything from 2-man teams to companies with 250 employees – and now he’s started his own solo venture with his game studio I Fight Bears. His first game from this studio, Fist of Awesome, featured a time-travelling lumberjack saving the world from wild animals – it gained almost £12,000 in sponsorship on Kickstarter, as well as being picked as one of the first games for the OUYA console. He’ll be telling you all about it at this year’s Droidcon! He’s now flourishing in North London, creating more quirky mobile games – don’t miss out on the opportunity to meet him!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/games_NicollHunt.jpg","name":"Nicoll Hunt","publicPlusId":"https://twitter.com/nicollhunt","plusoneUrl":""},{"id":"23","bio":"Stephan Brunner is the Head of Android Development for Runtastic – with 22 successful apps under his belt, this is a great opportunity for you to learn from one of the best in the business of app design! If you want to find out the best way to design, he’ll be explaining how using HOLO revolutionised the way his team created their highly rated apps!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/design_StephanBrunner.jpg","name":"Stephan Brunner","publicPlusId":"https://twitter.com/stephanbrunner8","plusoneUrl":""},{"id":"38","bio":"Stéphane Nicolas specialises in the development of Android applications for smartphones and tablets; currently working at OCTO Technology, he has 15 years of experience, and is an active participant in the development of Android. With his contributions to the integration of the Android platform with advanced industrialised programming techniques like Sonar, Maven, and Jenkins, he is a perfect candidate to give you an inside look at how Android might be improved even further!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_StephaneNicholas.jpeg","name":"Stéphane Nicolas","publicPlusId":"https://twitter.com/OCTOTechnology","plusoneUrl":""}]}