{"presenters":[{"id":"236","bio":"Abhisek Devkota is the Community Manager and project manager for Cyanogen Inc., a new company formed by the cofounders of the largest aftermarket Operating System for Android devices CyanogenMod.\r\n\r\nThe CyanogenMod Project is an opensource distribution that is community driven and created in collaboration with volunteers around the world, with the goal to allow users to truly own their phone through customization, functionality and enhanced security over their personal data.\r\n\r\nAbhisek is a veteran of the consulting industry surrounding Washington, DC. Before joining Cyanogen Inc. he worked on implementation of Software as a Service solutions for various US government agencies and was a volunteer to the CyanogenMod project for 4 years in his spare time. He is an avid fan of technology and opensource communities. He is especially interested in opening the more niche prosumer and enthusiast ideas to the average user, including the benefits of secure services and personal data management.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/10/Abhisek1.jpg","name":"Abhisek Devkota","publicPlusId":"https://twitter.com/ciwrl","plusoneUrl":""},{"id":"2","bio":"Al Sutton is the founder of Funky Android and co-founder of Enterprise Data Safe Ltd., and over the last year has helped customise and improve Android for the innovative OUYA games console – there’s no one better to explain it than the person who helped develop it! He’s been involved in Android since it was released in 2008, and he’s bringing all this experience (plus twenty years in general computing) to the table here at Droidcon London.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/games_AlSutton.jpg","name":"Al Sutton","publicPlusId":"http://www.twitter.com/alsutton","plusoneUrl":""},{"id":"208","name":"Al Sutton","plusoneUrl":""},{"id":"221","name":"Amanda Clifford","plusoneUrl":""},{"id":"40","bio":"Benjamin Cabé is an Open Source Evangelist at Sierra Wireless. He has a longtime passion for Eclipse and its ecosystem, and is a committer on several Eclipse projects and contributor to numerous other open source projects. As the chair of the Eclipse M2M Working Group, he advocates the use of innovative technologies for the Internet of Things. He also co-leads Eclipse projects Koneki and Mihini – if these sound like projects you want to hear more about, make sure to come to his talk!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/09/benc.jpg","name":"Benjamin Cabé","publicPlusId":"https://twitter.com/kartben","plusoneUrl":""},{"id":"112","bio":"After moving to Berlin in 2009 Benjamin started developing Applications for Android. Shortly after that he became manager of Berlin’s Android Usergroup “GDG Android in Berlin” which holds monthly meetups. He has co-organized Android related community events such as “GTUG Community Weekend”, “Global Android Dev Camp” and “GDG DevFest”.\r\n\r\nWhile studying Business Computing he and his team developed the Guinness World Record holding Open Source App Blinkendroid. He has also developed the Crouton library for Android. Further is a member of c-base hackerspace’s mobile interfaces project that is currently focusing on home automation.\r\n\r\nSince 2012 Benjamin is working as a Senior Software Developer at ImmobilienScout24.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/Benjamin-Weiss.jpg","name":"Benjamin Weiss","publicPlusId":"https://twitter.com/keyboardsurfer","plusoneUrl":""},{"id":"54","bio":"Chris is a mobile designer that's passionate about Android. At Expedia, he's worked on features like flight booking and itineraries, as well as refreshing the Android app's interface to fit the Holo style. The Expedia app has been featured in Google Play's \"Beautiful Design\" category.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_ChrisArvin.jpg","name":"Chris Arvin","publicPlusId":"http://dribbble.com/meinhyperspeed","plusoneUrl":""},{"id":"244","name":"Christopher Jenkins","plusoneUrl":""},{"id":"250","name":"Costas Stylianou","plusoneUrl":""},{"id":"84","bio":"Craig Arnush has spent over a quarter century working in a variety of roles from program management to authoring books to straight-out designing and coding. He’s spent the last fourteen years concentrating on mobile phones, and the last year on Android. He currently earns a living at Vertu, helping to bring Android to a luxury market. Come hear what it takes to build a modern Android smartphone!","thumbnailUrl":"","name":"Craig Arnush","publicPlusId":"","plusoneUrl":""},{"id":"86","bio":"Cyril Mottier is a mobile software engineer at Capitaine Train and a Google Developer Expert dedicated to Android. Passionate about technology and design, Cyril is an avid lover of Android and a multi-skilled engineer: he can turn his hand to any problem you might be having! He is actively involved in the Android community and shares his passion writing blog posts, creating open source libraries and giving talks. His motto is “Do less, but do it insanely great” – come and find out how he lives up to it!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_CyrilMottier.jpg","name":"Cyril Mottier","publicPlusId":"https://twitter.com/cyrilmottier","plusoneUrl":""},{"id":"232","bio":"Daniel is a serial entrepreneur specialized in operating systems and virtualization.\r\nAs the CTO of different startups, he developed products in the IT security and virtualization field.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/10/np_DanielFages.png","name":"Daniel Fages","publicPlusId":"http://twitter.com/Genymobile","plusoneUrl":""},{"id":"53","bio":"Daniel is the principal Android engineer at Expedia, which has a focus on well-designed travel apps.  Our applications have millions of downloads for both paid and free applications.  While at Expedia (formerly Mobiata) he designed and released six applications for Android, and in his spare time he has also worked on applications with hundreds of thousands of downloads.  He is also an attendee of (and occasional speaker at) the local twin cities Android developer group and has spoken at AnDevCon.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_DanLew.jpg","name":"Dan Lew","publicPlusId":"http://www.linkedin.com/pub/daniel-lew/16/352/23","plusoneUrl":""},{"id":"230","bio":"Dave is a mobile and wearable technology thought leader, currently leading the lastminute.com mobile team creating mobile user experiences used by millions of customers. Formerly the Head of Strategy and Services at Service Business Incubation Unit of Hitachi Ltd and Director of the design consultancy Project Bureau creating new products and services, for clients FIAT, Hitachi, Microsoft, Nissan and Skype.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2012/10/DaveSlocombe.jpg","name":"Dave Slocombe","publicPlusId":"http://twitter.com/daveslocombe","plusoneUrl":""},{"id":"213","bio":"David Isbitski is a Technical Evangelist for Amazon focused on Apps and Games. He enjoys talking about technology and has taught full-day courses on numerous topics as well as being a presenter at many community and third party events. Dave is also an author for Lynda.com and can be found on twitter as @TheDaveDev and the Amazon Developer blog http://developer.amazon.com/blog/index.html.","thumbnailUrl":"","name":"David Isbitski","publicPlusId":"http://www.twitter.com/TheDaveDev","plusoneUrl":""},{"id":"214","bio":"David Llewellyn is a Content Acquisition Manager in the UK Appstore team. He’s been in mobile for over 10 years and has worked at some of the UK’s most innovative mobile companies, The Carphone Warehouse, Shazam and Mobile Interactive Group (now part of Velti PLC).","thumbnailUrl":"","name":"David Llewellyn","publicPlusId":"","plusoneUrl":""},{"id":"30","bio":"Dennis is a London based creative developer. His main focus is interactive 3D on mobile platforms and interactive installations. He has done work for clients such as Nike, Unilever, Ferrari, and EA at global digital agency AKQA. Heâ\u0080\u0099s an active contributor to open source projects and is the founder and lead developer of the Rajawali 3D framework for Android.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/game_DennisIppel.jpg","name":"Dennis Ippel","publicPlusId":"https://plus.google.com/110899192955767806500/posts","plusoneUrl":""},{"id":"107","bio":"Dennis Strein is co-founder of appfour, creator of the on-device development app AIDE – Android IDE: www.android-ide.com. Dennis has over 20 years experience in software development. He holds a PhD in computer science.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_DennisStrein.jpeg","name":"Dennis Strein","publicPlusId":"https://plus.google.com/108688327875159308251/posts","plusoneUrl":""},{"id":"234","bio":"Dominique Guinard is the CTO and co-founder of EVRYTHNG, a software company providing Active Digital Identities, for any physical object. He got his Ph.D. from ETH Zurich, where he worked on laying down the foundations of the Web of Things: a world-wide network of interconnected objects (sensors, appliances, machines and tagged objects) and co-founded the Web of Things (WoT) community. Before this, he worked on bringing industrial networks of RFID-tagged objects to the Web at the MIT Auto-ID Labs in the USA as well as with Sun Microsystems and Nokia in the R&D of mobile Internet of Things prototypes. He also worked 4 years for SAP on the software aspects of the next generation platform for integrating the Internet of Things with business processes.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/10/good-1280.jpg","name":"Dominique Guinard","publicPlusId":"","plusoneUrl":""},{"id":"240","bio":"Dr Chris Bridges is an academic at Surrey Space Centre in the University of Surrey’s Faculty of Engineering and Physical Sciences. He is published in hardware and computing in satellite systems, and leads the On-board Data Handling Group. His PhD was in ‘Agent Computing for Distributed Satellite Systems’ and includes research spanning astrodynamics (how satellite move in relation to each other) to distributed real-time Java computing.\r\n\r\nHe teaches in microprocessors, digital design, and spacecraft bus subsystems. He is currently leading the STRaND Programme together with SSTL, and is involved in future missions at Surrey and across the world such as the QB50 project – over 50 satellites launching on one rocket towards a space-based distributed sensor network.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/10/KEYNOTE_DrChrisBridges.jpg","name":"Dr. Chris Bridges","publicPlusId":"https://twitter.com/DrChrisBridges","plusoneUrl":""},{"id":"97","bio":"Dryce Abadlia is an R&D engineer at Nuggeta, specialising in user interfaces and ergonomy. If that sounds like you too, why not grab your chance to meet him and discover his thoughts?","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/09/dryce.jpg","name":"Dryce Abadlia ","publicPlusId":"https://twitter.com/nuggeta","plusoneUrl":""},{"id":"228","bio":"Eric Hassold is Architect for Mobile and Emerging Products at Yahoo! From his current position at Yahoo! to his former roles (at Facebook and Android team at Google), he has spent the last 4 years concentrating on all aspect of Android platform, from hardware and kernel bring up, Android system internals to delivering delightful user experience to hundreds of millions of users. Before relocating in the Silicon Valley, his previous life as Entrepreneur and founder of Evolane was dedicated to developing cross platforms framework for M2M, STB and all kind of embedded systems.","thumbnailUrl":"","name":"Eric Hassold","publicPlusId":"http://www.linkedin.com/in/evolane","plusoneUrl":""},{"id":"71","bio":"Eric Lafortune is the creator of ProGuard and DexGuard, two of the most important tools for Android development: ProGuard reduces the size of your app, whilst DexGuard protects it – and your users. With over 15 years of experience, big clients like IBM and Hewlett-Packard, and two technologies that are now industry standard under his belt, Eric is an ideal guide on how to become a success!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_EricLafortune.jpg","name":"Eric Lafortune","publicPlusId":"http://www.linkedin.com/in/ericlafortune","plusoneUrl":""},{"id":"65","bio":"Erik Hellman is currently working as a mobile developer consultant for Factor10 in Sweden. He was earlier a research engineer and lead architect for Sony Mobile. Erik is also the author of the book “Android Programming: Pushing the limits” which will be released in November 2013.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2012/09/Erik-Hellman.jpg","name":"Erik Hellman","publicPlusId":"https://twitter.com/ErikHellman","plusoneUrl":""},{"id":"105","bio":"Software engineer working at @tuenti. GDG Barcelona Organizer. Agile methodologies, programming and technology geek. Biography: Passionate mobile application developer. Currently working in Tuenti as Android Developer. He has been involved in android app development since 2010. Before Tuenti worked on NFC and RFID mobile applications. He is also Organizer of the Barcelona Google Developers Group (GDG).","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_FernandoCejas.jpg","name":"Fernando Cejas","publicPlusId":"https://twitter.com/fernando_cejas","plusoneUrl":""},{"id":"92","bio":"Francesca Cuda is a Java and Android developer for the mobile app team at Gumtree – having recently moved into Android development, she’s eager to learn more and push the boundaries of the platform. If that sounds good, come and be inspired by her new ideas and creativity?","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/09/bp_FrancescaCuda.jpg","name":"Francesca Cuda ","publicPlusId":"https://twitter.com/gumtree","plusoneUrl":""},{"id":"254","name":"Frankie Sardo","plusoneUrl":""},{"id":"67","bio":"Gábor Paller received his MSc. and PhD. degrees from the Technical University of Budapest in 1992 and 1996, respectively.\r\n\r\nDr. Paller joined Nokia in 1998 and held positions in Nokia R&D and Nokia Research Center. His interests included wireless protocol development, mobile device management, mobile Java and middleware.\r\n\r\nIn 2010 he joined Ericsson where he works on IMS-related technologies. As a second job, he does consulting jobs for Sfonge Ltd., a Finland-based startup. Gabor Paller runs the popular My Life with Android blog and his latest passion are mobile sensors.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/Gabor-Paller.jpg","name":"Gábor Paller","publicPlusId":"http://www.linkedin.com/in/gaborpaller","plusoneUrl":""},{"id":"59","bio":"Founder of Gradleware and creator of pioneering build system Gradle, Hans Dockter has 13 years of experience Hans in several industry sectors as a software developer, team leader, architect, trainer, and technical mentor. Gradle is the emerging industry standard for Android, as proved by Google recently moving all its developers over to it! The CEO of such a clearly outstanding company is the ideal person to come to if you want to find out how to become successful!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/Hans-Dockter.png","name":"Hans Dockter","publicPlusId":"http://www.twitter.com/gradleware","plusoneUrl":""},{"id":"108","bio":"Always coding something when he is not sailing, Hans Kratz is the co-creator of AIDE and co-founder of appfour. Hans has over 20 years of experience creating software.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/09/Optimized-bp_HansKratz.jpg","name":"Hans Kratz","publicPlusId":"https://plus.google.com/101738162799574584857/posts","plusoneUrl":""},{"id":"211","bio":"Hiroyuki Baba was born in 1957 in Kobe, Japan. He joined Epson in 1984 after graduating in system control engineering from Kobe University. One of his first responsibilities at Epson was in designing the ICs for portable LCD TVs.\r\nAfter some years spent in semiconductor development he was assigned to visual products, where he was involved in the commercialization of Epson’s first 3LCD projector.\r\nIn subsequent years Baba worked as a manager and general manager in areas as diverse as development, commercialization and marketing of products such as GPS systems, wireless technologies and LCD panels. In 2006 he was recognized by the Japanese Minister of Education for his invention of drive circuits used in LCD panels.\r\nHe now works in Epson’s smart glasses programme and was closely involved in developing the Moverio BT-100, Epson’s first head-mounted display. In fact, he was so closely involved in the development that the product was actually named after him – he is the “B” in BT-100.\r\nBaba is married with two children. In his younger days he enjoyed playing football and diving, but now divides his leisure time among running, river fishing and golf.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/10/epson.png","name":"Hiroyuki Baba","publicPlusId":"","plusoneUrl":""},{"id":"227","name":"Hugo Visser","plusoneUrl":""},{"id":"219","name":"Ian Holt","plusoneUrl":""},{"id":"88","bio":"Iordanis is a software engineer with 8 years of experience on the full stack. Based in London, He’s currently the Team Lead of the Android team at Shazam, where he’s trying to promote BDD and software craftmanship to developers who share the same passion. Previously, Tech Lead at Yahoo!. Whenever, Iordanis is not building Android apps on weekends, he much prefers visiting random European cities or exploring more about London itself!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/Iordanis.jpg","name":"Iordanis Giannakakis","publicPlusId":"https://twitter.com/iordanis_g","plusoneUrl":""},{"id":"110","bio":"James Kaye is co-founder of dimoso, an integrated PR and Marketing agency that specialises in mobile and tech. dimoso is also one Europe’s only specialist app marketing agencies. At dimoso, James has globally launched several games including Real Boxing that reached #1 in 92 countries. James has also written about and spoken extensively on app marketing including a regular column for Pocketgamer.biz and the guide ‘Top 10 Tips for Marketing Your App’ which can be found on Glossi.com. James is also co-founder of app marketing service appromoter. James has over seventeen years of B2B and B2C marketing experience, ten of which has been spent working at an international level within the mobile sector. Prior to founding dimoso James was acting Head of Mobile for UK newspaper the Daily Mirror as well as a consultant for companies such as Flurry, Exent and Scoreloop.\r\n\r\nJames has also held several marketing positions in the mobile industry including Head of Campaigns for Muzicall, Europe’s largest provider of managed ringback tone services as well as Director of Marketing at global mobile publisher Connect2Media where he managed marketing campaigns with leading brands including Marvel, Hasbro, Activision, World Poker Tour and Sony.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_JamesKaye.jpeg","name":"James Kaye","publicPlusId":"https://twitter.com/dimosoagency","plusoneUrl":""},{"id":"34","bio":"Jamie McDonald is an Android developer with a passion for good user experience, and has worked on a series of apps with companies like The Guardian, Songkick and holosudoku.com. He has been on the mobile team at Guardian News & Media and worked with Novoda on bringing start-ups to the Android platform.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_JamieMcDonald.jpg","name":"Jamie McDonald","publicPlusId":"https://twitter.com/jdamcd","plusoneUrl":""},{"id":"81","bio":"Janosch Maier works at zertisa, creating a secure Multi Boot system for Android. He uses both Linux and Android, and is currently studying computer science with psychology as a minor at the Technical University of Munich, focusing on Android security.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/Janosch-Maier.jpg","name":"Janosch Maier","publicPlusId":"https://plus.google.com/u/0/105500060293140392439","plusoneUrl":""},{"id":"27","bio":"Jason Avent has been engaged with game development for nearly twenty years and has worked on PC, console, iOS and Android games. Having held game design and production roles at Electronic Arts, Disney and Microprose he has lead teams to create multi-million selling, critically acclaimed, award winning games. Most recently Jason founded Boss Alien, the company responsible for the hit free to play mobile game CSR Racing which dominated the world’s app stores last year and continues to delight millions of customers every day – over a year after it’s release.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/Jason-Avent.jpg","name":"Jason Avent","publicPlusId":"https://twitter.com/bossalientweets","plusoneUrl":""},{"id":"118","bio":"JB Steadman manages the London office of Pivotal Labs, working closely with UK clients to deliver great bespoke software while helping them grow their teams.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/09/bp_JBSteadman.jpg","name":"JB Steadman","publicPlusId":"https://twitter.com/jbsteadman","plusoneUrl":""},{"id":"51","bio":"Jeff is an independent Android developer with several successful apps and open-source projects to his name, including ASBOrometer, Location Scout, and Kickvision. His ongoing mission: to improve the developer experience by leveraging community knowledge, tools and open source. Come and benefit from his experience to improve your own techniques and skills!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_JeffGilfelt.jpeg","name":"Jeff Gilfelt","publicPlusId":"http://www.twitter.com/readyState","plusoneUrl":""},{"id":"124","bio":"Jerker has been working with software since 1998, developing and architecting software for a wide range of platforms and operating systems. He has been with Sony since 2008 and is currently a member of the technology group as software architect for Sony mobile accessories looking at the technologies ahead, researching and prototyping. He is also a developer advocate for Sony mobile smart accessories. Recently, he has also been involved in product development as software architect for Xperia SmartTags and the Sony Smart Imaging Stand.","thumbnailUrl":"","name":"Jerker Lindgren","publicPlusId":"http://developer.sonymobile.com/","plusoneUrl":""},{"id":"42","bio":"Jérôme Van Der Linden has worked with OCTO technology for 6 years, and has constantly promoted Android since the very beginning. He’s on a quest for the holy grail of industrialisation, having worked mostly on delivering and auditing applications for Java/JEE. He’s a software designer with a passion for Android – come and find out his vision for where it could be going!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_JeromeVanDerLinden.jpg","name":"Jérôme Van Der Linden","publicPlusId":"https://twitter.com/OCTOTechnology","plusoneUrl":""},{"id":"104","bio":"Jorge Barroso is Tech Lead Android Core at Tuenti.  He has been working in this company since 2009 on a wide variety of projects in J2ME, Blackberry and Android. Before Tuenti, he worked in various companies developing games for mobile platforms and multiplayer games.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_JorgeBarroso.jpg","name":"Jorge Barroso","publicPlusId":"https://twitter.com/flipper83","plusoneUrl":""},{"id":"32","bio":"Author of ‘Smashing Android UI’ and androiduipatterns.com, Juhani Lehtimaki is an Android developer with a real passion for design. Currently working at Snapp TV as the Head of Android Development, building apps for smartphones, tablets, and Google TV, he’s the ideal expert for all your design needs! In his spare time, he’s working on a hybrid Android and table-top game called Lands of Ruin – feel free to ask him about it, and any other issue that comes to mind, at his talk on responsive design!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/design_JuhaniLehtimaki.jpg","name":"Juhani Lehtimäki","publicPlusId":"https://plus.google.com/u/0/102272971619910906878/posts","plusoneUrl":""},{"id":"114","bio":"Ken Blakeslee is the Chairman of WebMobility Ventures and an Investment Advisor to Ascension Ventures – over the past few years, he’s been involved in private equity investing in the mobile sector, on top of 25 years of experience developing telecoms, IT and web commerce business strategies. His focus has been on the emerging new media content, applications and commerce methodologies, and the merging of these with the ubiquitous, personal access of mobile.\r\n\r\nRecent emphasis has been placed on Wearable Technologies, mHealth, Augmented Reality, Mobile TV, 3D and personal viewing scenarios for rich media and innovations in technologies enabling multiscreen convergence. Ken’s Company, WebMobility Ventures, focuses on private investing and advising companies on bringing innovations in multimedia mobility to market.\r\n\r\nHe is also an Investment Advisor to Ascension Ventures who manage early stage EIS and SEIS funds. Prior to that he was Chairman of WirelessWorks with The Vesta Group, managing the investments of one of Europe’s top networked venture capital funds, Frontiers Capital. In addition to being a venture partner, he established and was Chairman of their Board of Advisors. He has also served on the board of directors and advisory board of several companies, all innovatively active in various sectors of mobile investment, product definition and service delivery. Previously, he was VP of Business Strategy for Wireless Internet at Nortel Networks.\r\n\r\nKen has held numerous industry positions including chairman of the Mobile Data Association, vice chair of the UMTS Forum Market Aspects Group, and in 2001 was named to the GSM Association ‘roll of honour’ for “longstanding commitment to the GSM industry”. In 2004 Ken launched and produced “Cool and Connected” a ‘Wearable Technology Fashion Show’ and in 2006 the “Innovation Showcase” of emerging key technologies at 3GSM World Congress in Barcelona and also at the International Broadcasters Conference in Amsterdam.\r\n\r\nKen was born, raised and educated in New England, USA (NH and Maine mostly) and has settled in the UK “for the time being” (30 years so far!).","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/09/kenb.jpg","name":"Ken Blakeslee","publicPlusId":"https://www.facebook.com/ken.blakeslee.75?fref=ts","plusoneUrl":""},{"id":"69","bio":"Kenton Price co-founded Little Fluffy Toys Ltd in 2009 with longtime friend and collaborator Reuben Scratton, helping clients deliver amazing Android apps.\r\n\r\nThis year they’ve delivered BBC Weather and Summly, and recently helped out with Pluralsight, Zeebox, Touchnote, Badoo and Yell. They also helped defend some big names in the mobile patent wars – their technical investigations saved one company millions of dollars, winning a case that others had settled.\r\n\r\nKenton Price has been a developer since the age of 12, and you can see the games he had published as a teenager in Beebdroid for Android, the BBC Micro emulator written in homage to the much-loved, teeth-cutting first computer.\r\n\r\nFind out more about Kenton at his talk!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/kenton.jpg","name":"Kenton Price","publicPlusId":"https://twitter.com/LFT_Android","plusoneUrl":""},{"id":"116","bio":"Kumar Rangarajan is the Chief Ion of Little Eye Labs, the easy yet powerful analysis tool for Android. His vision of building a world class product company to solve problems for the new generation of mobile developers is steadily coming true – if you share that dream, or you’re one of those new generation developers, don’t miss out on hearing him speak!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_KumarRangarajan-.jpg","name":"Kumar Rangarajan","publicPlusId":"https://twitter.com/kumrr","plusoneUrl":""},{"id":"61","bio":"Leslie Drewery is a self-confessed technology magpie – attracted to anything new and shiny, he’s on top of all of the latest developments, solutions, and technologies in Android. Having worked for HTC and Saffron in the past, he’s now Head of Product for That Device, delivering services that simplify popular internet applications. Find out how he runs such an effective team, and how you can do it too!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/leslie.png","name":"Leslie Drewery","publicPlusId":"https://twitter.com/ldrewery","plusoneUrl":""},{"id":"41","bio":"Linden Darling has been a pure-Android freelancer for 3 years, following roles in: web development, penetration and performance testing, enterprise consulting, and multimedia. He was the lead developer for the first Android app to interface with the Australian eHealth PCEHR system, and is currently working on the Android version of Life’s Little Treasures Foundation’s Premature Baby Journal. If you want to find out about how Android is being used in cutting edge medical technologies, he’s the man to come to!","thumbnailUrl":"","name":"Linden Darling","publicPlusId":"http://au.linkedin.com/in/lindendarling/","plusoneUrl":""},{"id":"79","bio":"Currently hacking on Firefox for Android, Lucas Rocha is an experienced UI engineer who has created several successful Android apps and libraries – including Pattrn, Two Way View and Smoothie.  Having worked at Litl and Nokia in the past, he’s going places – you can find out how he got to where he is at his talk!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_LucasRocha.jpg","name":"Lucas Rocha","publicPlusId":"http://twitter.com/lucasratmundo","plusoneUrl":""},{"id":"96","bio":"Luciano Broussal is the Director and Founder of Nuggeta, a game development toolkit that provides support for integrating achievements, leader boards, and other social features into games on all platforms. With 15 years of experience, he’s the ideal person to come to if you want to find out more about social media and gaming!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/09/luc.jpg","name":"Luciano Broussal ","publicPlusId":"https://twitter.com/nuggeta","plusoneUrl":""},{"id":"126","bio":"Mandy Waite works at Google, improving their Cloud platform and making sure their technologies evolve and grow to provide the best outcome for developers and end users alike. She works with App Engine and Compute Engine, as well as Google’s data storage engine and Big Query. In her spare time, she’s studying Japanese and Physics. Make sure not to miss this remarkable expert and learn what it’s like at the forefront of Google’s Cloud platform!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/09/mandy.jpg","name":"Mandy Waite","publicPlusId":"https://twitter.com/tekgrrl","plusoneUrl":""},{"id":"90","bio":"Marcos Placona is the principal Software Engineer at HostelBookers.com, and spends most of his days working with diverse technologies such as C#, Java, ColdFusion, Ruby and JavaScript – a geek by nature!\r\n\r\nHe spends most of his free time working on mobile applications, and enjoys acting as an advocate of good standards, automated software testing and open source projects. With such experience and a great name behind him, don’t miss out on his talk on how to manage seemingly uncontrollable projects!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/Marcos.png","name":"Marcos Placona","publicPlusId":"https://twitter.com/marcos_placona","plusoneUrl":""},{"id":"36","bio":"Mark Allison is an engineer devoted to helping you realise your full potential: on his technical Android UI/UX blog, he writes posts to help and advise Android developers on common problems. With over 30 years experience, you can ask him any design question under the sun and get a great answer â\u0080\u0093 donâ\u0080\u0099t miss out on the opportunity to pick his brain!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2012/09/markallison.jpg","name":"Mark Allison","publicPlusId":"https://twitter.com/MarkIAllison","plusoneUrl":""},{"id":"73","bio":"Founder of Commonsware, author of The Busy Coder’s Guide to Android Development, and three-time entrepreneur, Mark Murphy has been developing software for nearly 30 years – his experience ranges from the TRS-80 to the latest mobile devices, and he’s bringing it all to Droidcon London 2013! He’s answered over 10,000 development questions on Stack Overflow – and he’ll be happy to answer more from you at his talk!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_MarkMurphy.jpg","name":"Mark Murphy","publicPlusId":"http://www.twitter.com/commonsguy","plusoneUrl":""},{"id":"258","name":"Matt Gaunt","plusoneUrl":""},{"id":"39","bio":"As a software engineer at the world’s largest social audio platform, Matthias Kappler brings a fount of knowledge to Droidcon London 2013. He works on Soundcloud’s Android app and mobile service API, and was previously tech lead for mobile at Qype, as well as contributing to the book ‘Android in Practice’. He’s an experienced engineer that you don’t want to miss!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_MatthiasK%C3%A4ppler.jpg","name":"Matthias Käppler","publicPlusId":"https://twitter.com/mttkay","plusoneUrl":""},{"id":"225","name":"Matthias Käppler","plusoneUrl":""},{"id":"252","name":"Mihai Risca","plusoneUrl":""},{"id":"25","bio":"A rising star in the indie game scene, Nicoll Hunt has worked on everything from 2-man teams to companies with 250 employees – and now he’s started his own solo venture with his game studio I Fight Bears. His first game from this studio, Fist of Awesome, featured a time-travelling lumberjack saving the world from wild animals – it gained almost £12,000 in sponsorship on Kickstarter, as well as being picked as one of the first games for the OUYA console. He’ll be telling you all about it at this year’s Droidcon! He’s now flourishing in North London, creating more quirky mobile games – don’t miss out on the opportunity to meet him!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/games_NicollHunt.jpg","name":"Nicoll Hunt","publicPlusId":"https://twitter.com/nicollhunt","plusoneUrl":""},{"id":"256","name":"Penny Williams","plusoneUrl":""},{"id":"223","name":"Peter van der Linden","plusoneUrl":""},{"id":"94","bio":"Petros Rizos is a jack-of-all-trades, working in computer systems engineering as a site operations engineer and Devops. His experience has included building 3D printers from scratch – why not take advantage of his passion for problem solving and see him in person?","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/09/bp_PetrosRizos.jpg","name":"Petros Rizos","publicPlusId":"https://twitter.com/gumtree","plusoneUrl":""},{"id":"63","bio":"Pierre-Yves is Android Software Engineer at Square (http://squareup.com) a company building beautiful and reliable instruments of commerce, organiser of Devoxx France (http://devoxx.fr), contributor to Open Source projects, creator of AndroidAnnotations (http://androidannotations.org). He likes engineering everything from Android apps to map reduce jobs, to java web apps, to signal processing algorithms.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/Pierre-Ricau.jpg","name":"Pierre-Yves Ricau","publicPlusId":"https://twitter.com/piwai","plusoneUrl":""},{"id":"93","bio":"Rajit Singh is a self-employed developer with 15 years of experience at Gumtree, eBay, Yahoo! and the BBC. Focused mainly on the web industry, Rajit’s passion is in search, UI design, testing, and Agile methodologies.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/09/bp_RajitSingh.jpg","name":"Rajit Singh","publicPlusId":"https://twitter.com/gumtree","plusoneUrl":""},{"id":"82","bio":"Robert Konopka has been a Linux enthusiast since 1999. Over the years, he’s gathered experience in different Linux projects as a freelancer and as the data acquisition team leader at CERN. As one of the founders and CTO of zertisa, he is providing Android customizations and ROM-management solutions to OEMs and ODMs – don’t miss out on his expertise!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/09/bp_RobertKonopka.jpg","name":"Robert Konopka","publicPlusId":"http://www.linkedin.com/pub/robert-konopka/79/660/543","plusoneUrl":""},{"id":"265","name":"Robin Puthli","plusoneUrl":""},{"id":"248","name":"rod@wipconnector.com","plusoneUrl":""},{"id":"217","name":"Ronan 'Zero' Schwarz","plusoneUrl":""},{"id":"57","bio":"Scott Alexander Bown lives and breathes mobile development, with a particular focus on Android – as Senior Mobile Developer for viaForensics, he specialises in reverse engineering and app hardening. If you want to improve the security of your app, he knows it inside out – as you’ll find out at his talk!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/scotab.jpeg","name":"Scott Alexander-Bown","publicPlusId":"https://twitter.com/scottyab","plusoneUrl":""},{"id":"122","bio":"Sebastiano Poggi is a software engineer for the i’m Watch and an Android developer. He’s a strong OSS believer who loves to work on beautiful and simple user interfaces, where “less is more”.\r\n\r\nHe’s been working at i’m Spa for almost two years, and in the meantime he’s been involved in a few OSS projects on his spare time, some still unfinished.\r\n\r\nHe’s also the head of the i’m Developer program at i’m Spa, helping people deliver awesome apps for the i’m Watch and meeting them in person all over Europe. If you want to understand smart watches, he’s the go-to guy!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/09/sebastian.jpg","name":"Sebastiano Poggi","publicPlusId":"https://twitter.com/seebrock3r","plusoneUrl":""},{"id":"237","bio":"Shane Francis is a device maintainer and member of the CyanogenMod community who has worked on devices such as the Asus Transformer, Advent Vega and HTC Sensation – starting with the Advent Vega in 2010 while he was at University studying his computer science BSc.\r\n\r\nThroughout his time working within CyanogenMod he has worked on a multitude of other side projects that relate to the android operating system, such as an Open source IR application and helping to bring some of the advanced features of Sony’s camera hardware into CyanogenMod.\r\n\r\nShane has also worked on investigating the low level security implemented on tegra 3 tablets (such as the original Nexus 7) within the AndroidRoot.mobi project. Finally, Shane is a robotics and general technology enthusiast!","thumbnailUrl":"","name":"Shane Francis","publicPlusId":"https://plus.google.com/112837272535265201743","plusoneUrl":""},{"id":"162","bio":"Skills Matter helps a community of passionate developers learn and share skills to write better software. We collaborate with the world's leading innovators in software and thousands of passionate developers meeting up at Skills Matter, to produce some 450 intensive workshops, 500 talks & meetups, 2,000 hours worth of skillscast videos, quarterly Open Source Journal magazines per year. Join our community to learn and share skills on leading ideas and truly bleeding edge technologies (from HTML5, Android and iPhone to F#, Clojure and Scala, from DDD and CQRS to RDFa and NoSQL and from Lean, Kanban and Agile Leadership to Software Craftsmanship and Agile Testing to BDD).","thumbnailUrl":"http://skillsmatter.com/","name":"Skills Matter","publicPlusId":"http://skillsmatter.com/","plusoneUrl":""},{"id":"23","bio":"Stephan Brunner is the Head of Android Development for Runtastic – with 22 successful apps under his belt, this is a great opportunity for you to learn from one of the best in the business of app design! If you want to find out the best way to design, he’ll be explaining how using HOLO revolutionised the way his team created their highly rated apps!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/design_StephanBrunner.jpg","name":"Stephan Brunner","publicPlusId":"https://twitter.com/stephanbrunner8","plusoneUrl":""},{"id":"38","bio":"Stéphane Nicolas specialises in the development of Android applications for smartphones and tablets; currently working at OCTO Technology, he has 15 years of experience, and is an active participant in the development of Android. With his contributions to the integration of the Android platform with advanced industrialised programming techniques like Sonar, Maven, and Jenkins, he is a perfect candidate to give you an inside look at how Android might be improved even further!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_StephaneNicholas.jpeg","name":"Stéphane Nicolas","publicPlusId":"https://twitter.com/OCTOTechnology","plusoneUrl":""},{"id":"75","bio":"Stephen Naicken is a Research Fellow in the Foundation of Software Systems group at Sussex University. He is currently working on the Digital Stadium project, which is investigating the use of Android mobile devices to implement delay-tolerant networks in football stadia. He is particularly interested in finding ways to apply academic networking research to solve real-world problems.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/Stephen-Naicken.png","name":"Stephen Naicken","publicPlusId":"https://twitter.com/stephennaicken","plusoneUrl":""},{"id":"77","bio":"Taylor Ling specialises in User Interface and Interaction Design, and is currently working on life-changing medical software like SurgiCase Connect with Materialise Malaysia. A Professional Android Designer, his website AndroidUIUX.com regularly publishes resources for Android designers and developers – he was even recently invited by the Android team to be a Design Assistant for an Android Design Lab Session in Google I/O 2013. If you want to start making waves like Taylor, best make it to his talk!","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/design_TaylorLing.jpg","name":"Taylor Ling","publicPlusId":"https://twitter.com/taylorling","plusoneUrl":""},{"id":"98","bio":"Thomas Bredon is a skilled engineer and hacker working for Nuggeta. With a passion for problem solving and eagerness to overcome challenges, he believes nothing is impossible with computer science. If you think so too, why not meet him at his talk?","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/09/thomasbredon.jpg","name":"Thomas Bredon","publicPlusId":"https://twitter.com/nuggeta","plusoneUrl":""},{"id":"120","bio":"As a long time mobile and web developer specializing in Android, Tim channels his knowledge and experience as a Developer Evangelist across Europe for PayPal’s Developer Network. Tim is very passionate about startups, and serves as a mentor of Seedcamp, Wayra, Startup Wise Guys & Rockstart. In his spare time, he leads and creates training classes in all sorts of Android related topics, and is the author of the Android chapter of the Mobile Developer’s Guide to the Galaxy, as well as numerous articles published in magazines like Web&Mobile Developer. His ongoing work on this topic and having an app in Google’s Play Store with more than 300,000 downloads makes him a great resource for mobile related questions.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/10/Tim.png","name":"Tim Messerschmidt","publicPlusId":"https://twitter.com/SeraAndroid","plusoneUrl":""},{"id":"100","bio":"As a Senior Software Engineer with Twitter working on Crashlytics for Android, Ty Smith really knows his stuff! Before Twitter, he was involved in Evernote on the product team and SDK team, at Recapp as a cofounder, and was the lead engineer on Powow Text Messaging and Zagat for Android at One Louder Apps – so if you want to build apps that stand out and create a buzz, look no further.","thumbnailUrl":"http://uk.droidcon.com/2013/wp-content/uploads/2013/08/bp_TySmith.jpg","name":"Ty Smith","publicPlusId":"https://twitter.com/tylersmithnet","plusoneUrl":""},{"id":"209","bio":"William Hansford-White is an Application Engineer in Intel’s Software and Services Group. William has just recently joined Intel coming from a gaming orientated background. William’s role at Intel is to port and optimize ISVs to current Intel platforms.","thumbnailUrl":"","name":"William Hansford-White","publicPlusId":"","plusoneUrl":""},{"id":"246","name":"William Hansford-White","plusoneUrl":""}]}